const data = [
    {
        name: '解表药',
        children: [
            {
                name: '辛温解表药',
                list: [
                    {
                        name: '麻黄',
                        gongneng: '发汗解表，宣肺平喘，利水消肿',
                        zhuyi: '小孩老人麻黄绒'
                    },
                    {
                        name: '香薷',
                        gongneng: '发汗解表，和中化湿，利水消肿',
                        tedian: '夏月麻黄，阴暑证',
                        zhuyi: '发汗解暑宜水煎凉服，利水退肿须浓煎或为丸服'
                    },
                    {
                        name: '桂枝',
                        gongneng: '发汗解肌，温通经脉，助阳化气',
                        tedian: '风寒表虚有汗（配白芍），风寒表实无汗（配麻黄）'
                    },
                    {
                        name: '紫苏',
                        gongneng: '发表散寒，行气宽中，安胎，解鱼蟹毒',
                        zhuyi: '叶长于发表散寒，梗长于理气宽中、安胎'
                    },
                    {
                        name: '生姜',
                        gongneng: '发汗解表，温中止呕，温肺止咳',
                        tedian: '呕家圣药,解鱼蟹、半夏及天南星毒'
                    },
                    {
                        name: '荆芥',
                        gongneng: '散风解表，透疹止痒，止血',
                        tedian: '力平和，散风发表通用，风寒、风热皆宜;疮疡初起有表证者'
                    },
                    {
                        name: '防风',
                        gongneng: '祛风解表，胜湿止痛，解痉',
                        tedian: '治风通用药，散外风、内风皆宜，治风寒、风热及表证夹湿皆可，风寒湿三邪客体用之最宜。'
                    },
                    {
                        name: '羌活',
                        gongneng: '解表散寒，祛风胜湿，止痛',
                        tedian: '主表、主上;善治太阳经头痛及颈项痛，特别是肩背肢节疼痛。',
                        zhuyi: '气味浓烈，用量过多易致呕吐'
                    },
                    {
                        name: '藁本',
                        gongneng: '发表散寒，祛风胜湿，止痛。',
                        tedian: '善治表证夹湿、风寒湿痹与颠顶头痛，兼治寒湿腹痛、腹泻。外用尚能祛风湿止痒',
                        zhuyi: ''
                    },
                    {
                        name: '细辛',
                        gongneng: '祛风散寒，通窍，止痛，温肺化饮（同干姜）',
                        tedian: '为治风寒、风湿所致诸痛及鼻渊鼻塞头痛之良药。为治寒饮伏肺之要药。最宜少阴头痛、鼻渊头痛及牙痛。',
                        zhuyi: ''
                    },
                    {
                        name: '白芷',
                        gongneng: '散风寒，通窍止痛，燥湿止带，消肿排脓',
                        tedian: '阳明头痛（技巧：白羊座），眉棱骨痛，鼻渊头痛，牙痛',
                        zhuyi: ''
                    },
                    {
                        name: '苍耳子',
                        gongneng: '散风寒，通鼻窍，除湿止痛，止痒',
                        tedian: '',
                        zhuyi: '过量服用易致中毒，引起呕吐、腹痛、腹泻等。血虚头痛者不宜服'
                    },
                    {
                        name: '辛夷',
                        gongneng: '散风寒，通鼻窍',
                        tedian: '',
                        zhuyi: '内服宜用纱布包煎'
                    },
                    {
                        name: '西河柳',
                        gongneng: '发表透疹，祛风除湿',
                        tedian: '风湿痹痛',
                        zhuyi: ''
                    },
                ]
            },
            {
                name: '辛凉解表药',
                list: [
                    {
                        name: '薄荷',
                        gongneng: '宣散风热，清利头目，利咽，透疹，疏肝',
                        tedian: '其叶长于发汗，梗偏于理气',
                        zhuyi: '不宜久煎，入汤剂当后下'
                    },
                    {
                        name: '蔓荆子',
                        gongneng: '疏散风热，清利头目，祛风止痛',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '牛蒡子',
                        gongneng: '疏散风热，宣肺利咽，解毒透疹，消肿疗疮',
                        tedian: '风疹瘙痒,痄腮',
                        zhuyi: '本品滑肠，故脾虚便溏者忌服;入煎剂宜打碎，炒用寒性略减',
                        jiqiao: '会了肺炎的诊疗，又牛又棒！'
                    },
                    {
                        name: '蝉蜕',
                        gongneng: '疏散风热，透疹止痒，明目退翳，息风止痉',
                        tedian: '小儿惊哭夜啼，破伤风',
                        zhuyi: ''
                    },
                    {
                        name: '桑叶',
                        gongneng: '疏散风热，清肺润燥，平肝明目，凉血止血',
                        tedian: '',
                        zhuyi: '',
                        jiqiao: '风干两只肺'
                    },
                    {
                        name: '菊花',
                        gongneng: '疏散风热，平肝明目，清热解毒',
                        tedian: '肝阳头痛,热毒疮肿',
                        zhuyi: ''
                    },
                    {
                        name: '葛根',
                        gongneng: '解肌退热，透疹，生津，升阳止泻',
                        tedian: '湿热泻痢初起;治项背强痛与阳明头痛最宜，无论寒热虚实、有汗无汗皆可',
                        zhuyi: '止泻宜煨用，退热生津、透疹宜生用，鲜葛根生津最佳'
                    },
                    {
                        name: '柴胡',
                        gongneng: '解表退热，疏肝解郁，升举阳气',
                        tedian: '少阳寒热往来',
                        zhuyi: ''
                    },
                    {
                        name: '升麻',
                        gongneng: '发表透疹，清热解毒，升举阳气',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '淡豆豉',
                        gongneng: '解表，除烦',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '浮萍',
                        gongneng: '发汗解表，透疹止痒，利水消肿',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '木贼',
                        gongneng: '疏散风热，明目退翳，止血',
                        tedian: '风热目赤，迎风流泪，翳障；血热下血',
                        zhuyi: ''
                    },
                ]
            },
        ],

    },
    {
        name: '清热药',
        children: [
            {
                name: '清热泻火药',
                list: [
                    {
                        name: '石膏',
                        gongneng: `生用：清热泻火，除烦止渴；
                    　　煅用：收湿敛疮，生肌止血
                    `,
                        tedian: '气分高热和肺胃实火之要药',
                        zhuyi: ''
                    },
                    {
                        name: '知母',
                        gongneng: '清热泻火，滋阴润燥',
                        tedian: '上能清肺而泻火，中清胃热而除烦渴，下滋肾阴而润燥滑肠、退虚热。',
                        zhuyi: '清泻实火宜生用，滋阴降火宜盐水炒用'
                    },
                    {
                        name: '天花粉',
                        gongneng: '清热生津，清肺润燥，消肿排脓。',
                        tedian: '燥咳痰黏;痈肿疮疡，跌打肿痛',
                        zhuyi: '大便滑泄者忌服。孕妇忌服。反乌头。因兼酸味有敛邪之嫌，温热病不宜早用。',
                        jiqiao: '粉总费金'
                    },
                    {
                        name: '栀子',
                        gongneng: '泻火除烦，清热利尿，凉血解毒，消肿止痛',
                        tedian: '生用走气分而泻火，炒黑入血分而止血，姜汁炒又除烦止呕。栀子仁（用种子）善清心除烦，栀子皮（用果皮）兼清表热',
                        zhuyi: `湿热黄疸，热淋，血淋。
                    　　3.血热之吐血、衄血、尿血;热毒疮肿，跌打肿痛
                    `
                    },
                    {
                        name: '芦根',
                        gongneng: '清热生津，除烦止呕，利尿',
                        tedian: '胃热呕哕;肺痈吐脓',
                        zhuyi: ''
                    },
                    {
                        name: '竹叶',
                        gongneng: '清热除烦，生津，利尿',
                        tedian: '热病烦渴，心火上炎之口舌生疮;热入心包之神昏谵语',
                        zhuyi: ''
                    },
                    {
                        name: '淡竹叶',
                        gongneng: '清热除烦，利尿',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '夏枯草',
                        gongneng: '清肝明目，散结消肿。',
                        tedian: '目珠夜痛。痰火郁结之瘰疬、瘿瘤',
                        zhuyi: '',
                        jiqiao: '清明吓哭小姐姐'
                    },
                    {
                        name: '决明子',
                        gongneng: '清肝明目，润肠通便',
                        tedian: '肝热或肝经风热之目赤肿痛、羞明多泪',
                        zhuyi: '降血脂或治热结肠燥便秘可用至30g。生用清肝明目、润肠通便力较强。炒用药力略减，临床也常用。',
                        jiqiao: '决定眼睛明亮的种子'
                    },
                    {
                        name: '密蒙花',
                        gongneng: '清热养肝，明目退翳',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '谷精草',
                        gongneng: '疏散风热，明目退翳',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '青葙子',
                        gongneng: '清肝泻火，明目退翳',
                        tedian: '肝火上炎，目赤肿痛，目生翳膜。',
                        zhuyi: '有扩瞳作用，瞳孔散大者忌服'
                    },
                ]
            },
            {
                name: '清热燥湿药',
                list: [
                    {
                        name: '黄芩',
                        gongneng: '清热燥湿，泻火解毒，止血，安胎。',
                        tedian: '肺热咳喘，少阳寒热;胎热之胎动不安',
                        zhuyi: '内服：煎汤；或入丸散。生用清热燥湿、泻火解毒作用较强，湿热、热毒诸证宜用。炒黄芩苦寒之性略减，胎热胎动不安宜用。酒炒黄芩能上行，清上焦热宜用。炒炭凉血止血力较强，血热出血宜用。传统认为，条芩善清大肠火，枯芩善清肺火;'
                    },
                    {
                        name: '黄连',
                        gongneng: '清热燥湿，泻火解毒。',
                        tedian: '肝火犯胃之呕吐吞酸。（左金丸',
                        zhuyi: '',
                        jiqiao: '黄连配半夏、瓜蒌:拌黄瓜治结胸'
                    },
                    {
                        name: '黄柏',
                        gongneng: '清热燥湿，泻火解毒，退虚热',
                        tedian: '湿热下注之带下、淋浊、脚气、足膝红肿;骨蒸潮热',
                        zhuyi: '清热燥湿解毒宜生用，清相火退虚热宜盐水炒用，止血宜炒炭'
                    },
                    {
                        name: '龙胆',
                        gongneng: '清热燥湿，泻肝胆火',
                        tedian: '为治肝经湿热、实火之要药',
                        zhuyi: '湿热下注;肝火上炎;高热抽搐，小儿急惊，带状疱疹'
                    },
                    {
                        name: '苦参',
                        gongneng: '清热燥湿，杀虫止痒，利尿',
                        tedian: '疥癣;湿热淋痛',
                        zhuyi: ''
                    },
                ]
            },
            {
                name: '清热凉血药',
                list: [
                    {
                        name: '生地黄',
                        gongneng: '清热凉血，养阴生津，润肠',
                        tedian: '鲜地黄长于清热凉血；干地黄长于滋阴。炒炭多用于止血',
                        zhuyi: '本品寒滑腻滞，故脾虚食少便溏及湿滞中满者忌服'
                    },
                    {
                        name: '玄参',
                        gongneng: '清热凉血，滋阴降火，解毒散结，润肠',
                        tedian: `　1.温病热入营血，温毒发斑。
                    　　2.热病伤阴之心烦不眠，阴虚火旺之骨蒸潮热。
                    　　3.咽喉肿痛，痈肿疮毒，瘰疬痰核，阳毒脱疽。
                    　　4.阴虚肠燥便秘。
                    `,
                        zhuyi: '',
                        jiqiao: '对比生地区别记忆'
                    },
                    {
                        name: '牡丹皮',
                        gongneng: '清热凉血，活血散瘀，退虚热',
                        tedian: `温病热入血分而发斑疹，血热吐血、衄血;
                    温病后期阴虚发热，久病伤阴之无汗骨蒸(技巧：牡丹花下死，死而无憾)
                    血滞之闭经、痛经，产后瘀阻，癥瘕，跌打伤肿; 
                    痈肿疮毒，肠痈腹痛。（拓展技巧：大黄牡丹汤治疗肠痈）`,
                        zhuyi: '',
                        jiqiao: '六味地黄丸的组成'
                    },
                    {
                        name: '赤芍',
                        gongneng: '清热凉血，散瘀止痛，清肝火',
                        tedian: `温病热入营血之斑疹吐衄，火热内伤之血热吐衄，皮下出血。
                    　　2.血滞之闭经、痛经，产后瘀阻，癥瘕，跌打肿痛。
                    　　3.痈肿疮毒，目赤肿痛，肝郁化火之胁痛。
                    `,
                        zhuyi: '',
                        jiqiao: '芍药与肝有关，对比白芍（补血药）区别记忆'
                    },
                    {
                        name: '紫草',
                        gongneng: '凉血活血，解毒透疹',
                        tedian: `1.温病血热毒盛之斑疹紫黑。
                    　　2.防治麻疹。
                    　　3.疮疡，湿疹，阴痒，水火烫伤。
                    `,
                        zhuyi: ''
                    },
                    {
                        name: '水牛角',
                        gongneng: '清热凉血，泻火解毒，定惊',
                        tedian: '',
                        zhuyi: '煎汤，15～30g，大剂量60～120g，宜锉碎先煎3小时以上。水牛角浓缩粉，每次1.5～3g，一日2次，开水冲下。代犀角宜加量'
                    },
                ]
            },
            {
                name: '清热解毒药',
                list: [
                    {
                        name: '金银花',
                        gongneng: '清热解毒，疏散风热',
                        tedian: `温病各个阶段皆宜，常配连翘，在卫分能透表，气分能清解，营分能透营转气，血分能清解血分热毒。
                    `,
                        bingzhen: `1.外感热病，风热表证。
                    　　2.痈疮疖肿，肠痈，肺痈，乳痈。
                    　　3.热毒泻痢。
                    `,
                        zhuyi: '连翘心长于清心火，治热入心包证常带心用'
                    },
                    {
                        name: '连翘',
                        gongneng: '清热解毒，疏散风热，消肿散结，利尿',
                        tedian: '疮家圣药',
                        zhuyi: ''
                    },
                    {
                        name: '蒲公英（黄花地丁）',
                        gongneng: '清热解毒，消痈散结，利湿通淋',
                        tedian: '药食兼用，既善清热解毒，又兼疏肝通乳、散结消痈，还能利尿、缓通大便，导湿热、热毒从二便而出。',
                        zhuyi: ''
                    },
                    {
                        name: '鱼腥草',
                        gongneng: '清热解毒，排脓消痈，利尿通淋',
                        tedian: '肺痈咳吐脓血，肺热咳嗽痰稠。热毒疮疡，湿热泻痢。3.热淋涩痛',
                        zhuyi: ''
                    },
                    {
                        name: '败酱草',
                        gongneng: '清热解毒，消痈排脓，祛瘀止痛',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '金荞麦',
                        gongneng: '清热解毒，祛痰排脓，散瘀止痛，健脾除湿',
                        tedian: '为治肺痈、肺热咳痰之要药',
                        zhuyi: '',
                        jiqiao: '对比败酱草区别记忆'
                    },
                    {
                        name: '大青叶',
                        gongneng: '清热解毒，凉血消斑，利咽消肿',
                        tedian: '为治温病高热斑疹之要药',
                        zhuyi: ''
                    },
                    {
                        name: '板蓝根',
                        gongneng: '清热解毒，凉血，利咽。',
                        tedian: '尤善治咽喉肿痛与颜面丹毒（大头瘟疫）',
                        zhuyi: '',
                        jiqiao: '老板四两盐。四对应清热解毒，两对应凉，盐对应咽）'
                    },
                    {
                        name: '青黛',
                        gongneng: '清热解毒，凉血消斑，定惊(色青入肝，能定惊)',
                        tedian: '内服：1～3g，',
                        zhuyi: '本品性寒易伤胃，故胃寒者慎服。部分病人服后出现恶心、呕吐、腹痛、腹泻、便血诸症状，也能影响肝功能，严重者可抑制骨髓造血功能引起血小板减少'
                    },
                    {
                        name: '牛黄',
                        gongneng: '清热解毒，息风止痉，化痰开窍',
                        tedian: '为凉开之要药',
                        zhuyi: ''
                    },
                    {
                        name: '射干',
                        gongneng: '清热解毒，祛痰利咽，散结消肿',
                        tedian: '既清热降火而消肿解毒，又散瘀祛痰而消结除癥;痰多咳喘',
                        zhuyi: '本品苦寒缓泻，又能散血，故孕妇及脾虚便溏者忌服',
                        jiqiao: '小姐姐坛中腌蛇干',
                        qita: '配伍-射干配麻黄：治热结痰瘀之痰饮咳喘、喉中辘辘如水鸡声效佳。'
                    },
                    {
                        name: '山豆根',
                        gongneng: '清热解毒，消肿利咽',
                        tedian: '湿热黄疸；药力颇强，治咽喉肿痛属火毒炽盛者最宜，治胃火牙龈肿痛亦佳。实火壅塞者多用；风热者不宜早用，完全化热时方可用。',
                        zhuyi: ''
                    },
                    {
                        name: '马勃',
                        gongneng: '清肺，解毒，利咽，止血',
                        tedian: '咳嗽失音',
                        zhuyi: ''
                    },
                    {
                        name: '木蝴蝶',
                        gongneng: '清热利咽，疏肝和胃',
                        tedian: '音哑',
                        zhuyi: ''
                    },
                    {
                        name: '白头翁',
                        gongneng: '清热解毒，凉血止痢。',
                        tedian: '既治热毒血痢（急性痢疾及慢性痢疾急性发作），又治休息痢（阿米巴痢疾）',
                        zhuyi: ''
                    },
                    {
                        name: '马齿苋',
                        gongneng: '',
                        tedian: '清热解毒，凉血止血，通淋',
                        zhuyi: '',
                        jiqiao: '两只马死，因为淋证'
                    },
                    {
                        name: '鸦胆子',
                        gongneng: '清热解毒，燥湿杀虫，止痢截疟，腐蚀赘疣',
                        tedian: '',
                        bingzhen: `休息痢（阿米巴痢疾），热毒血痢。（同白头翁）
                    　　2.疟疾。
                    　　3.赘疣，鸡眼（外用）。
                    `,
                        zhuyi: '每次10～15粒（治疟疾）或10～30粒（治痢疾）;或0.5～2g，每日3次。味极苦，不宜入煎剂，应去壳取仁，装入胶囊，或以龙眼肉或馍皮包裹吞服',
                        qita: '本品有小毒，能刺激胃肠道、损伤肝肾，故宜中病即止'
                    },
                    {
                        name: '白鲜皮',
                        gongneng: '清热解毒，祛风燥湿，止痒',
                        tedian: '诸黄风痹之要药;湿热疮疹，疥癣瘙痒。（技巧：鲜联系癣）',
                        zhuyi: '',
                    },
                    {
                        name: '穿心莲',
                        gongneng: '清热解毒，燥湿',
                        tedian: '凡热毒或湿热毒所致病证，无论在上在下、在里在表均可选用。此外，还解蛇毒',
                        zhuyi: '',
                        jiqiao: '一箭穿心找死。找对应燥，死对应清热解毒'
                    },
                    {
                        name: '土茯苓',
                        gongneng: '解毒，利湿，通利关节(通利关节还有川牛膝)',
                        tedian: '',
                        bingzhen: '梅毒，或因患梅毒服汞剂而致肢体拘挛者;淋浊，带下，脚气，湿疹，湿疮',
                        zhuyi: ''
                    },
                    {
                        name: '白花蛇舌草',
                        gongneng: '清热解毒，消痈，利湿。',
                        tedian: '',
                        zhuyi: '',
                        jiqiao: '抗癌勇士。勇对应痈，士对应湿'
                    },
                    {
                        name: '地锦草',
                        gongneng: '清热解毒，活血止血，利湿退黄',
                        tedian: '',
                        zhuyi: '',
                        jiqiao: '只活4小时。只活对应活血止血，4对应清热解毒，时对应湿）'
                    },
                    {
                        name: '垂盆草',
                        gongneng: '清热解毒，利湿退黄',
                        tedian: '有保肝作用，治肝炎有无黄疸皆宜;水火烫伤',
                        zhuyi: ''
                    },
                    {
                        name: '秦皮',
                        gongneng: '清热解毒，燥湿止带，清肝明目',
                        tedian: '',
                        bingzhen: '湿热泻痢;赤白带下。3.目赤肿痛，目生翳膜',
                        zhuyi: ''
                    },
                    {
                        name: '大血藤',
                        gongneng: '清热解毒，活血止痛，祛风通络',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '野菊花',
                        gongneng: '热解毒，疏风平肝',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '紫花地丁',
                        gongneng: '清热解毒，凉血消肿',
                        tedian: '',
                        zhuyi: ''
                    },
                    {
                        name: '重楼',
                        gongneng: '清热解毒，消肿止痛，凉肝定惊',
                        tedian: '虽内痈、外痈皆治，但以外痈为主。为治毒蛇咬伤之要药',
                        zhuyi: '',
                        jiqiao: '四楼干净，爬楼腿总痛。四对应清热解毒，干净对应凉肝定惊，总痛对应消肿止痛）'
                    },
                    {
                        name: '半边莲',
                        gongneng: '清热解毒，利水消肿',
                        tedian: '家有半边莲，可以伴蛇眠',
                        zhuyi: '',
                        jiqiao: '半边脸水肿'
                    },
                    {
                        name: '半枝莲',
                        gongneng: '清热解毒，散瘀止血，利水消肿',
                        tedian: '癌肿',
                        zhuyi: '',
                        jiqiao: '枝对应止，止血；其次对比半边莲'
                    },
                ]
            },
            {
                name: '请退虚热药',
                list: [
                    {
                        name: '青蒿',
                        gongneng: '退虚热，凉血，解暑，截疟',
                        tedian: '',
                        zhuyi: '',
                        jiqiao: '感情好需要两个结婚证书'
                    },
                    {
                        name: '地骨皮',
                        gongneng: '退虚热，凉血，清肺降火，生津',
                        tedian: '有汗骨蒸',
                        zhuyi: '',
                        bingzhen: `阴虚发热，有汗骨蒸，小儿疳热。
                    　　2.血热之吐血、衄血、尿血。
                    　　3.肺热咳嗽。
                    　　4.内热消渴。
                    `
                    },
                    {
                        name: '白薇',
                        gongneng: '退虚热，凉血清热，利尿通淋，解毒疗疮',
                        tedian: '',
                        zhuyi: '',
                        bingzhen: `阴虚发热，骨蒸潮热，产后虚热，阴虚外感。
                    　　2.温病热入营血证，肺热咳嗽。
                    　　3.热淋，血淋。
                    `,
                        peiwu: '白薇配玉竹:治阴虚外感每选'
                    },
                    {
                        name: '胡黄连',
                        gongneng: '退虚热，除疳热，清湿热，解热毒',
                        tedian: '',
                        bingzhen: `骨蒸潮热。
                    　　2.小儿疳热。
                    　　3.湿热泻痢，黄疸。
                    　　4.咽痛，疮肿，痔肿便血。
                    `,
                        zhuyi: ''
                    },
                    {
                        name: '银柴胡',
                        gongneng: '退虚热，清疳热',
                        tedian: '',
                        zhuyi: ''
                    },
                ]
            },
        ],

    },

    {
        name: '泻下药',
        children: [
            {
                name: '攻下药',
                list: [
                    {
                        name: '大黄',
                        gongneng: '攻积，泻火，解毒止血，活血祛瘀',
                        tedian: '“釜底抽薪”、“将军”。生用泻下力猛，熟用药力较缓，炒炭清散兼收敛。',
                        zhuyi: '生大黄泻下作用强，欲攻下者宜生用，入汤剂应后下，久煎则泻下力减弱；亦可用开水泡服，或研末吞服。酒大黄，取酒上行之性，多用于上部火热之证。制大黄，泻下力减弱，活血作用较好，多用于瘀血证或不宜峻下者。大黄炭则凉血化瘀止血。'

                    },
                    {
                        name: '芒硝',
                        gongneng: '泻下，软坚，清热，回乳（外用）',
                        qita: '内服：冲入药汁内或开水溶化；或入丸散。外用：喷撒，漱口，点眼，化水坐浴。'
                    },
                    {
                        name: '芦荟',
                        gongneng: '泻下，清肝，杀虫',
                        bingzhen: '热结便秘，肝经实火，肝热惊风',
                        zhuyi: '入丸剂，不入汤剂，或研末装入胶囊服'
                    },
                    {
                        name: '番泻叶',
                        tedian: '大量用（＞3g）既泻热通便，导水湿热毒外出，又行水而退水肿；少量用（＜3g）则助消化、消食积。',
                        gongneng: '泻热通便，消积健胃'
                    },
                ]
            },
            {
                name: '润下药',
                list: [
                    {
                        name: '火麻仁',
                        gongneng: '润肠通便',
                        tedian: '善润燥滑肠兼补虚，体虚肠燥者最宜',
                        zhuyi: '本品虽无毒，但超大量食入也可引起中毒，症状为恶心、呕吐、腹泻、四肢麻木、失去定向力、抽搐、精神错乱、昏迷及瞳孔散大等。'
                    },
                    {
                        name: '郁李仁',
                        gongneng: '润肠通便，利水消肿',
                        tedian: '本品辛散苦降，甘平质润，入脾经与大肠、小肠经。既润肠通便，又利水消肿，还行肠中滞气。治肠燥便秘，兼气滞者尤佳；治水肿胀满及脚气浮肿，兼二便不利者最宜'
                    },
                ]
            },
            {
                name: '峻下逐水药',
                list: [
                    {
                        name: '甘遂',
                        gongneng: '泻水逐饮，消肿散结',
                        tedian: '通利二便而泻水逐饮，为治水肿、风痰癫痫及疮毒之猛药。“能行经隧之水湿”，服后常引起峻泻，使体内水饮得以排出。',
                        zhuyi: '内服：宜入丸散，每次0.5～1.5g。其泻下有效成分不溶于水，醋制可减低毒性.枣汤送服或研末装胶囊吞服，可减轻反应。反甘草。'
                    },
                    {
                        name: '京大戟',
                        gongneng: '泻水逐饮，消肿散结',
                        tedian: '通利二便而泻水逐饮，能泄脏腑之水湿'
                    },
                    {
                        name: '红大戟',
                        gongneng: '泻水逐饮，消肿散结',
                        tedian: '通利二便而泻水逐饮',
                        jiqiao: '甘（甘遂）心跟随（遂，逐水）大（大戟）小姐（消肿散结）'
                    },
                    {
                        name: '巴豆',
                        gongneng: '泻下冷积，逐水退肿，祛痰利咽，蚀疮去腐',
                        tedian: '善祛痰利咽而治白喉，有斩关夺门之功',
                        bingzhen: `寒积便秘，腹满胀痛，小儿痰食积滞。
                　　2.大腹水肿。
                　　3.寒实结胸，喉痹痰阻。
                　　4.痈肿脓成未溃，恶疮烂肉，疥癣。
                `,
                        zhuyi: '内服：入丸散或装胶囊，0.1～0.3g，不入汤剂，止泻必须炒炭服。外用：适量，研末敷。内服宜制成巴豆霜用，以降低毒性。服巴豆后如泻下不止者，用黄连、黄柏煎汤冷服，或食冷粥以缓解。畏牵牛子，不宜与之同用。'
                    },
                    {
                        name: '牵牛子',
                        gongneng: '泻下，逐水，去积，杀虫',
                        jiqiao: '牵牛下水去杀鸡',
                        tedian: '少则动大便，多则下水饮，尤宜水肿、痰饮兼二便不利或积滞内停者',
                        zhuyi: '服用大剂量牵牛子，除对胃肠的直接刺激引起呕吐、腹痛、腹泻与黏液血便外，还可能刺激肾脏，引起血尿，重者尚可损及神经系统，发生语言障碍、昏迷等。'
                    },
                    {
                        name: '芫花',
                        gongneng: '泻水逐饮，祛痰止咳。外用杀虫疗疮。',
                        bingzhen: `1.身面浮肿，大腹水肿，胸胁停饮。
                　　2.寒痰咳喘。
                　　3.头疮，白秃，顽癣，冻疮。
                `
                    },
                    {
                        name: '千金子',
                        gongneng: '泻水逐饮，破血消癥。',
                        tedian: '虽通利二便，却以通利大便为主',
                        bingzhen: `
                水肿，鼓胀。癥瘕，闭经。
                　　3.顽癣，赘疣，毒蛇咬伤。
                `,
                        zhuyi: '内服：制霜后入丸散，1～2g，或装入胶囊；选用肠溶胶囊，可减轻对胃的刺激。外用：适量，捣敷，或研末醋调敷。'
                    },
                ]
            },
        ]
    },
    {
        name: '祛风湿药',
        list: [
            {
                name: '独活',
                gongneng: '祛风湿，止痛，解表',
                tedian: '作用偏里、偏下，主散在里伏风及寒湿而通利关节止痛，尤善治少阴伏风头痛及下半身风寒湿痹。',
                bingzhen: `
          1.风寒湿痹，腰膝酸痛。
　　2.表证夹湿。
　　3.少阴头痛，皮肤湿痒。
          `
            },
            {
                name: '威灵仙',
                gongneng: '祛风湿，通经络，消痰水，治骨鲠',
                zhuyi: '本品性走窜，久服易伤正气，故体弱者慎服。'
            },
            {
                name: '防己',
                gongneng: '祛风湿，止痛，利水。',
                bingzhen: `1.风湿痹痛，尤以热痹为佳。
        　　2.水肿，腹水，脚气浮肿，小便不利。
        `
            },
            {
                name: '秦艽',
                tedian: '治痹证通用，无论寒热新久虚实兼表与否皆可。',
                gongneng: '祛风湿，舒筋络，清虚热，利湿退黄。'
            },
            {
                name: '徐长卿',
                tedian: '止痛力强',
                gongneng: '祛风止痛，活血通络，止痒，解蛇毒。',
                bingzhen: '术后痛，癌肿痛。风疹，湿疹，顽癣毒蛇咬伤'
            },
            {
                name: '木瓜',
                tedian: '祛邪扶正两相兼，酸生津而不敛湿邪，温化湿而不燥烈伤阴',
                gongneng: '舒筋活络，化湿和中，生津开胃。 （另香薷可以和中化湿）',
                bingzhen: `
        1.风湿痹痛，筋脉拘挛，脚气肿痛。
　　2.湿浊中阻所致吐泻转筋。
　　3.津亏食少（消化不良）证。

`
            },
            {
                name: '桑寄生',
                gongneng: '祛风湿，补肝肾，强筋骨，安胎。',
                bingzhen: `
        风湿痹证，腰膝酸痛。
　　2.肝肾虚损，冲任不固所致的胎漏、胎动不安

        `
            },
            {
                name: '五加皮',
                gongneng: '祛风湿，补肝肾，强筋骨，利水',
                bingzhen: `
        1.风湿痹痛，四肢拘挛。
　　2.肝肾不足所致的腰膝软弱、小儿行迟。
　　3.水肿，脚气浮肿。

        `
            },
            {
                name: '香加皮',
                gongneng: '祛风湿，强筋骨，利水消肿',
                bingzhen: '水肿（尤宜心衰性水肿），小便不利'
            },
            {
                name: '豨莶草',
                gongneng: '祛风湿，通经络，清热解毒，降血压。',
                bingzhen: `1.风湿痹痛，肢体麻木。
        　　2.中风手足不遂。
        　　3.痈肿疮毒，湿疹瘙痒。
        　　4.高血压病。
        `,
                peiwu: '豨莶草配臭梧桐：豨莶草性寒，功能祛风湿、通经络、降血压；臭梧桐性凉，功能祛风、除湿、活络、降血压.若为风湿痹痛肢麻兼高血压者用之最宜。',
                zhuyi: '生用或大剂量用易致呕吐，故内服不宜过量。'
            },
            {
                name: '臭梧桐',
                gongneng: '祛风湿，通经络，降血压',
            },
            {
                name: '川乌',
                gongneng: '祛风除湿，散寒止痛',
                bingzhen: `
        1.风寒湿痹，寒湿头痛。
　　2.心腹冷痛，寒疝腹痛。
　　3.局部麻醉（外用）。
`,
                zhuyi: '酒浸毒性强，故不宜浸酒饮用。煎汤，1.5～3g；或入丸散。宜炮制后用（三生饮除外）。入汤剂应先煎30～60分钟，以减低毒性。'
            },
            {
                name: '络石藤',
                gongneng: '祛风通络，凉血消肿。',
                bingzhen: '风湿痹痛，筋脉拘挛。2.喉痹，痈肿。 '
            },
            {
                name: '雷公藤',
                tedian: '苦、辛，凉。有大毒',
                gongneng: '祛风除湿，活血通络，消肿止痛，杀虫解毒',
                bingzhen: '疔疮肿毒，腰带疮，湿疹，麻风，疥癣。',
                zhuyi: '本品剧毒，故内服宜慎，孕妇忌服，患心、肝、肾器质性病变或白细胞减少症者慎服。外敷不可超过半个小时，否则起疱。带皮者剧毒，用时宜去皮。'
            },
            {
                name: '海风藤',
                gongneng: '祛风湿，通经络'
            },
            {
                name: '青风藤',
                gongneng: '祛风湿，通经络，利小便。',
                bingzhen: `
        1.风湿痹痛，关节肿胀，拘挛麻木。
　　    2.脚气浮肿。

        `
            },
            {
                name: '丝瓜络',
                gongneng: '祛风通络，化痰解毒。',
            },
            {
                name: '鹿衔草/红肺筋草',
                gongneng: '祛风湿，强筋骨，调经止血，补肺止咳',
                zhuyi: '因其煎剂有避孕作用，故备孕妇女忌用，孕妇慎用。'
            },
            {
                name: '蕲蛇',
                gongneng: '祛风通络，定惊止痉。',
                bingzhen: `1.风湿痹痛，筋脉拘挛。
        　　2.中风半身不遂，口眼 斜，肢体麻木。
        　　3.破伤风，急、慢惊风。
        　　4.麻风，顽癣，皮肤瘙痒。
        `
            },
            {
                name: '乌梢蛇',
                gongneng: '祛风通络，定惊止痉,',
                jiqiao: '同乌梢蛇'
            },
            {
                name: '伸筋草',
                gongneng: '祛风除湿，舒筋活络，活血消肿',
            },
            {
                name: '千年健',
                tedian: '治风湿痹痛兼肝肾亏虚之要药。多入药酒，尤宜老人。',
                gongneng: '祛风湿，强筋骨'
            },
            {
                name: '桑枝',
                tedian: '治痹证或水肿，无论寒、热皆宜，肩臂痛或兼水肿者尤佳。',
                gongneng: '祛风通络，利水',
            },
            {
                name: '路路通',
                gongneng: '祛风活络，利水，通经下乳，止痒。',
                jiqiao: '通经通乳通小便'
            },
            {
                name: '穿山龙',
                gongneng: '祛风除湿，活血通络，化痰止咳',

            },
        ]
    },
    {
        name: '芳香化湿药',
        list: [
            {
                name: '苍术',
                gongneng: '燥湿健脾，祛风湿，发汗，明目',
                bingzhen: `1.湿阻中焦证，痰饮，水肿。
          　　2.风寒湿痹，表证夹湿。
          　　3.湿盛脚气、痿证。
          　　4.夜盲，眼目昏涩。
          `
            },
            {
                name: '厚朴',
                gongneng: '燥湿，行气，消积，平喘',
                tedian: '为治湿阻、食积、气滞所致的脘腹胀满之要药'
            },
            {
                name: '广藿香',
                gongneng: '化湿，止呕，发表解暑。',
                tedian: '善治湿阻中焦、恶心呕吐，兼风寒袭表者尤佳。',
                peiwu: '广藿香配佩兰:凡湿浊中阻，无论兼寒兼热，也无论有无表证，均可投用'

            },
            {
                name: '佩兰',
                gongneng: '化湿，解暑',
                tedian: '为治湿热脾瘅口甜腻或口臭多涎之良药'
            },
            {
                name: '砂仁',
                gongneng: '化湿行气，温中止泻，安胎',
                bingzhen: `1.湿阻中焦证。
        　　2.脾胃气滞证。
        　　3.脾胃虚寒吐泻。
        　　4.妊娠恶阻，气滞胎动不安。
        `,
                zhuyi: '内服：煎汤，3～6g，打碎后下；或入丸散。'
            },
            {
                name: '白豆蔻',
                gongneng: '化湿行气，温中止呕。'
            },
            {
                name: '草豆蔻',
                gongneng: '燥湿行气，温中止呕。'
            },
            {
                name: '草果',
                gongneng: '燥湿温中，除痰截疟'
            },
        ]
    },
    {
        name: '利水渗湿药',
        list: [
            {
                name: '茯苓',
                gongneng: '利水渗湿，健脾，安神',
                tedian: '凡水湿、停饮，无论寒热或兼否脾虚皆宜',
                peiwu: '茯苓配白术:。两药相配，既利水渗湿力强，又健脾燥湿，善治脾虚水湿内盛者，兼治妊娠胎动不安或兼浮肿者。'
            },
            {
                name: '薏苡仁',
                gongneng: '利水渗湿，健脾止泻，除痹，清热排脓',
                tedian: '利水而不伤正、健脾而不滋腻。',
                bingzhen: `（1）小便不利、水肿、脚气肿痛。
        　　（2）脾虚泄泻。
        　　（3）湿温病邪在气分。
        　　（4）湿痹筋脉拘挛。
        　　（5）肺痈，肠痈。（此主治同桃仁）
        `
            },
            {
                name: '猪苓',
                gongneng: '利水渗湿'
            },
            {
                name: '泽泻',
                tedian: '既利水渗湿，又清泻肾（相）火与膀胱之热',
                gongneng: '利水渗湿，泄热',
                zhuyi: '肾虚精滑无湿热者禁服'
            },
            {
                name: '车前子',
                gongneng: '利水通淋，渗湿止泻，明目，清肺化痰',
                tedian: '既利水清热而通淋，又实大便而止泻。凡湿热、肝热、痰热均可选用。',
                bingzhen: `
        （1）湿热淋证，小便不利，水肿兼热。
    　　（2）暑湿水泻。
    　　（3）肝热目赤肿痛，肝肾亏虚之目暗不明。
    　　（4）肺热咳嗽痰多。
        `,
                zhuyi: '内服：煎汤，5～15g，布包；或入丸散;本品甘寒滑利'

            },
            {
                name: '滑石',
                xingwei: '甘、淡，寒;归膀胱、肺、胃经',
                gongneng: '利尿通淋，清解暑热；外用清热收湿敛疮。',
                bingzhen: `
        （1）湿热淋证，小便不利。
    　　（2）暑热烦渴，湿温胸闷，湿热泄泻。
    　　（3）湿疮，湿疹，痱子。
        `,
                peiwu: '滑石配生甘草（六一散）主治暑湿身热烦渴',
                zhuyi: '内服：煎汤，块状者宜打碎先下，细粉者宜布包；或入丸散。外用：适量，研细粉外敷。'
            },
            {
                name: '木通',
                gongneng: '利水通淋，泄热，通经下乳',
                bingzhen: `湿热淋痛，水肿尿少。
        　　2.心火上炎或下移小肠之口舌生疮、心烦尿赤。
        　　3.产后乳汁不通或乳少。
        　　4.湿热痹痛。
        `,
                jiqiao: '心经火邪用木通导赤；肺经火热用桑皮泻白'
            },
            {
                name: '通草',
                gongneng: '利水清热，通气下乳。',
            },
            {
                name: '冬葵子',
                gongneng: '利水通淋，下乳，润肠通便。',
            },
            {
                name: '茵陈',
                gongneng: '清热利湿，退黄。',
                bingzhen: '湿疮，湿疹瘙痒',
                tedian: '为治黄疸之要药，无论阳黄、阴黄皆宜'
            },
            {
                name: '萆薢',
                gongneng: '利湿浊，祛风湿',
                tedian: '为治膏淋、白浊及湿盛带下之要药。'
            },
            {
                name: '石韦',
                gongneng: '利尿通淋，凉血止血，清肺止咳',
                tedian: '血淋、尿血最宜',
                jiqiao: '十尾鸟飞两只。十尾对应石韦，鸟对应利尿，飞对应肺，两只对应凉血止血'
            },
            {
                name: '海金沙',
                tedian: '治淋证涩痛之要药，治血淋、石淋常用',
                gongneng: '利尿通淋，止痛',
                zhuyi: '内服：煎汤，5～15g，布包；或研末，每次2～3g'
            },
            {
                name: '瞿麦',
                xingwei: '苦，寒。归心、膀胱、小肠经。',
                gongneng: '利尿通淋，破血通经。',
                bingzhen: `1）热淋，血淋，石淋。
            　　（2）瘀血经闭。
            `
            },
            {
                name: '萹蓄',
                tedian: '利尿通淋，杀虫止痒。',
                zhuyi: '本品苦微寒而泄降清利，能缓通大便，故脾虚便溏者慎服'
            },
            {
                name: '地肤子',
                gongneng: '利尿通淋，祛风止痒。',
            },
            {
                name: '灯心草',
                gongneng: '利尿通淋，清心除烦。',
                bingzhen: `1）热淋。
            　　（2）心烦失眠，小儿夜啼，口舌生疮。
            `
            },
            {
                name: '金钱草',
                xingwei: '甘、咸，微寒。归肝、胆、肾、膀胱经。',
                gongneng: '利水通淋，除湿退黄，解毒消肿',
                bingzhen: `（1）热淋，石淋。
            　　（2）湿热黄疸，肝胆结石。
            　　（3）热毒疮肿，毒蛇咬伤。
            `,
                zhuyi: '本品微寒，故脾胃虚寒者慎服。外用鲜品熏洗，有引起接触性皮炎的报道。',
                jiqiao: '黄林独种金钱草。黄对应退黄，林对应淋，独种对应解毒消肿）'
            },
            {
                name: '广金钱草',
                xingwei: '甘、淡，凉。归肝、肾、膀胱经',
                gongneng: '清热除湿，利尿通淋，退黄'
            },
            {
                name: '连钱草',
                gongneng: '利湿通淋，清热解毒，散瘀消肿。',
                jiqiao: '连钱狱中死。连钱对应连钱草，狱中对应散瘀消肿，死对应清热解毒）',
                bingzhen: `（1）石淋，热淋。
            　　（2）湿热黄疸。
            　　（3）疮痈肿痛，跌打损伤。
            `
            },

        ]
    },
    {
        name: '温里药',
        list: [
            {
                name: '附子',
                tedian: '上助心阳、中温脾阳、下壮肾阳，为补火助阳、回阳救逆之要药',
                gongneng: '回阳救逆，补火助阳，散寒止痛。',
                jiqiao: '父子（附子）不（补火助阳）会（回阳救逆）散（散寒止痛）'
            },
            {
                name: '干姜',
                tedian: '为温中祛寒之要药，无论实寒、虚寒证皆宜。',
                gongneng: '温中，回阳，温肺化饮',
                bingzhen: `（1）脾胃受寒或虚寒所致腹痛、呕吐、泄泻。
            　　（2）亡阳欲脱。
            　　（3）寒饮咳喘。
            `
            },
            {
                name: '肉桂',
                tedian: '消沉寒痼冷而散寒止痛；温通经脉而活血散瘀。长于益阳消阴、缓补肾阳与引火归元，亦为补火助阳之要药；又入血分，善温通经脉，改善微循环，血瘀有寒者宜用。',
                gongneng: '补火助阳，引火归元，散寒止痛，温通经脉。',
                bingzhen: `（1）肾阳不足、命门火衰之阳痿、宫冷、畏寒肢冷。
        　　（2）下元虚冷、虚阳上浮之上热下寒证。
        　　（3）阳虚中寒之脘腹冷痛、食少便溏。
        　　（4）经寒血滞之痛经、闭经，寒疝腹痛，寒湿痹痛，腰痛。
        　　（5）阴疽，痈肿脓成不溃或久溃不敛。（鼓舞气血）
        `,
                zhuyi: '内服：煎汤，1～5g，后下；研末，每次1～2g；或入丸散。采自粗枝条或幼树干皮者称官桂，作用较弱，用量可适当增加。',

            },
            {
                name: '吴茱萸',
                tedian: '善疏肝降厥阴上逆之寒气、暖肝散寒、温阳燥湿、和肝胃而制酸、止痛、止呃；并兼杀虫。外用既燥湿杀虫而止痒，又引火、引血下行而降血压。善治肝寒气逆（滞）夹湿兼阳虚诸证。药力强，内服、外用皆宜。',
                gongneng: '散寒止痛，疏肝下气，燥湿止泻',
                bingzhen: `（1）中寒肝逆之头痛、吐涎沫。
            　　（2）寒湿脚气肿痛，或上冲入腹之腹胀、困闷欲死。
            　　（3）寒疝腹痛，经寒痛经。
            　　（4）呕吐吞酸。
            　　（5）虚寒腹痛泄泻。
            `
            },
            {
                name: '花椒',
                xingwei: '辛，热。有小毒。归脾、胃、肾经',
                gongneng: '温中止痛，杀虫止痒',
                bingzhen: `1.脘腹冷痛，中寒呕吐、泄泻。
            　　2.虫积腹痛，蛔虫、蛲虫所致者尤宜。
            　　3.湿疹，阴痒。
            `
            },
            {
                name: '丁香',
                gongneng: '温中降逆，温肾助阳。',
                bingzhen: `（1）中寒呃逆、呕吐、泄泻，脘腹冷痛。
            　　（2）肾阳虚之阳痿、宫冷。
            `
            },
            {
                name: '小茴香',
                gongneng: '散寒止痛，理气和胃',
            },
            {
                name: '高良姜',
                xingwei: '辛，热。归脾、胃经。',
                gongneng: '散寒止痛，温中止呕。',
                tedian: '为治中寒腹痛吐泻之要药。',
            },
            {
                name: '荜茇',
                gongneng: '温中散寒，行气止痛。',
                bingzhen: `（1）脘腹冷痛，中寒呕吐、泄泻。
            　　（2）胸痹冷痛，龋齿牙痛。
            `
            },
        ]
    },
    {
        name: '理气药',
        list: [
            {
                name: '陈皮',
                gongneng: '理气调中，燥湿化痰',
                bingzhen: `（1）脾胃气滞之脘腹胀满或疼痛、嗳气、恶心呕吐。
          　　（2）湿浊阻中之胸闷腹胀、纳呆便溏。
          　　（3）痰湿壅肺之咳嗽气喘。
          `
            },
            {
                name: '化橘红',
                gongneng: '行气宽中，燥湿化痰，消食。',
                bingzhen: `风寒咳嗽、喉痒痰多。
            　　（2）食积伤酒。
            `
            },
            {
                name: '橘红',
                gongneng: '行气宽中，燥湿化痰，发表散寒。',
            },
            {
                name: '枳实',
                tedian: '治胃肠积滞及痰滞胸痹之要药。',
                gongneng: '破气消积，化痰除痞。',
                jiqiao: '有了知识，身上的痞气都消化掉了',
                bingzhen: `1）食积便秘胀痛。
            　　（2）泻痢里急后重。
            　　（3）痰湿阻滞之胸脘痞满，痰滞胸痹证。
            　　（4）胃扩张，胃下垂，脱肛，子宫脱垂。
            `

            },
            {
                name: '青皮',
                gongneng: '疏肝破气，消积化滞',
                bingzhen: `1）肝气郁滞之胸胁、乳房胀痛或结块，乳痈，疝气痛。
            　　（2）食积脘腹胀痛。
            （3）癥瘕积聚，久疟癖块。
            `
            },
            {
                name: '木香',
                tedian: '为行气调中止痛之要药，胃肠气滞有寒兼食积、湿滞者用之最宜。',
                gongneng: '行气止痛，健脾消食',
                bingzhen: `1）脾胃气滞之脘腹胀痛。
            　　（2）下痢腹痛、里急后重。
            　　（3）脾运失常、肝失疏泄之胁肋胀痛、泄泻。
            　　（4）脾虚气滞之食少吐泻。
            `
            },
            {
                name: '香附',
                tedian: '为疏肝理气之佳品，被李时珍誉为“气病之总司，女科之主帅”。又为调经止痛之要药。',
                gongneng: '疏肝理气，调经止痛',
                bingzhen: `1）肝气郁滞之胸胁、脘腹胀痛，疝气痛。
            　　（2）肝郁之月经不调、痛经、乳房胀痛。
            　　（3）脾胃气滞，脘腹胀痛。
            `
            },
            {
                name: '沉香',
                gongneng: '行气止痛，温中止呕，温肾纳气',
                tedian: '集理气、降逆、纳气于一身，且温而不燥、行而不泄，无破气之害，故为理气良药。',
                bingzhen: `（1）寒凝气滞之胸腹胀闷作痛。
            　　（2）胃寒呕吐。
            　　（3）下元虚冷、肾不纳气之虚喘，痰饮咳喘属上盛下虚者。
            `
            },
            {
                name: '川楝子',
                xingwei: '苦，寒。有小毒。归肝、胃、小肠、膀胱经。',
                gongneng: '行气止痛，杀虫，疗癣',
                tedian: '治肝郁气滞或肝胃不和诸痛，兼热者最宜。'
            },
            {
                name: '乌药',
                gongneng: '行气止痛，温肾散寒',
                bingzhen: `寒郁气滞之胸闷胁痛、脘腹胀痛、疝痛及痛经。
            　　（2）肾阳不足、膀胱虚寒之小便频数、遗尿。
            `
            },
            {
                name: '薤白',
                tedian: '善散阴寒之凝结而温通胸阳，为治胸痹之要药；能行胃肠滞气而行气导滞',
                gongneng: '通阳散结，行气导滞。',
                jiqiao: '上通胸中之阳气，下行大肠之气滞'
            },
            {
                name: '荔枝核',
                gongneng: '行气散结，祛寒止痛',
                bingzhen: `（1）寒疝腹痛，睾丸肿痛。
            　　（2）痛经，产后腹痛。
            　　（3）肝胃不和之胃脘痛。
            `
            },
            {
                name: '甘松',
                gongneng: '行气止痛，开郁醒脾。',
                bingzhen: `（1）思虑伤脾或寒郁气滞引起的胸闷、脘腹胀痛、不思饮食。
            　　（2）湿脚气。
            `
            },
            {
                name: '枳壳',
                gongneng: '理气宽中，行滞消胀'
            },
            { name: '柿蒂', gongneng: '降气止呃' },
            { name: '青木香', gongneng: '行气止痛，解毒消肿' },
            {
                name: '佛手',
                gongneng: '疏肝理气，和中，化痰',
                jiqiao: '佛谈话和气',
            },
            {
                name: '香橼',
                gongneng: '疏肝理气，和中化痰',

            },
            {
                name: '梅花',
                gongneng: '疏肝解郁，和中，化痰'
            },
            {
                name: '玫瑰花', gongneng: '行气解郁，活血止痛',
            },
        ]
    },
    {
        name: '消食药',
        list: [
            {
                name: '山楂',
                gongneng: '消食化积，活血散瘀',
                tedian: "善治油腻肉积。"
            },
            {
                name: '麦芽',
                gongneng: '消食和中，疏肝，回乳。',
                tedian: '本品甘益中，平不偏，芽生发，焦味健胃。治饮食积滞，尤宜米、面、薯、芋等食积者。 '
            },
            {
                name: '莱菔子',
                gongneng: '消食除胀，降气化痰。',
                tedian: '生升熟降',
                zhuyi: '内服：煎汤，5～12g，打碎入煎；或入丸散。消食宜炒用。'
            },
            {
                name: '鸡内金',
                gongneng: '运脾消食，固精止遗，化坚消石。',

            },
            {
                name: '神曲',
                gongneng: '食积不化，脘腹胀满，不思饮食及肠鸣泄泻',
                tedian: '外感表证兼食积者尤宜。丸剂中含金石、介类药时，常以本品糊丸，以赋形、助消化。',
                zhuyi: '本品性温，故胃阴虚、胃火盛者不宜用。',

            },
            {
                name: '稻芽',
                gongneng: '消食和中，健脾开胃',

            },
        ]
    },
    {
        name: '驱虫药',
        list: [
            {
                name: '使君子',
                gongneng: '杀虫消积',
                tedian: '既为治蛔虫病、蛲虫病之佳品，又为治小儿疳积之要药',
                zhuyi: '若与热茶同服，亦可引起呃逆，故服药时忌饮茶。'
            },
            {
                name: '苦楝皮',
                xingwei: '苦，寒。有毒。归脾、胃、肝经',
                gongneng: '杀虫，疗癣',
                tedian: '外用能除湿热、杀灭皮肤寄生虫及抑制致病真菌，治头癣、疥疮',
                zhuyi: '本品苦寒有毒，能伤胃损肝，'
            },
            {
                name: '槟榔',
                gongneng: '杀虫，消积，行气，利水，截疟',
                bingzhen: `（1）绦虫病，姜片虫病，蛔虫病，蛲虫病，钩虫病等。
            　　（2）食积气滞之腹胀、便秘，泻痢里急后重。
            　　（3）水肿，脚气浮肿。
            　　（4）疟疾。
            `,
                peiwu: '槟榔配常山:两药相配，寒热并施，相反相成，既有较强的祛痰截疟之功，又可减少常山涌吐之副作用，故善治疟疾久发不止。'
            },
            {
                name: '贯众',
                xingwei: '苦，微寒。有小毒。归肝、胃经',
                gongneng: '杀虫，清热解毒，止血',
                jiqiao: '观众杀死两只虫',
                bingzhen: `（1）钩虫病，绦虫病，蛲虫病。
            　　（2）风热感冒，温毒斑疹，痄腮。
            　　（3）预防麻疹、流感、流脑。
            　　（4）血热之衄血、吐血、便血、崩漏
            `
            },
            {
                name: '雷丸',
                xingwei: '苦，寒。有小毒。归胃、大肠经。',
                gongneng: '杀虫，消积',
                bingzhen: `（1）绦虫病，钩虫病，蛔虫病。
            　　（2）小儿疳积。
            `,
                zhuyi: '不宜入煎剂，一般研粉或入丸剂。本品苦寒，脾胃虚寒者慎服。其杀虫成分为蛋白酶，受热（60℃左右）或酸作用下易被破坏失效，而在碱性环境中使用则作用最强，故入煎剂无驱绦虫的作用。'
            },
            {
                name: '南瓜子',
                xingwei: '甘，平。归胃、大肠经',
                gongneng: '绦虫病，蛔虫病，钩虫病，血吸虫病',
                zhuyi: '内服：生用连壳或去壳后研细粉，60～120g，冷开水调服；也可去壳取仁嚼服。外用：适量，煎水熏洗。治血吸虫病，须生用大量久服'
            },
            {
                name: '鹤草芽',
                xingwei: '苦、涩，凉。归肝、小肠、大肠经。',
                gongneng: '杀虫-绦虫病',
                zhuyi: '内服：研粉吞服，成人每次30～50g。小儿按体重0.7～0.8g/kg，每日1次，早晨空腹服。'
            },
            {
                name: '榧子',
                xingwei: '甘，平。归肺、胃、大肠经。',
                gongneng: '杀虫，消积，润肠通便，润肺止咳。',
            },
        ]
    },
    {
        name: '止血药',
        list: [
            {
                name: '大蓟',
                gongneng: '凉血止血，散瘀消痈。',
                peiwu: '大蓟配小蓟：均性凉而凉血止血、散瘀解毒消痈，同用则药力更强，治血热出血诸证及热毒疮肿。'
            },
            {
                name: '小蓟',
                gongneng: '凉血止血，散瘀消痈。',
                tedian: '善治血热出血、热毒疮肿，尿血、血淋尤佳',
                jiqiao: '大蓟、小蓟的功效一致，均是凉血止血，散瘀消痈。技巧：大小两只鸡用鱼。大小两只鸡对应大蓟小蓟凉血止血，用鱼对应散瘀消痈。'
            },
            {
                name: '地榆',
                tedian: '善治下焦血热妄行诸证，为治痔疮、便血及崩漏之佳品',
                gongneng: '凉血止血，解毒敛疮。',
                zhuyi: '本品微寒苦涩，故虚寒及出血有瘀者慎服。对于大面积烧伤，不宜使用地榆制剂外涂，以防其所含水解型鞣质被机体大量吸收而引起中毒性肝炎。'
            },
            {
                name: '槐花',
                gongneng: '凉血止血，清肝泻火',
                jiqiao: '槐花，请干些活。请干些活对应清肝泻火'
            },
            {
                name: '白茅根',
                tedian: '血热出血皆宜，兼津伤及呕、咳、渴、淋者尤佳。',
                gongneng: '凉血止血，清热生津，利尿通淋。',
                jiqiao: '对比芦根区别记忆',
                bingzhen: `（1）血热之衄血、咳血、吐血、尿血。
        　　（2）热病烦渴，胃热呕哕，肺热咳嗽。
        　　（3）血淋，热淋，小便不利，水肿，湿热黄疸。
        `
            },
            {
                name: '苎麻根',
                gongneng: '凉血止血，清热安胎，利尿，解毒',
                jiqiao: '：猪妈生4胎死2只，因为尿血。猪妈对应苎麻根，4、死均对应清热解毒，胎指安胎，2只对应凉血止血，尿指利尿'
            },
            {
                name: '侧柏叶',
                gongneng: '凉血止血，祛痰止咳，生发乌发',
                bingzhen: `各种出血证。
            　　（2）肺热咳喘痰多。
            　　（3）血热脱发，须发早白。
            　　（4）烫伤（外用）
            `,
                tedian: '为治内、外伤出血之要药，血热者宜生用，虚寒者须炒炭用',
                zhuyi: '内服：煎汤，6～12g；或入丸散。外用：适量，煎汤熏洗，或研末调敷。止血多炒炭用，化痰止咳宜生用。'
            },
            {
                name: '白及',
                gongneng: '收敛止血，消肿生肌',
                bingzhen: `（1）咳血，衄血，吐血，外伤出血。
        　　（2）疮痈肿毒，烫伤，手足皲裂，肛裂。
        　　（3）肺痈而咳吐腥痰脓血日渐减少者。
        `,
                jiqiao: '白及像小鸡手指。小鸡对应消肿生肌，手指对应收敛止血',
                peiwu: '白及配三七:止血力增强而不留瘀，可治各种出血，内服外用皆宜;白及配海螵蛸:治胃、十二指肠溃疡之吐血、便血效佳。'
            },
            {
                name: '仙鹤草/脱力草',
                gongneng: '收敛止血，止痢，截疟，解毒，杀虫，补虚',
                bingzhen: `（1）咳血，衄血，吐血，尿血，便血，崩漏。
    　　（2）久泻，久痢。
    　　（3）疟疾，痈肿疮毒。
    　　（4）滴虫性阴道炎所致的阴痒带下。
    　　（5）脱力劳伤。
    `,
                jiqiao: '对比鸦胆子'
            },
            {
                name: '三七',
                tedian: '有止血而不留瘀、活血而不耗气之优，凡出血及瘀肿即可投之，偏寒兼虚者最宜',
                gongneng: '化瘀止血，活血定痛',

            },
            {
                name: '景天三七',
                gongneng: '化瘀止血，宁心安神，解毒。'
            },
            {
                name: '茜草',
                tedian: '止血而不留瘀、活血而不动血之长，尤以血热血瘀兼出血者用之最佳',
                gongneng: '凉血，祛瘀，止血，通经',
                jiqiao: '两只鲸鱼欠炒。两只对应凉血止血，鲸对应通经，鱼对应祛瘀，欠炒对应茜草）',
                bingzhen: `吐血，衄血，崩漏，尿血，便血等。
        　　（2）闭经，痛经，跌打肿痛，痹证关节痛。
        `
            },
            {
                name: '蒲黄',
                tedian: '为化瘀止血之要药，尤善治崩漏及尿血。治出血及瘀血诸痛，无论寒热均可',
                gongneng: '活血祛瘀，收敛止血，利尿通淋',
                bingzhen: `（1）吐血，咳血，衄血，尿血，便血，崩漏，外伤出血。
            　　（2）血瘀之心腹疼痛、痛经，产后瘀阻腹痛。
            　　（3）血淋涩痛。
            `,
                peiwu: '蒲黄配五灵脂：两药相配，无论生用、炒用均能活血止痛、化瘀止血，善治血瘀胸胁心腹诸痛及血瘀出血。',
                zhuyi: '生蒲黄有收缩子宫的作用，故孕妇慎服。'
            },
            {
                name: '血余炭',
                gongneng: '收敛化瘀止血，利尿。',

            },
            {
                name: '艾叶',
                gongneng: '温经止血，散寒止痛',
                tedian: '作用偏于中下二焦，既为治妇科崩漏与带下之要药，又为灸科温灸之主药',
                peiwu: '艾叶配阿胶,崩漏下血属血虚有寒;艾叶配香附（艾附暖宫丸）'
            },
            {
                name: '炮姜',
                gongneng: '温经止血，温中止痛。',
            },
            {
                name: '紫珠叶',
                gongneng: '收敛凉血止血，散瘀解毒消肿',

            },
            {
                name: '鸡冠花',
                gongneng: '收敛止血，凉血，止带，止痢',

            },
            {
                name: '棕榈炭',
                gongneng: '收敛止血',

            },
            {
                name: '藕节',
                gongneng: '收敛止血',

            },
        ]
    },
    {
        name: '活血祛瘀药',
        list: [
            {
                name: '川芎',
                gongneng: '活血行气，祛风止痛',
                tedian: '上行头颠，下走血海，内行血气，外散风寒。“血中之气药”。“头痛不离川芎”',

            },
            {
                name: '延胡索',
                gongneng: '活血，行气，止痛',
                tedian: "疼痛属血瘀气滞者皆可投用，以兼寒者为佳。"
            },
            {
                name: '郁金',
                xingwei: '辛、苦，寒。归心、肝、胆、肺经。',
                gongneng: '活血止痛，行气解郁，凉血清心，利胆退黄',
                jiqiao: '联系郁金有黄色、红色',
                bingzhen: `（1）胸腹胁肋胀痛或刺痛，月经不调，痛经，癥瘕痞块。
            　　（2）热病神昏，癫痫发狂。
            　　（3）血热之吐血、衄血、尿血，妇女倒经。
            　　（4）湿热黄疸，肝胆或泌尿系结石症。
            `,
                peiwu: '郁金配石菖蒲:两药相配，既化湿豁痰，又清心开窍，治痰火或湿热蒙蔽清窍之神昏、癫狂、癫痫。;郁金配白矾:两药相配，具有较强的祛除心经热痰之力，治痰热蒙蔽心窍之癫痫发狂及痰厥等'

            },
            {
                name: '莪术',
                xingwei: '辛、苦，温',
                gongneng: '破血行气，消积止痛',
                peiwu: '莪术配三棱:凡血瘀及食积重症均可投用'
            },
            {
                name: '三棱',
                xingwei: '苦、辛，平。归肝、脾经',
                gongneng: '破血行气，消积止痛',
            },
            {
                name: '姜黄',
                gongneng: '破血行气，通经止痛',
                bingzhen: `（1）气滞血瘀所致的胸胁刺痛、闭经、痛经。
            　　（2）跌打瘀痛，风湿痹痛，11肩臂痛。
            　　（3）疮肿。
            `
            },
            {
                name: '丹参',
                xingwei: '苦，微寒。归心、肝经',
                gongneng: '活血祛瘀，通经止痛，清心除烦，凉血消痈。',
                tedian: '古云“一味丹参散（饮），功同四物汤”，实为凉血活血、祛瘀生新之品',
                jiqiao: '对比郁金'
            },
            {
                name: '虎杖',
                gongneng: '利湿退黄，清热解毒，活血祛瘀，化痰止咳，泻下通便',
                jiqiao: '对比大黄',
                bingzhen: `（1）湿热黄疸，淋浊，带下。
            　　（2）水火烫伤，疮痈肿毒，毒蛇咬伤。
            　　（3）闭经，痛经，癥瘕，跌打损伤，风湿痹痛。
            　　（4）肺热咳嗽。
            　　（5）热结便秘。
            　　（6）肝胆及泌尿系结石症。
            `
            },
            {
                name: '益母草',
                tedian: '为妇科调经良药。治水瘀互阻之水肿及热毒瘀结之疮疹。',
                gongneng: '活血祛瘀，利尿消肿，清热解毒',
                jiqiao: '一亩草死，浇点水。一亩草对应益母草，死对应清热解毒，水指利水，与利尿一致）',

            },
            {
                name: '桃仁',
                tedian: '活血力强，凡血瘀不论寒热新久皆宜',
                gongneng: '活血祛瘀，润肠通便，止咳平喘',
                jiqiao: '对比苦杏仁',
                bingzhen: `（1）血滞闭经、痛经，产后腹痛，癥瘕，跌打肿痛。
            　　（2）肺痈，肠痈。（此主治同薏苡仁）
            　　（3）肠燥便秘。
            　　（4）咳喘。
            `
            },
            {
                name: '红花',
                tedian: '治瘀血诸证皆可选用，兼寒者最宜',
                gongneng: '活血通经，祛瘀止痛',
                zhuyi: '小剂量活血通经，大剂量破血催产',
                peiwu: '红花配桃仁:两药相配，相得益彰，活血祛瘀力增强，凡瘀血证即可投用。'
            },
            {
                name: '乳香',
                gongneng: '活血止痛，消肿生肌',
                tedian: '为外伤科要药，血瘀与疮肿皆宜。内服因行散而易耗伤正气，外用因生肌而不利于排脓，故治疮肿时：未溃可服，溃后勿服；无脓可敷，脓多勿敷。',
                bingzhen: `（1）痛经，闭经，产后瘀阻腹痛，胸胁脘腹刺痛，跌打伤痛。
            　　（2）11风湿痹痛、拘挛麻木11。
            　　（3）肠痈，疮疡肿痛或溃久不收口。
            `
            },
            {
                name: '没药',
                gongneng: '活血止痛，消肿生肌',
                jiqiao: "乳香、没药均能活血止痛，消肿生肌。技巧：乳没总饥，总饥对应消肿生肌。"

            },
            {
                name: '牛膝',
                gongneng: "活血通经，利尿通淋，引血下行，补肝肾，强筋骨。",
                jiqiao: "水（利尿通淋）牛（牛膝）干（补肝肾）劲（强筋骨）足（引血下行）",
                tedian: '治腰膝酸软、筋骨无力之要药。还引药下行，用药欲其下行者，常用本品作引经药。',
                zhuyi: '内服：煎汤，5～12g；或入丸散。补肝肾、强筋骨当酒制用，余皆宜生用。本品善下行逐瘀，故孕妇、月经过多及梦遗滑精者慎服。'
            },
            {
                name: '川牛膝',
                gongneng: '逐瘀通经，通利关节，利尿通淋，引血下行。',
            },
            {
                name: '水蛭',
                xingwei: '咸、苦，平。有小毒。归肝经。',
                gongneng: '破血逐瘀，通经'
            },
            {
                name: '土鳖虫',
                gongneng: '破血逐瘀，续筋接骨。'
            },
            {
                name: '自然铜',
                gongneng: '散瘀止痛，接骨疗伤',
                zhuyi: '内服：煎汤，3～9g，打碎先煎；或醋淬研细末入散剂，每次0.3g。外用：适量，研末调敷。'
            },
            {
                name: '西红花',
                gongneng: '活血祛瘀，凉血解毒，解郁安神。',

            },
            {
                name: '鸡血藤',
                gongneng: '活血补血，调经止痛，舒筋活络',
                bingzhen: `1）月经不调，痛经，闭经，跌打损伤。
            　　（2）血虚萎黄。
            　　（3）11手足麻木，肢体瘫痪，风湿痹痛。
            `
            },
            {
                name: '穿山甲',
                gongneng: '活血消癥，通经下乳，消肿排脓',
                bingzhen: `（1）瘀血闭经，癥瘕痞块，跌打肿痛。
        　　（2）痹痛拘挛，中风瘫痪，麻木拘挛。
        　　（3）乳汁不下。
        　　（4）痈肿疮毒，瘰疬痰核。
        `
            },
            {
                name: '王不留行',
                gongneng: '活血通经，下乳消肿，利尿通淋。',

            },
            {
                name: '五灵脂',
                gongneng: '活血止痛，化瘀止血，解蛇虫毒',


            },
            {
                name: '血竭',
                gongneng: '活血定痛，化瘀止血，生肌敛疮。',

            },
            {
                name: '刘寄奴',
                gongneng: '破血通经，散寒止痛，消食化积',
                bingzhen: `（1）闭经，产后腹痛，癥瘕。
            　　（2）跌打损伤，创伤出血。
            　　（3）食积腹痛，11赤白痢疾。
            `
            },
            {
                name: '北刘寄奴',
                gongneng: '活血祛瘀，通经止痛，凉血止血，清热利湿。',

            },
            {
                name: '月季花',
                gongneng: '活血调经，疏肝解郁。',

            },
            {
                name: '苏木',
                gongneng: '活血祛瘀，消肿止痛',

            },
            {
                name: '干漆',
                gongneng: '破血祛瘀，杀虫。',
                zhuyi: '内服：煎汤，2～5g；入丸散，每次0.06～0.1g。宜烧枯或炒至焦枯黑烟尽，以减其毒性。'
            },
        ]
    },
    {
        name: '化痰止咳平喘药',
        children: [
            {
                name: '化痰药',
                list: [
                    {
                        name: '半夏',
                        tedian: '善祛脾胃湿痰，为治湿痰、寒痰、呕吐之要药',
                        gongneng: '燥湿化痰，降逆止呕，消痞散结。',
                        zhuyi: '内服用制半夏，不同炮制品功效有别。法半夏长于燥湿，姜半夏长于降逆止呕；清半夏长于化痰；竹沥半夏长于清热化痰。生半夏外用。'
                    },
                    {
                        name: '天南星',
                        gongneng: '燥湿化痰，祛风止痉，散结消肿。',
                        tedian: '善祛经络风痰。',
                        bingzhen: `1）顽痰咳嗽。
                    　　（2）风痰眩晕，中风口眼 斜，癫痫，破伤风。
                    　　（3）痈疽肿痛，瘰疬痰核。
                    `
                    },
                    {
                        name: '白附子',
                        gongneng: '燥湿化痰，祛风止痉，解毒散结',
                        bingzhen: `1）中风痰壅，口眼 斜，破伤风，惊风癫痫，偏正头痛。
                　　（2）毒蛇咬伤，瘰疬痰核。
                `,
                        zhuyi: '内服：煎汤，3～6g；或入丸散。外用：适量。内服宜制用，生品毒性大，一般作外用。'

                    },
                    {
                        name: '介子',
                        gongneng: '温肺祛痰，利气散结，通络止痛。',
                        tedian: '善治寒痰及痰饮诸证，尤以痰在皮里膜外及经络者最宜。',
                        bingzhen: `（1）寒痰咳喘，悬饮胁痛。
              　　（2）痰阻经络之肢体关节疼痛，阴疽流注
              `
                    },
                    {
                        name: '桔梗',
                        gongneng: '宣肺，利咽，祛痰，排脓',
                        bingzhen: `1）咳嗽痰多、咯痰不爽，咽痛音哑。
              　　（2）肺痈胸痛、咳吐脓血、痰黄腥臭
              `
                    },
                    {
                        name: '旋覆花',
                        tedian: "为治肺胃气逆之要药",
                        gongneng: '消痰行水，降气止呕',
                        bingzhen: `痰涎壅肺之喘咳痰多，痰饮蓄结之胸膈痞闷。
                　　（2）噫气，呕吐。
                `,
                        zhuyi: '内服：煎汤，3～9g，布包；或入丸散'
                    },
                    {
                        name: '瓜蒌',
                        gongneng: '清肺润燥化痰，利气宽胸，消肿散结，润肠通便。',
                        bingzhen: `1）11肺热咳嗽、痰稠不易咳出。
                　　（2）11胸痹，结胸。
                　　（3）乳痈肿痛，肺痈，肠痈。
                　　（4）肠燥便秘。
                `
                    },
                    {
                        name: '川贝母',
                        gongneng: '清热化痰，润肺止咳，散结消痈',
                        bingzhen: `1）肺热咳喘，外感咳嗽。
              　　（2）肺燥咳嗽，肺虚久咳，11阴虚劳嗽。
              　　（3）痰热或火郁胸闷，瘰疬，疮肿，乳痈，肺痈。
              `
                    },
                    {
                        name: '浙贝母',
                        gongneng: '清热化痰，散结消肿'
                    },
                    {
                        name: '竹茹',
                        tedian: '为治痰热咳嗽及胆火挟痰之良药。',
                        gongneng: '清热化痰，除烦止呕，安胎。'
                    },
                    {
                        name: '竹沥',
                        gongneng: '清热滑痰',
                        tedian: '既为治痰热咳喘、痰稠胶结难出之要药，又为治痰热蒙蔽清窍之佳品。',
                        bingzhen: `1）肺热之痰壅咳喘。
                　　（2）11中风痰迷，惊痫癫狂。
                `
                    },
                    {
                        name: '天竺黄',
                        gongneng: '清热化痰，清心定惊。',

                    },
                    {
                        name: '前胡',
                        gongneng: '降气祛痰，宣散风热。',

                    },
                    {
                        name: '白前',
                        xingwei: '苦、辛，微温。归肺经',
                        tedian: '肺家之要药，凡咳喘无论寒热皆可，属寒者最宜。',
                        gongneng: '降气祛痰止咳。',

                    },
                    {
                        name: '昆布',
                        gongneng: '消痰软坚，利水消肿。'
                    },
                    {
                        name: '海藻',
                        gongneng: '消痰软坚，利水消肿。'
                    },
                    {
                        name: '黄药子',
                        tedian: '治瘿瘤之要药。',
                        gongneng: '化痰软坚散结，清热解毒，凉血止血。',
                        zhuyi: '本品苦寒有毒，多服、久服可致吐泻腹痛，故不宜过量服用或久服，脾胃虚寒者慎服。对肝脏具有一定损害性，故肝病患者忌服，长期用药者应定期检查肝功能。'
                    },
                    {
                        name: '瓦楞子',
                        gongneng: '消痰化瘀，软坚散结，11制酸止痛。',
                    },
                    {
                        name: '海蛤壳',
                        gongneng: '清热化痰，软坚散结，利尿消肿，制酸止痛',
                    },
                    {
                        name: '海浮石',
                        gongneng: '清热化痰，软坚散结，通淋',
                    },
                    {
                        name: '礞石',
                        gongneng: '消痰下气，平肝镇惊',
                        zhuyi: '内服：煎汤，10～15g，打碎布包，先下；入丸散，1.5～3g。内服：煎汤，10～15g，打碎布包，先下；入丸散，1.5～3g。'
                    }
                ]
            },
            {
                name: '止咳平喘药',
                list: [
                    {
                        name: '苦杏仁',
                        gongneng: '降气止咳平喘，润肠通便'
                    },
                    {
                        name: '紫苏子',
                        gongneng: '降气化痰，止咳平喘，润肠通便。'
                    },
                    {
                        name: '桑白皮',
                        gongneng: '泻肺平喘，利水消肿',
                        bingzhen: '肺热之咳喘痰多。 （偏于泻肺热）浮肿尿少，小便不利。',
                        zhuyi: '泻肺平喘宜蜜炙用，利水消肿宜生用。'
                    },
                    {
                        name: '葶苈子',
                        gongneng: '泻肺平喘，利水消肿',
                        bingzhen: '痰壅肺实之咳喘。 （偏于泻肺水）浮肿尿少，小便不利',
                        zhuyi: '煎汤布包。'
                    },
                    {
                        name: '百部',
                        xingwei: '甘、苦，平。归肺经',
                        gongneng: '润肺止咳，杀虫灭虱。',
                        bingzhen: `1）新久咳嗽，百日咳，肺痨咳嗽。
                　　（2）蛲虫病，头虱，体虱。
                `,
                        zhuyi: '久咳虚喘宜蜜炙用，杀虫灭虱宜生用',
                    },
                    {
                        name: '紫苑',
                        tedian: '凡咳嗽无论外感、内伤皆可选用',
                        gongneng: '润肺下气，化痰止咳',
                        zhuyi: '外感暴咳宜生用，肺虚久咳宜蜜炙用。'
                    },
                    {
                        name: '款冬花',
                        tedian: '凡咳嗽无论外感、内伤皆可酌投，寒嗽最宜。',
                        gongneng: '润肺下气，止咳化痰。',

                    },
                    {
                        name: '枇杷叶',
                        xingwei: '苦，微寒。归肺、胃经',
                        gongneng: '清肺止咳，降逆止呕',
                        zhuyi: '止咳宜蜜炙用，止呕宜生用。'
                    },
                    {
                        name: '马兜铃',
                        gongneng: '清肺化痰，止咳平喘，清肠疗痔。',
                        bingzhen: `（1）肺热咳嗽。
                　　（2）肺虚有热之咳喘或痰中带血。
                　　（3）痔疮肿痛、出血。
                `
                    },
                    {
                        name: '白果',
                        gongneng: '敛肺平喘，止带缩尿',
                        jiqiao: '鸟带白果飞',
                        bingzhen: `1）咳喘气逆痰多。
                　　（2）白浊，带下，尿频、遗尿。
                `,
                        peiwu: '白果配麻黄:两药相配，收散并用，既可防麻黄辛散耗气，又可增降气平喘之力，可治咳喘之证。'
                    },
                    {
                        name: '胖大海',
                        gongneng: '清宣肺气，清肠通便',
                        bingzhen: `1）肺热声哑，痰热咳嗽。
                　　（2）燥热便秘，肠热便血。
                `
                    },
                    {
                        name: '洋金花',
                        gongneng: '平喘止咳，解痉，定痛',
                        bingzhen: `1）咳嗽哮喘。
                　　（2）小儿慢惊。
                　　（3）脘腹冷痛，风湿痹痛。
                　　（4）外科麻醉。
                `,

                    }
                ]
            },
        ]
    },
    {
        name: '安神药',
        children: [
            {
                name: '重镇安神药',
                list: [
                    {
                        name: '朱砂',
                        tedian: '为治心火亢盛诸证之要药，无论虚实皆宜',
                        gongneng: '镇心安神，清热解毒',
                        zhuyi: '研末冲，或入丸散，0.1～0.5g；不入煎剂。外用：适量，干掺，或调敷，或喷喉。火煅能析出水银而有大毒，故忌火煅。'
                    },
                    {
                        name: '磁石',
                        gongneng: '镇惊安神，平肝潜阳，聪耳明目，纳气平喘。',
                        zhuyi: '内服：煎汤，9～30g，打碎先下；入丸散，每次1～3g。潜阳安神宜生用，聪耳明目、纳气定喘宜醋淬后用。'
                    },
                    {
                        name: '龙骨',
                        gongneng: '生用：镇惊安神，平肝潜阳；煅用：收敛固涩，收湿敛疮。'
                    },
                    {
                        name: '琥珀',
                        gongneng: '安神定惊，活血散瘀，利尿通淋',
                        jiqiao: '琥珀可看到“鱼鳞”',
                        zhuyi: '不入煎剂，内服：研末冲，或入丸散，1.5～3g'
                    },
                    {
                        name: '珍珠',
                        gongneng: '安神定惊，明目除翳，解毒敛疮（同地榆），润肤祛斑。',
                        zhuyi: '研末冲，或入丸散，110.1～0.3g。外用：适量，研磨掺，或水飞点眼、吹喉。'
                    },
                ]
            },
            {
                name: '养心安神药',
                list: [
                    {
                        name: '酸枣仁',
                        xingwei: '甘、酸，平。归心、肝、胆经。',
                        gongneng: '养心安神，敛汗'
                    },
                    {
                        name: '柏子仁',
                        gongneng: '养心安神，润肠通便，止汗',

                    },
                    {
                        name: '远志',
                        gongneng: '安神益智，祛痰开窍，消散痈肿',
                        bingzhen: `（1）心神不安，惊悸，失眠，健忘。
                　　（2）痰阻心窍之癫痫发狂、11神志恍惚。
                　　（3）咳嗽痰多。
                　　（4）痈疽肿痛，乳痈肿痛。
                `,
                        zhuyi: '对胃有刺激性，故消化道溃疡及胃炎患者慎服。'
                    },
                    {
                        name: '合欢皮',
                        gongneng: '解郁安神，活血消肿',

                    },
                    {
                        name: '夜交藤',
                        gongneng: '养心安神，祛风通络',
                    },
                ]
            },
        ]
    },
    {
        name: '平肝息风药',
        children: [
            {
                name: '平抑肝阳药',
                list: [
                    {
                        name: '石决明',
                        gongneng: '平肝潜阳，清肝明目',
                        zhuyi: '内服，打碎先下。平肝清肝宜生用，点眼应煅后水飞用。'
                    },
                    {
                        name: '牡蛎',
                        gongneng: '平肝潜阳，镇惊安神，软坚散结，收敛固涩，制酸止痛',
                        bingzhen: `1）11阴虚阳亢之头晕目眩，阴虚动风。
              　　（2）烦躁不安，心悸失眠。
              　　（3）瘰疬痰核，癥瘕积聚。
              　　（4）自汗，盗汗，遗精，带下，崩漏。
              　　（5）胃痛泛酸。
              `
                    },
                    {
                        name: '赭石',
                        gongneng: '平肝潜阳，重镇降逆，凉血止血',
                        zhuyi: '本品苦寒重坠，故寒证及孕妇慎服。又含微量砷，故不宜长期久服。',
                    },
                    {
                        name: '蒺藜',
                        gongneng: '平肝，疏肝，祛风明目，散风止痒',
                        bingzhen: `（1）肝阳上亢之头晕目眩。
              　　（2）肝气郁结之胸胁不舒、乳闭不通。
              　　（3）风热之目赤翳障。
              　　（4）风疹瘙痒。
              `
                    },
                    {
                        name: '珍珠母',
                        gongneng: '平肝潜阳，清肝明目，安神定惊，收湿敛疮。',
                    },
                    {
                        name: '罗布麻叶',
                        gongneng: '平肝清热，降血压，利水'
                    },
                ]
            },
            {
                name: '息风止痉药',
                list: [
                    {
                        name: '羚羊角',
                        gongneng: '平肝息风，清肝明目，凉血解毒',
                        jiqiao: '清明羚羊死',
                        zhuyi: '煎汤，1～3g，宜另煎2小时以上，与煎好的药液配对；磨汁或锉末，每次0.3～0.6g；也可入丸散。'
                    },
                    {
                        name: '钩藤',
                        tedian: '善平肝阳、息肝风、清肝热，兼散肝经之热。',
                        gongneng: '息风止痉，清热平肝',
                        zhuyi: '内服，后下'
                    },
                    {
                        name: '天麻',
                        gongneng: '息风止痉，平抑肝阳，祛风通络。',
                        tedian: '治肝阳、肝风诸证，无论寒热虚实皆宜',
                        bingzhen: `（1）肝阳上亢之头痛眩晕。
                　　（2）虚风内动，急、慢惊风，癫痫抽搐，破伤风。
                　　（3）风湿痹痛，肢体麻木，手足不遂。
                `
                    },
                    {
                        name: '全蝎',
                        gongneng: '息风止痉，攻毒散结，通络止痛',
                        bingzhen: `（1）急、慢惊风，癫痫抽搐，破伤风。
                　　（2）中风面瘫，半身不遂。
                　　（3）疮疡肿毒，瘰疬痰核。
                　　（4）偏正头痛，风湿顽痹。
                `,
                        zhuyi: '内服：煎汤，3～6g。研末，每次0.6～1g；也可入丸散。'
                    },
                    {
                        name: '蜈蚣',
                        gongneng: '息风止痉，攻毒散结，通络止痛',
                        zhuyi: '内服：煎汤，3～5g。研末，每次0.6～1g；也可入丸散'
                    },
                    {
                        name: '地龙',
                        gongneng: '清热息风，平喘，通络，利尿。'
                    },
                    {
                        name: '僵蚕',
                        gongneng: '息风止痉，祛风止痛，化痰散结。'
                    },
                ]
            },
        ]
    },
    {
        name: '开窍药',
        list: [
            {
                name: '麝香',
                gongneng: '开窍醒神，活血通经，消肿止痛。',
                tedian: '既为开窍醒神之良药，治闭证神昏无论寒热皆宜；又为活血通经、止痛之佳品，治瘀血诸证无论新久皆可。',
                bingzhen: `热病神昏，中风痰厥，气郁暴厥，中恶神昏。
            　　（2）闭经，癥瘕，难产死胎。
            　　（3）胸痹心痛，心腹暴痛，痹痛麻木，跌打损伤。
            　　（4）疮肿，瘰疬，咽喉肿痛。
            `,
                zhuyi: '入丸散，0.03～0.1g，不入煎剂。外用：适量，调敷或敷贴'
            },
            {
                name: '冰片',
                gongneng: '开窍醒神，清热止痛',
                zhuyi: '内服：入丸散，0.15～0.3g，不入煎剂。外用：适量，研末干掺或调敷。'
            },
            {
                name: '石菖蒲',
                gongneng: '开窍宁神，化湿和胃',
                bingzhen: `1）痰湿蒙蔽心窍之神昏，癫痫，耳聋，耳鸣。
            　　（2）心气不足之心悸失眠、健忘恍惚。
            　　（3）湿浊中阻之脘腹痞胀，噤口痢。
            `
            },
            {
                name: '苏合香',
                gongneng: '开窍辟秽，止痛',
                zhuyi: '内服：入丸散，0.3～1g，不入煎剂'

            },
            {
                name: '安息香',
                gongneng: '开窍辟秽，行气活血，止痛',
                bingzhen: '入丸散，0.6～1.5g，不入煎剂'
            },

        ]
    },
    {
        name: '补虚药',
        children: [
            {
                name: '补气药',
                list: [
                    {
                        name: '人参',
                        tedian: '为补气强身之要药',
                        gongneng: '大补元气，补脾益肺，生津止渴，安神益智'
                    },
                    {
                        name: '党参',
                        gongneng: '补中益气，生津养血',
                    },
                    {
                        name: '西洋参',
                        gongneng: '补气养阴，清热生津',
                        bingzhen: `（1）阴虚火旺之咳嗽痰血。
                　　（2）热病气阴两伤之烦倦。
                　　（3）津液不足之口干舌燥，内热消渴。
                `},
                    {
                        name: '太子参',
                        gongneng: '补气生津',
                    },
                    {
                        name: '黄芪',
                        tedian: '通过补气能生血、摄血、生津、行滞。',
                        gongneng: '补气升阳，益卫固表，托毒生肌，利水消肿',
                        bingzhen: `（1）脾胃气虚，脾肺气虚，中气下陷，气不摄血，气虚发热。
                　　（2）自汗，盗汗。
                　　（3）气血不足所致疮痈不溃或溃久不敛。
                　　（4）气虚水肿、小便不利。
                　　（5）气血双亏，血虚萎黄，血痹肢麻，半身不遂，消渴。
                `,

                    },
                    {
                        name: '白术',
                        gongneng: '补气健脾，燥湿利水，止汗，安胎',
                        zhuyi: '补气健脾宜炒用，健脾止泻宜炒焦用，燥湿利水宜生用。'
                    },
                    {
                        name: '山药',
                        tedian: '平补气阴，治气虚或气阴两虚之佳品。',
                        gongneng: '益气养阴，补脾肺肾，固精止带',

                    },
                    {
                        name: '刺五加',
                        xingwei: '甘、辛、微苦，温。归脾、肾、心经。',
                        gongneng: '补气健脾，益肾强腰，养心安神，活血通络。',
                        bingzhen: `（1）11脾虚乏力，食欲不振，气虚浮肿。
                　　（2）肾虚腰膝酸软，11小儿行迟。
                　　（3）11心悸气短，失眠多梦，健忘。
                　　（4）11胸痹心痛，痹痛日久，跌打肿痛。
                `},
                    {
                        name: '甘草',
                        gongneng: '益气补中，祛痰止咳，解毒，缓急止痛，缓和药性',
                        bingzhen: `1）心气虚之心动悸、脉结代。
                　　（2）脾虚乏力、食少便溏。
                　　（3）咳嗽气喘。
                　　（4）疮痈肿毒，食物或药物中毒。
                　　（5）脘腹或四肢挛急疼痛。
                　　（6）调和诸药。
                `,
                        xingwei: '甘，平。归脾、胃、肺、心经',
                        zhuyi: '本品味甘，易助湿壅气，湿盛中满者不宜服。大剂量服用甘草，易引起浮肿，故不宜大量久服。'
                    },
                    {
                        name: '白扁豆',
                        gongneng: '健脾化湿，消暑解毒'
                    },
                    {
                        name: '大枣',
                        tedian: '为气血双补之品。',
                        gongneng: '补中益气，养血安神，缓和药性'
                    },
                    {
                        name: '红景天',
                        gongneng: '益气，平喘，活血通脉'
                    },
                    {
                        name: '绞股蓝',
                        gongneng: "健脾益气，祛痰止咳，清热解毒"
                    },
                    {
                        name: '蜂蜜',
                        gongneng: '补中缓急，润肺止咳，滑肠通便，解毒。',
                        bingzhen: `（1）脾胃虚弱之食少倦怠、脘腹疼痛。
            　　（2）燥咳少痰，肺虚久咳。
            　　（3）肠燥便秘。
            　　（4）乌头类药中毒。
            　　（5）疮疡不敛，水火烫伤。（外用）
            `},
                    {
                        name: '饴糖',
                        gongneng: '补脾益气，缓急止痛，润肺止咳'
                    },
                ]
            },
            {
                name: '补阳药',
                list: [
                    {
                        name: '鹿茸',
                        tedian: '为血肉有情之品。为治肾阳不足、精血亏虚证之首选。',
                        gongneng: '壮肾阳，益精血，强筋骨，调冲任，托疮毒',
                        bingzhen: `（1）肾阳不足之阳痿滑精，宫冷不孕。
                  　　（2）精血虚亏之筋骨无力，神疲羸弱，眩晕耳鸣，小儿
                  　　骨软行迟、囟门不合。
                  　　（3）妇女冲任虚寒、带脉不固之崩漏、带下过多。
                  阴疽内陷，疮疡久溃不敛
                  `,
                        zhuyi: '本品温热峻烈，故阴虚阳亢、实热、痰火内盛、血热出血及外感热病者忌服。宜从小剂量开始，逐渐加量，以免伤阴动血。'
                    },
                    {
                        name: '肉苁蓉',
                        gongneng: '补肾阳，益精血，润肠通便。'
                    },
                    {
                        name: '锁阳',
                        gongneng: '补肾阳，益精血，润肠通便'
                    },
                    {
                        name: '淫羊藿',
                        xingwei: '辛、甘，温。归肝、肾经。',
                        gongneng: '补肾阳，强筋骨，祛风湿。',
                        tedian: '功力较强而灵验，故又名仙灵脾。'
                    },
                    {
                        name: '巴戟天',
                        gongneng: '补肾阳，强筋骨，祛风湿',
                        tedian: '为治肾阳虚衰或兼风湿之要药'
                    },
                    {
                        name: '仙茅',
                        xingwei: '辛，热。有毒。归肾、肝、脾经',
                        gongneng: '补肾壮阳，强筋健骨，祛寒除湿',
                        bingzhen: `
                （1）肾虚之阳痿精冷。
                　　（2）肾虚之筋骨冷痛，寒湿久痹。
                　　（3）阳虚冷泻。
                `},
                    {
                        name: '狗脊',
                        gongneng: '补肝肾，强腰膝，祛风湿',
                    },
                    {
                        name: '杜仲',
                        gongneng: '补肝肾，强筋骨，安胎',
                        tedian: '兼降血压。',
                        bingzhen: `（1）肝肾不足之腰膝酸痛、筋骨无力。
                　　（2）肝肾亏虚之胎动不安、胎漏下血。
                　　（3）高血压属肝肾亏虚者。
                `
                    },
                    {
                        name: '续断',
                        tedian: '为内科补肝肾、妇科止崩漏、伤科疗折伤之要药',
                        gongneng: '补肝肾，行血脉，续筋骨',
                        bingzhen: `（1）肝肾不足之腰痛脚弱、遗精。
                    　　（2）肝肾亏虚之崩漏经多，胎漏下血，胎动欲坠。
                    　　（3）跌仆损伤，金疮，痈疽肿痛。
                    `,

                    },
                    {
                        name: '补骨脂',
                        tedian: '为脾肾阳虚泄泻之要药。有名“破故纸者”',
                        gongneng: '补肾壮阳，固精缩尿，温脾止泻，纳气平喘。',
                        bingzhen: `1）肾阳不足之阳痿、腰膝冷痛。
        　　（2）肾虚不固之滑精、遗尿、尿频。
        　　（3）脾肾阳虚之泄泻（五更泻）。
        　　（4）肾虚作喘。
        　　此外，还可外治白癜风。
        `},
                    {
                        name: '益智仁',
                        gongneng: '暖肾固精缩尿，温脾止泻摄唾',
                        bingzhen: `肾气虚寒的遗精滑精、遗尿、夜尿频多。
                　　（2）脾寒泄泻，腹中冷痛，脾虚口多涎唾。
                `
                    },
                    {
                        name: '菟丝子',
                        gongneng: '补阳益阴，固精缩尿，明目止泻，安胎，生津。',
                        bingzhen: `（1）肾虚之腰膝酸痛、阳痿、滑精、尿频、白带过多。
                　　（2）肝肾不足之目暗不明。
                　　（3）脾虚便溏或泄泻。
                　　（4）肾虚之胎漏、胎动不安。
                　　（5）阴阳两虚之消渴。
                `,
                        zhuyi: '本品虽曰平补阴阳，但仍偏补阳，且带涩性，故阴虚火旺而见大便燥结、小便短赤者忌服。'
                    },
                    {
                        name: '骨碎补',
                        gongneng: '补肾，活血，止痛，续伤',
                        bingzhen: `肾虚之腰痛、脚弱、耳鸣、耳聋、牙痛、久泻。
                    　　（2）跌仆闪挫，筋伤骨折
                    `
                    },
                    {
                        name: '蛤蚧',
                        gongneng: '补肺气，定喘嗽，助肾阳，益精血。',
                        zhuyi: '煎汤，3～6g；研末，每次1～2g；浸酒，每次1～2对'
                    },
                    {
                        name: '冬虫夏草',
                        gongneng: '益肾补肺，止血化痰。',
                        bingzhen: `1）肾虚之阳痿、腰膝酸痛。
                　　（2）肺肾两虚之久咳虚喘，肺阴不足的劳嗽痰血。
                `
                    },
                    {
                        name: '核桃仁',
                        gongneng: '补肾，温肺，润肠',

                    },
                    {
                        name: '紫河车',
                        gongneng: '温肾补精，养血益气。',
                        jiqiao: '吃了紫河车，气血精神头好了。气对应益气，血对应养血，精对应补精，神对应温肾',
                        bingzhen: `1）肾虚精亏之不孕、阳痿、遗精、腰酸。
            　　（2）气血两亏之面色萎黄、消瘦乏力、产后少乳。
            　　（3）肺肾两虚之气喘咳嗽。
            　　（4）11癫痫久发，气血亏虚。
            `,

                    },
                    {
                        name: '沙苑子',
                        gongneng: '补肾固精，养肝明目。'
                    },
                    {
                        name: '海马',
                        gongneng: '补肾助阳，活血散结，消肿止痛'
                    },
                ]
            },
            {
                name: '补血药',
                list: [
                    {
                        name: '当归',
                        gongneng: '补血活血，调经止痛，润肠通便',
                        tedian: '既为妇科调经之要药，又为内科补血之佳品，还为外科、伤科消肿疗伤所常用',
                        zhuyi: '当归身补血，当归尾破血，全当归和血。一般宜生用，活血通经宜酒炒。'
                    },
                    {
                        name: '熟地黄',
                        gongneng: '补血滋阴，补精益髓',
                        bingzhen: `（1）血虚之萎黄、眩晕、心悸、月经不调、崩漏。
                    　　（2）肾阴不足之潮热、盗汗、遗精，消渴。
                    　　（3）精血亏虚之腰酸脚软、头晕眼花、耳聋耳鸣、须发早白。
                    `,

                    },
                    {
                        name: '何首乌',
                        gongneng: '补益精血，解毒，截疟，润肠通便',
                    },
                    {
                        name: '白芍',
                        gongneng: '养血调经，敛阴止汗，柔肝止痛，平抑肝阳。'
                    },
                    {
                        name: '阿胶',
                        gongneng: '补血止血，滋阴润燥',
                        bingzhen: `（1）血虚眩晕、心悸。
                　　（2）吐血，衄血，便血，崩漏，妊娠胎漏。
                　　（3）阴虚燥咳或虚劳喘咳。
                　　（4）阴虚心烦、失眠。
                `,
                        zhuyi: '内服：烊化。止血宜蒲黄炒，润肺宜蛤粉炒。'
                    },
                    {
                        name: '龙眼肉',
                        gongneng: '补心脾，益气血，安心神。'
                    },
                ]
            },
            {
                name: '补阴药',
                list: [
                    {
                        name: '南沙参',
                        gongneng: '清肺养阴，祛痰，益气。',
                        bingzhen: `（1）肺热燥咳有痰，阴虚劳嗽咯血。
                  　　（2）气阴两伤之舌干口渴。
                  `
                    },
                    {
                        name: '北沙参',
                        gongneng: '养阴清肺，益胃生津',

                    },
                    {
                        name: '玉竹',
                        gongneng: '滋阴润肺，生津养胃。',

                    },
                    {
                        name: '麦冬',
                        xingwei: '甘、微苦，微寒。归肺、心、胃经',
                        gongneng: '润肺养阴，益胃生津，清心除烦，润肠通便。',
                    },
                    {
                        name: '天冬',
                        xingwei: '甘、苦，寒。归肺、肾经。',
                        gongneng: '滋阴降火，清肺润燥，润肠通便',
                    },
                    {
                        name: '石斛',
                        gongneng: '养胃生津，滋阴除热，明目，强腰'
                    },
                    {
                        name: '黄精',
                        tedian: '为平补气阴之品',
                        gongneng: '滋阴润肺，补脾益气。',
                        bingzhen: `（1）肺虚燥咳，劳嗽久咳。
                  　　（2）肾虚精亏之腰膝酸软、须发早白、头晕乏力。
                　　（3）气虚倦怠乏力，阴虚口干便燥。
                　　（4）气阴两虚，内热消渴。

                  `
                    },
                    {
                        name: '枸杞子',
                        gongneng: "滋补肝肾，明目，润肺"
                    },
                    {
                        name: '女贞子',
                        gongneng: '滋肾补肝，清虚热，明目乌发',
                        bingzhen: `（1）肝肾阴虚之头晕目眩、腰膝酸软、须发早白。
                　　（2）阴虚发热。
                　　（3）肝肾虚亏之目暗不明、视力减退。
                `
                    },
                    {
                        name: '墨旱莲',
                        gongneng: '滋阴益肾，凉血止血',
                        bingzhen: `肝肾阴虚之头晕目眩、须发早白。
                　　（2）阴虚血热之吐血、衄血、尿血、便血、崩漏。
                `
                    },
                    {
                        name: '龟甲',
                        gongneng: '滋阴潜阳，益肾健骨，养血补心，凉血止血',
                        bingzhen: `（1）阴虚阳亢之头晕目眩，热病伤阴之虚风内动。
                  　　（2）阴虚发热。
                  　　（3）肾虚之腰膝痿弱、筋骨不健、小儿囟门不合。
                  　　（4）心血不足之心悸、失眠、健忘。
                  　　（5）血热崩漏、月经过多。
                  `

                    },
                    {
                        name: '鳖甲',
                        gongneng: '滋阴潜阳，退热除蒸，软坚散结',

                    },
                    {
                        name: '百合',
                        gongneng: '养阴润肺，清心安神',

                    },
                    {
                        name: '桑葚',
                        gongneng: '滋阴补血，生津，润肠。',
                        bingzhen: `（1）阴虚血亏之眩晕、目暗、耳鸣、失眠、须发早白。
                    　　（2）津伤口渴，消渴。
                    　　（3）肠燥便秘。
                    `
                    },
                    {
                        name: '蛤蟆油',
                        gongneng: '补肾益精，养阴润肺',
                    },
                    {
                        name: '楮实子',
                        gongneng: '滋阴益肾，清肝明目，利尿',
                    },
                ]
            },
        ]
    },
    {
        name: '收敛药',
        list: [
            {
                name: '五味子',
                tedian: '上能敛肺止咳平喘，下能滋肾涩精止泻，内能生津宁心安神，外能固表收敛止汗。',
                gongneng: '肺肾收敛固涩，益气生津，滋肾宁心心'
            },
            {
                name: '五倍子',
                gongneng: '敛肺降火，涩肠固精，敛汗止血，收湿敛疮。',
                jiqiao: '五倍子收敛强；上敛肺，下敛疮；五止在中央；咳汗精血肠。'
            },
            {
                name: '乌梅',
                gongneng: '敛肺，涩肠，生津，安蛔，止血',
                jiqiao: '非常渴。非对应敛肺，常对应涩肠，渴对应生津'
            },
            {
                name: '诃子',
                gongneng: '涩肠，敛肺，下气，利咽'
            },
            {
                name: '罂粟壳',
                gongneng: '敛肺，涩肠，止痛',
                zhuyi: '内服，煎汤，3～6g；或入丸散。止咳宜蜜炙用，止泻、止痛宜醋炒用。本品酸涩收敛，故咳嗽与泻痢初起者忌服。有毒并易成瘾，不宜大量服用或久服。孕妇及儿童禁用。运动员慎服。'
            },
            {
                name: '椿皮',
                gongneng: '清热燥湿，涩肠，止血，止带，杀虫',
                jiqiao: "清早带血肠杀虫。清早对应清热燥湿，带对应止带，血对应止血，肠对应涩肠，杀虫",
                bingzhen: `1）久泻久痢，湿热泻痢，便血。
                　　（2）崩漏，赤白带下。
                　　（3）蛔虫病。
                　　（4）疮癣作痒。
                `
            },
            {
                name: '石榴皮',
                xingwei: '酸、涩，温。有小毒。归胃、大肠经。',
                gongneng: '涩肠止泻，止血，杀虫。',

            },
            {
                name: '赤石脂',
                gongneng: '涩肠止泻，止血，止带；外用收湿敛疮生肌',
                jiqiao: '三止一收。三止对应止泻、止血、止带，一收对应收湿敛疮）',
                zhuyi: '别录》有治“难产胞衣不出”的记载，故孕妇慎服。'
            },
            {
                name: '莲子肉',
                gongneng: '补脾止泻，益肾固精，止带，养心安神',
                jiqiao: '带皮吃莲子，神经病。带对应止带，皮对应补脾，神经对应益肾固精',
                bingzhen: `（1）脾虚久泻、食欲不振。
            　　（2）肾虚遗精、滑精，脾肾两虚之带下。
            　　（3）心肾不交之虚烦、惊悸失眠。
            `

            },
            {
                name: '芡实',
                gongneng: '补脾祛湿，益肾固精',

            },
            {
                name: '覆盆子',
                tedian: '为涩敛兼补阴阳之品',
                gongneng: '益肾，固精，缩尿，养肝，明目。',

            },
            {
                name: '山茱萸',
                tedian: '为阴阳并补之品',
                gongneng: '补益肝肾，收敛固脱。'
            },
            {
                name: '桑螵蛸',
                gongneng: '固精缩尿，补肾助阳',
            },
            {
                name: '海螵蛸',
                tedian: '治崩漏带下效佳，堪称妇科之良药',
                gongneng: '收敛止血，固精止带，制酸止痛，收湿敛疮',
                bingzhen: `（1）崩漏下血，肺胃出血，创伤出血。
            　　（2）肾虚遗精，赤白带下。
            　　（3）胃痛吞酸。
            　　（4）湿疮湿疹，溃疡不敛。
            `
            },
            {
                name: '金樱子',
                gongneng: '固精缩尿，涩肠止泻，固崩止带',
                tedian: '善治下焦滑脱不禁诸证',
            },
            {
                name: '肉豆蔻',
                gongneng: '涩肠止泻，温中行气',
                bingzhen: `（1）久泻不止。
            　　（2）虚寒气滞之脘腹胀痛、食少呕吐
            `
            },
            {
                name: '麻黄根',
                gongneng: '收敛止汗'
            },
            {
                name: '浮小麦',
                gongneng: '益气，除热止汗'
            },
            {
                name: '糯稻根',
                gongneng: '止汗退热，益胃生津。'
            },
        ]
    },
    {
        name: '涌吐药',
        list: [
            {
                name: '常山',
                tedian: '为治疟疾寒热之要药',
                gongneng: '涌吐痰饮，截疟'
            },
            {
                name: '瓜蒂',
                gongneng: '内服涌吐热痰、宿食；外用研末吹鼻，引去湿热。',
                zhuyi: '内服：煎汤，2～5g；入丸散，0.3～1g。服后含咽砂糖能增药力。外用：少量研末吹鼻，待鼻中流出黄水即停药。若呕吐不止，用麝香0.01～0.015g，开水冲服可解。',

            },
            {
                name: '藜芦',
                gongneng: '涌吐风痰，杀虫疗癣',
                zhuyi: '内服：入丸散，0.3～0.9g。外用：适量，研末油调敷。'
            },
        ]
    },
    {
        name: '杀虫燥湿止痒药',
        list: [
            {
                name: '雄黄',
                gongneng: '解毒，杀虫，燥湿祛痰，截疟定惊。',
                zhuyi: '外用：适量。内服：入丸散，0.05～0.1g。入药忌火煅'
            },
            {
                name: '硫黄',
                gongneng: '外用解毒杀虫止痒，内服补火助阳通便',
                peiwu: "硫黄配大黄：硫黄酸温有毒，功能解毒杀虫止痒；大黄苦寒清泄，功能清热活血消肿。两药相配，外用善清热杀虫、燥湿止痒，11治酒皶鼻、粉刺。",
                zhuyi: '不宜与芒硝、玄明粉同用。'
            },
            {
                name: '轻粉',
                gongneng: '外用杀虫、攻毒、敛疮;内服祛痰消积，逐水通便',
                bingzhen: `（1）疥癣，梅毒，疮疡溃烂。
            　　（2）痰涎积滞、水肿鼓胀兼二便不利。
            `,
                zhuyi: '外用，适量。内服：入丸剂或装胶囊，每次0.1～0.2g，每日1～2次。服药后及时漱口，以免口腔糜烂。'
            },
            {
                name: '白矾',
                gongneng: `外用解毒杀虫，燥湿止痒；
            　　　　　　内服止血止泻，清热消痰。
            `,
                bingzhen: `（1）疮疡，疥癣，湿疹瘙痒，阴痒带下。
            　　（2）吐衄下血，泻痢不止。
            　　（3）风痰痫病，痰热癲狂。
            　　（4）湿热黄疸。
            `,
                jiqiao: '白色帆布鞋易变黄。鞋对应止血止泻，黄对应黄疸'

            },
            {
                name: '蛇床子',
                gongneng: '燥湿祛风，杀虫止痒，温肾壮阳。',

            },
            {
                name: '露蜂房',
                gongneng: '攻毒杀虫，祛风止痛',
                bingzhen: `疮疡肿毒，乳痈，瘰疬。
                　　（2）顽癣，11鹅掌风。
                　　（3）牙痛，风湿痹痛。
                `
            },
            {
                name: '铅丹',
                gongneng: `外用拔毒止庠，敛疮生肌；
                　　　　　　内服坠痰镇惊，攻毒截疟。
                `,

            },
            {
                name: '土荆皮',
                gongneng: '杀虫，疗癣，止痒',
                zhuyi: '外用适量，醋或酒浸涂擦，或研末涂擦患处;本品有毒，一般不作内服'
            },
        ]
    },
    {
        name: '拔毒消肿敛疮药',
        list: [
            {
                name: '斑蝥',
                xingwei: '辛，热。有大毒。归肝、胃、肾经',
                gongneng: '攻毒蚀疮，破血逐瘀，散结消癥。',
                zhuyi: '内服：炮制后入丸散，0.03～0.06g'
            },
            {
                name: '蟾酥',
                gongneng: '解毒消肿，止痛，开窍醒神',
                zhuyi: '入丸散，0.015～0.03g;　本品毒大，发疱腐蚀性强，故外用不可入目。孕妇慎用',
                jiqiao: '苏醒。苏对应蟾酥，醒对应醒神'
            },
            {
                name: '马钱子',
                gongneng: '散结消肿，通络止痛',
                jiqiao: '马小姐，钱同志。小姐对应消肿散结，同志通络止痛',
                zhuyi: '　本品有毒，服用过量可致肢体颤动、惊厥、呼吸困难，甚则昏迷，有毒成分还能经皮肤吸收，故内服应严格炮制，不能生用及多服久服，外用不宜大面积或长期涂敷。孕妇禁用，运动员慎用。'
            },
            { name: '升药', gongneng: '拔毒去腐' },
            {
                name: '炉甘石',
                gongneng: '明目去翳，收湿生肌'
            },
            {
                name: '儿茶',
                gongneng: '收湿敛疮，生肌止血，活血止痛，清肺化痰',
                zhuyi: '收拾床，谈升学。收拾床对应收湿敛疮，谈对应清肺化痰，升学对应生肌止血'
            },
            {
                name: '砒石',
                gongneng: '外用蚀疮去腐；内服劫痰平喘，截疟',
                jiqiao: '两大劫难。指劫痰、截疟',
                zhuyi: '外用：适量，研末撒或调敷、入膏药。内服：入丸散，每次0.002～0.004g。本品有大毒，故外用不宜过量或长时间大面积涂敷，疮疡腐肉已净者忌用，头面及疮疡见血者忌用。内服不能浸酒，不可超量或持续使用。孕妇忌用。'
            },
            {
                name: '硼砂',
                gongneng: '外用清热解毒，内服清肺化痰',
            },
            {
                name: '大蒜',
                gongneng: '解毒，消肿，杀虫，止痢。',
                bingzhen: `（1）疮痈，疥癣。
            　　（2）肺痨，顿咳。
            　　（3）痢疾，泄泻。
            　　（4）钩虫病，蛲虫病。
            　　此外，还可用于食鱼蟹中毒、防治流感等。
            `
            },
            {
                name: '猫抓草',
                gongneng: '化痰散结，解毒消肿。',
                jiqiao: '猫到花坛爪草，中毒。花坛对应化痰，中毒对应消肿解毒'
            },
            {
                name: '毛茛',
                gongneng: '发泡止痛，攻毒杀虫',
                zhuyi: `本品有毒，一般只作外用。外敷皮肤有刺激性，不宜久敷，皮肤过敏者禁用。孕妇、小儿及体弱者不宜用。`
            },
        ]
    },
]
const miaosha = [
    {
        title: '助阳化气',
        yao: '桂枝'
    },
    {
        title: '腐蚀赘疣',
        yao: '鸦胆子'
    },
    {
        title: '回阳救逆',
        yao: '附子/四逆汤'
    },
    {
        title: '引火归元',
        yao: '肉桂'
    },
    {
        title: '开郁醒脾',
        yao: '甘松'
    },
    {
        title: '通阳散结',
        yao: '薤白'
    },
    {
        title: '续筋接骨',
        yao: '土鳖虫'
    },
    {
        title: '杀虫灭虱',
        yao: '百部'
    },
    {
        title: '清肠疗痔',
        yao: '马兜铃'
    },
    {
        title: '聪耳明目',
        yao: '磁石'
    },
    {
        title: '生发乌发',
        yao: '侧柏叶'
    },
    {
        title: '大补元气',
        yao: '人参'
    },
    {
        title: '补精益髓',
        yao: '熟地黄'
    },
    {
        title: '发泡止痛',
        yao: '毛茛'
    },
    {
        title: '劫痰',
        yao: '砒石'
    },
    {
        title: '坠痰',
        yao: '铅丹'
    },
    {
        title: '温肺化饮',
        yao: '干姜，细辛（小青龙）'
    },
    {
        title: '安神益智',
        yao: '人参远志'
    },
    {
        title: '引血下行',
        yao: '牛膝，川牛膝'
    },
    {
        title: '通利关节',
        yao: '川牛膝，土茯苓'
    },
    {
        title: '回乳',
        yao: '芒硝，麦芽'
    },
    {
        title: '解蛇毒',
        yao: '徐长卿，五灵脂'
    },
    {
        title: '止咳，止呕',
        yao: '生姜/枇杷叶'
    },
    {
        title: '乌发',
        yao: '侧柏叶，女贞子'
    },
    {
        title: '祛痰排脓',
        yao: '金荞麦，桔梗'
    },
    {
        title: '脉结代',
        yao: '炙甘草/益心舒胶囊'
    },
    {
        title: '梅毒',
        yao: '土茯苓/轻粉'
    },
    {
        title: '噤口痢',
        yao: '石菖蒲'
    },
    {
        title: '膏淋白浊',
        yao: '萆薢'
    },
    {
        title: '吐泻转筋',
        yao: '木瓜'
    },
    {
        title: '阿米巴痢疾',
        yao: '鸦胆子，白头翁'
    },
    {
        title: '诸骨鲠喉',
        yao: '威灵仙'
    },
    {
        title: '带状疱疹',
        yao: '雷公藤（龙胆）'
    },
    {
        title: '恍惚',
        yao: '远志，石菖蒲，百合'
    },
    {
        title: '蛔厥腹痛',
        yao: '乌梅'
    },
    {
        title: '鹅掌风',
        yao: '露蜂房'
    },
    {
        title: '喉中辘辘如鸡水声',
        yao: '射干'
    },
    {
        title: '夜盲',
        yao: '苍术'
    },
    {
        title: '目珠夜痛',
        yao: '夏枯草'
    },
    {
        title: '无汗骨蒸',
        yao: '牡丹皮'
    },
    {
        title: '夜热早凉',
        yao: '青蒿'
    },
    {
        title: '痱子',
        yao: '滑石/六一散'
    },
    {
        title: '小儿惊哭夜啼',
        yao: '蝉蜕/灯心草'
    },
    {
        title: '食积伤酒',
        yao: '化橘红'
    },
    {
        title: '梅核气',
        yao: '梅花，半夏'
    },
    {
        title: '妇女倒经',
        yao: '郁金'
    },
    {
        title: '湿热脾瘅',
        yao: '佩兰'
    },
]
const xiaojie = [
    {
        title: '杀虫疗癣的药物',
        content: '川楝子、苦楝皮、藜芦、土荆皮'
    },
    {
        title: '能制酸止痛的药物',
        content: '海螵蛸、海蛤壳、瓦楞子、牡蛎'
    },
    {
        title: '阴阳双补的药物',
        content: '菟丝子、覆盆子、山茱萸'
    },
    {
        title: '可以祛风湿的补阳药',
        content: '狗（狗脊）拔（巴戟天）羊（淫羊藿）毛（仙茅）'
    },
    {
        title: '可以活血行气止痛的药',
        content: '川芎（祛风）、元胡、郁金（解郁）、三棱（破血）、莪术（消积）、姜黄（通经）、安息香（开窍辟秽）'
    },
    {
        title: '可以治恍惚的三个药',
        content: '远志（治神志恍惚）、石菖蒲（治健忘恍惚）、百合（治精神恍惚）'
    },
    {
        title: '可以解毒敛疮的两个药',
        content: '地榆、珍珠'
    },
    {
        title: '可以纳气的三个药',
        content: '磁石、沉香（温肾纳气）、补骨脂'
    },
    {
        title: '可用于外科麻醉的两个药',
        content: '洋金花、川乌'
    },
    {
        title: '可以润肺的三个药：',
        content: '紫菀、百部、款冬花'
    },
    {
        title: '止咳平喘，润肠通便的三药：',
        content: '苦杏仁、桃仁、紫苏子'
    },
    {
        title: '化痰三子：',
        content: '莱菔子、白芥子、紫苏子均可化痰。'
    },
    {
        title: '治疗结石的药物有',
        content: '金钱草、郁金、鸡内金、虎杖。技巧：三金一虎杖'
    },
    {
        title: '主要通乳（下乳）的药物有',
        content: '路路通、通草、木通、冬葵子、穿山甲、王不留行。注：蒲公英性能特点有通乳。'
    },
    {
        title: '通鼻窍四药：',
        content: '辛夷、苍耳子、细辛、白芷。技巧：小姨子又细又白'
    },

    {
        title: '主要透疹药小结：',
        content: '荆芥、西河柳、薄荷、牛蒡子、蝉蜕、升麻、葛根、浮萍、紫草'
    },
    {
        title: '能截疟的药物：',
        content: '鸦胆子、仙鹤草、何首乌、青蒿、草果、槟榔、常山、雄黄、铅丹、砒石。'
    },
    {
        title: '能破血的药物：',
        content: '土鳖虫、水蛭、斑蝥、三棱、莪术、姜黄、千金子、刘寄奴、瞿麦、干漆。'
    },
]
const chengyao = [
    {
        name: '解表剂',
        children: [
            {
                name: '辛温解表剂',
                list: [
                    { name: '桂枝合剂' },
                    { name: '表实感冒颗粒' },
                    { name: '感冒清热颗粒' },
                    { name: '正柴胡饮颗粒' },
                ]
            },
            {
                name: '辛凉解表剂',
                list: [
                    { name: '银翘解毒丸' },
                    { name: '桑菊感冒片' },
                    { name: '双黄连合剂' },
                    { name: '羚羊感冒胶囊' },
                    { name: '连花清瘟胶囊' },
                ]
            },
            {
                name: '解表胜湿剂',
                list: [
                    { name: '九味羌活丸' },
                    { name: '荆防颗粒' },
                    { name: '午时茶颗粒' },

                ]
            },
            {
                name: '祛暑解表剂',
                list: [
                    { name: '藿香正气水' },
                    { name: '保济丸' },
                ]
            },
            {
                name: '扶正解表剂',
                list: [
                    { name: '参苏丸' },
                ]
            },
        ]
    },
    {
        name: '祛暑剂',
        children: [
            {
                name: '祛暑除湿剂',
                list: [
                    {
                        name: '六一散',
                        gongneng: '清暑利湿。'
                    },
                    {
                        name: '甘露消毒丸',
                        gongneng: '芳香化湿，清热解毒',
                        bingzhen: '暑湿蕴结，身热肢酸、胸闷腹胀、尿赤11黄疸。'
                    },
                ]
            },
            {
                name: '祛暑避秽剂',
                list: [
                    {
                        name: '紫金锭（散）',
                        gongneng: '辟瘟解毒，消肿止痛',
                        jiqiao: '紫霞仙子与弼马温，没在一起，总痛',
                        bingzhen: '中暑，脘腹胀痛，恶心呕吐，痢疾泄泻，小儿痰厥；外治疔疮疖肿，痄腮，丹毒，喉风'
                    },

                ]
            },
            {
                name: '祛暑和中剂',
                list: [
                    {
                        name: '六合定中丸',
                        zhuyi: `广藿香、香薷、陈皮、姜厚朴、炒枳壳、木香、檀香、炒山楂、炒六神曲、炒麦芽、炒稻芽、茯苓、木瓜、炒白扁豆、紫苏叶、桔梗、甘草。`,
                        gongneng: '祛暑除湿，和中消食',
                        bingzhen: '夏伤暑湿，宿食停滞，寒热头痛，胸闷恶心，吐泻腹痛',

                    },
                    {
                        name: '十滴水（软胶囊）',
                        zhuyi: '樟脑、干姜、桉油、小茴香、肉桂、辣椒、大黄；含70％乙醇。',
                        gongneng: '健胃，祛暑',
                    },
                ]
            },
            {
                name: '清暑益气剂',
                list: [
                    {
                        name: '清暑益气丸',
                        gongneng: '祛暑利湿，补气生津',
                        zhuyi: '黄芪（蜜炙）、白术（炒）、人参、葛根、苍术（米泔炙）、升麻、麦冬、五味子（醋制）、泽泻、黄柏、陈皮、青皮（醋制）、六神曲（麸炒）、当归、甘草。',
                        bingzhen: '中暑受热，气津两伤，症见头晕身热、四肢倦怠、自汗心烦、咽干口渴'
                    },
                ]
            },

        ]
    },
    {
        name: '表里双解剂',
        children: [
            {
                name: '解表清里剂',
                list: [
                    {
                        name: '葛根芩连丸',
                        zhuyi: '葛根、黄芩、黄连、炙甘草',
                        gongneng: '解肌透表，清热解毒，利湿止泻',
                        bingzhen: '湿热蕴结所致的泄泻腹痛、便黄而黏、肛门灼热；以及风热感冒所致的发热恶风、头痛身痛。'
                    },
                    {
                        name: '双清口服液',
                        zhuyi: '金银花、连翘、郁金、大青叶、石膏、广藿香、知母、地黄、桔梗、甘草、蜂蜜',
                        gongneng: '疏透表邪，清热解毒',
                        bingzhen: '11风温肺热，卫气同病11，症见发热、微恶风寒、咳嗽、痰黄、头痛、口渴、舌红苔黄或黄白苔相兼，脉浮滑或浮数；急性支气管炎见上述证候者'
                    },
                ]
            },
            {
                name: '解表攻里剂',
                list: [
                    {
                        name: '防风通圣丸（颗粒）',
                        gongneng: '解表通里，清热解毒。',
                        zhuyi: '麻黄、荆芥穗、防风、薄荷、大黄、芒硝、滑石、栀子、石膏、黄芩、连翘、桔梗、当归、白芍、川芎、白术（炒）、甘草',
                        bingzhen: '外寒内热，表里俱实，恶寒壮热，头痛咽干，小便短赤，大便秘结，瘰疬初起，风疹湿疮。',
                    },

                ]
            },
        ]
    },
    {
        name: '泻下剂',
        children: [
            {
                name: '寒下剂',
                list: [
                    {
                        name: '通便宁片',
                        gongneng: '宽中理气，泻下通便',
                        zhuyi: '番泻叶干膏粉、牵牛子、砂仁、白豆蔻',
                        bingzhen: '肠胃实热积滞所致的便秘，症见大便秘结、腹痛拒按、腹胀纳呆、口干苦、小便短赤、舌红苔黄、脉弦滑数。'
                    },
                    {
                        name: '当归龙荟丸',
                        zhuyi: '酒龙胆、酒大黄、芦荟、酒黄连、酒黄芩、盐黄柏、栀子、青黛、酒当归、木香、人工麝香。',
                        gongneng:'泻火通便',
                        
                    },
                    { name: '九制大黄丸' },
                ]
            },
            {
                name: '润下剂',
                list: [
                    { name: '麻仁胶囊（软胶囊、丸）' },
                    { name: '增液口服液' },
                    { name: '通便灵胶囊' },
                    { name: '苁蓉通便口服液' },
                ]
            },
            {
                name: '峻下剂',
                list: [
                    { name: '舟车丸' },
                ]
            },
            {
                name: '通腑降浊剂',
                list: [
                    { name: '尿毒清颗粒' },
                ]
            },
        ]
    },
    {
        name: '清热剂',
        children: [
            {
                name: '清热泻火解毒剂',
                list: [
                    { name: '龙胆泻肝丸（颗粒、口服液）' },
                    { name: '黄连上清丸' },
                    { name: '一清颗粒（胶囊）' },
                    { name: '黛蛤散' },
                    { name: '牛黄上清丸（胶囊、片）' },
                    { name: '清胃黄连丸（片）' },
                    { name: '牛黄至宝丸' },
                    { name: '新雪颗粒' },
                    { name: '芩连片' },
                    { name: '导赤丸' },
                    { name: '板蓝根颗粒（茶、糖浆）' },
                ]
            },
            {
                name: '解毒消癥剂',
                list: [
                    { name: '抗癌平丸' },
                    { name: '西黄丸' },
                ]
            },

        ]
    },
    {
        name: '温里剂',
        children: [
            {
                name: '温中散寒剂',
                list: [
                    { name: '理中丸' },
                    { name: '小建中合剂' },
                    { name: '良附丸' },
                    { name: '香砂养胃颗粒（丸）' },
                    { name: '附子理中丸' },
                    { name: '香砂平胃丸（颗粒）' },

                ]
            },
            {
                name: '回阳救逆剂',
                list: [
                    { name: '四逆汤' },
                ]
            },
        ]
    },
    {
        name: '祛痰剂',
        children: [
            {
                name: '燥湿化痰剂',
                list: [
                    { name: '二陈丸' },
                    { name: '橘贝半夏颗粒' },
                ]
            },
            {
                name: '清化热痰剂',
                list: [
                    { name: '礞石滚痰丸' },
                    { name: '清气化痰丸' },
                    { name: '复方鲜竹沥液' },
                ]
            },
            {
                name: '化痰息风剂',
                list: [
                    { name: '半夏天麻丸' },
                ]
            },
            {
                name: '化痰散结剂',
                list: [
                    { name: '消瘿丸' },
                ]
            },
        ]
    },
    {
        name: '止咳平喘剂',
        children: [
            {
                name: '散寒止咳剂',
                list: [
                    { 
                        name: '通宣理肺丸',
                        gongneng:'解表散寒，宣肺止咳'
                    },
                    { name: '杏苏止咳颗粒（糖浆、口服液）',
                    gongneng:'宣肺散寒，止咳祛痰'
                 },
                ]
            },
            {
                name: '清肺止咳剂',
                list: [
                    { name: '清肺抑火丸' ,
                    gongneng:'清肺止咳，化痰通便'
                },
                    { name: '蛇胆川贝散（胶囊、软胶囊）',
                    gongneng:'清肺，止咳，祛痰' },
                    { name: '橘红丸',
                    gongneng:'清肺，化痰，止咳'
                 },
                    { name: '急支糖浆' ,
                    gongneng:'清热化痰，宣肺止咳'
                },
                    { name: '强力枇杷露（胶囊）',
                gongneng:'清热化痰，敛肺止咳' },
                    { name: '川贝止咳露',
                gongneng:'止嗽祛痰' },
                ]
            },
            {
                name: '润肺止咳剂',
                list: [
                    { name: '养阴清肺膏',
                    gongneng:'养阴润燥，清肺利咽' },
                    { name: '二母宁嗽丸',
                    gongneng:'清肺润燥，化痰止咳' },
                    { name: '蜜炼川贝枇杷膏',
                gongneng:'清热润肺，化痰止咳' },
                ]
            },
            {
                name: '发表化饮平喘剂',
                list: [
                    { name: '小青龙胶囊（合剂、颗粒、糖浆）', 
                    important: 1 ,
                gongneng:'解表化饮，止咳平喘'},
                    { name: '桂龙咳喘宁胶囊', important: 1 ,
                    gongneng:'化痰止咳，降气平喘'
                },
                ]
            },
            {
                name: '泄热平喘剂',
                list: [
                    { name: '止嗽定喘口服液 （=麻杏石甘汤）',
                     important: 1,
                    gongneng:'辛凉宣泄，清肺平喘'},
                ]
            },
            {
                name: '化痰平喘剂',
                list: [
                    { name: '降气定喘丸', important: 1,
                    gongneng:'降气定喘，祛痰止咳'
                 },
                    { name: '蠲哮片', important: 1 ,
                gongneng:'泻肺除壅，涤痰祛瘀，利气平喘'},
                ]
            },
            {
                name: '补肺平喘剂',
                list: [
                    { name: '人参保肺丸', important: 1 ,
                gongneng:'益气补肺，止嗽定喘'},
                ]
            },
            {
                name: '纳气平喘剂',
                list: [
                    { name: '苏子降气丸', important: 1,gongneng:'降气化痰，温肾纳气' },
                    { name: '七味都气丸', important: 1,gongneng:'补肾纳气，涩精止遗' },
                    { name: '固本咳喘片',gongneng:'益气固表，健脾补肾' },
                    { name: '蛤蚧定喘丸',gongneng:'滋阴清肺，止咳平喘' },
                ]
            },
        ]
    },
    {
        name: '开窍剂',
        children: [
            {
                name: '凉开剂',
                list: [
                    { name: '安宫牛黄丸（胶囊、散）' },
                    { name: '紫雪散' },
                    { name: '局方至宝散（丸）' },
                    { name: '万氏牛黄清心丸' },
                ]
            },
            {
                name: '温开剂',
                list: [
                    { name: '苏合香丸' },
                ]
            },
        ]
    },
    {
        name: '固涩剂',
        children: [
            {
                name: '益气固表',
                list: [
                    { name: '玉屏风胶囊' },
                ]
            },
            {
                name: '固脬缩尿',
                list: [
                    { name: '缩泉丸' },
                ]
            },
            {
                name: '固精止遗',
                list: [
                    { name: '金锁固精丸' },
                ]
            },
            {
                name: '涩肠止泻',
                list: [
                    { name: '四神丸（片）' },
                    { name: '固本益肠片' },
                ]
            },
        ]
    },
    {
        name: '补虚剂',
        children: [
            {
                name: '补气',
                list: [
                    { name: '四君子丸（合剂）' },
                    { name: '补中益气丸（口服液、合剂、颗粒）' },
                    { name: '参苓白术散（水丸、颗粒）' },
                    { name: '六君子丸' },
                    { name: '香砂六君丸（片）' },
                    { name: '启脾丸（口服液）' },
                ]
            },
            {
                name: '助阳',
                list: [
                    { name: '桂附地黄丸（胶囊）' },
                    { name: '右归丸（胶囊）' },
                    { name: '五子衍宗丸（片、口服液）' },
                    { name: '青娥丸' },
                ]
            },
            {
                name: '养血',
                list: [
                    { name: '当归补血口服液（丸、胶囊）' },
                    { name: '四物合剂' },
                ]
            },
            {
                name: '滋阴',
                list: [
                    { name: '六味地黄丸' },
                    { name: '左归丸' },
                    { name: '大补阴丸' },
                    { name: '知柏地黄丸' },
                    { name: '麦味地黄丸（口服液' },
                    { name: '玉泉丸' },
                    { name: '杞菊地黄丸' },
                ]
            },
            {
                name: '补气养血',
                list: [
                    { name: '八珍颗粒（丸）' },
                    { name: '人参归脾丸' },
                    { name: '人参养荣丸' },
                    { name: '十全大补丸（口服液' },
                    { name: '健脾生血颗粒' },
                ]
            },
            {
                name: '补气养阴',
                list: [
                    { name: '生脉饮' },
                    { name: '人参固本丸' },
                    { name: '消渴丸' },
                    { name: '参芪降糖胶囊' },
                    { name: '养胃舒胶囊' },
                ]
            },
            {
                name: '阴阳双补',
                list: [
                    { name: '龟鹿二仙膏' },
                ]
            },
            {
                name: '补精养血',
                list: [
                    { name: '七宝美髯丸' },
                ]
            },
        ]
    },
    {
        name: '安神剂',
        children: [
            {
                name: '补虚安神剂',
                list: [
                    { name: '天王补心丸' },
                    { name: '柏子养心丸' },
                    { name: '养血安神丸' },
                    { name: '枣仁安神液' },
                ]
            },
            {
                name: '解郁安神剂',
                list: [
                    { name: '解郁安神颗粒' },
                ]
            },
            {
                name: '清火安神剂',
                list: [
                    { name: '朱砂安神丸' },
                ]
            },
        ]
    },
    {
        name: '和解剂',
        children: [
            {
                name: '和解少阳剂',
                list: [
                    { name: '小柴胡颗粒' },
                ]
            },
            {
                name: '调和肝脾剂',
                list: [
                    { name: '逍遥颗粒' },
                    { name: '加味逍遥丸' },
                ]
            },

        ]
    },
    {
        name: '理气剂',
        children: [
            {
                name: '理气疏肝剂',
                list: [
                    { name: '四逆散' },
                    { name: '左金丸' },
                    { name: '柴胡舒肝丸' },
                    { name: '气滞胃痛颗粒' },
                    { name: '胃苏颗粒' },
                ]
            },
            {
                name: '理气和中剂',
                list: [
                    { name: '木香顺气丸' },
                    { name: '越鞠丸' },
                ]
            },

        ]
    },
    {
        name: '活血剂',
        children: [
            {
                name: '活血化瘀剂',
                list: [
                    { name: '复方丹参片' },
                    { name: '丹七片' },
                    { name: '血塞通颗粒' },
                    { name: '消栓通络胶囊' },
                    { name: '逐瘀通脉胶囊' },
                ]
            },
            {
                name: '活血行气剂',
                list: [
                    { name: '血府逐瘀口服液' },
                    { name: '元胡止痛片' },
                    { name: '速效救心丸' },
                    { name: '冠心苏合滴丸' },
                    { name: '心可舒胶囊' },
                    { name: '九气拈痛丸' },
                ]
            },
            {
                name: '益气活血剂',
                list: [
                    { name: '麝香保心丸' },
                    { name: '消栓胶囊' },
                    { name: '通心络胶囊' },
                    { name: '诺迪康胶囊' },
                ]
            },
            {
                name: '益气补阴活血剂',
                list: [
                    { name: '稳心颗粒' },
                    { name: '参松养心胶囊' },
                    { name: '益心舒胶囊' },
                ]
            },
            {
                name: '活血化痰息风剂',
                list: [
                    { name: '人参再造丸' },
                    { name: '华佗再造丸' },
                    { name: '抗栓再造丸' },
                ]
            },

        ]
    },
    {
        name: '止血剂',
        children: [
            {
                name: '凉血止血剂',
                list: [
                    { name: '槐角丸' },
                ]
            },
            {
                name: '化瘀止血剂',
                list: [
                    { name: '三七片' },
                    { name: '止血定痛片' },
                ]
            },
        ]
    },
    {
        name: '消导剂',
        children: [
            {
                name: '消积导滞剂',
                list: [
                    { name: '保和丸' },
                    { name: '枳实导滞丸' },
                    { name: '六味安消散' },
                ]
            },
            {
                name: '健脾消食剂',
                list: [
                    { name: '开胃健脾丸' },
                ]
            },
        ]
    },
    {
        name: '治风剂',
        children: [
            {
                name: '疏散外风剂',
                list: [
                    { name: '川芎茶调散' },
                    { name: '芎菊上清丸' },
                    { name: '正天丸' },
                ]
            },
            {
                name: '平肝息风剂',
                list: [
                    { name: '天麻钩藤颗粒' },
                    { name: '脑立清丸' },
                    { name: '松龄血脉康胶囊' },
                ]
            },
        ]
    },
    {
        name: '祛湿剂',
        children: [
            {
                name: '清利消肿剂',
                list: [
                    { name: '肾炎四味片' },
                    { name: '肾炎康复片' },
                ]
            },
            {
                name: '利尿通淋剂',
                list: [
                    { name: '八正合剂' },
                    { name: '癃闭舒胶囊' },
                    { name: '三金片' },
                    { name: '排石颗粒' },
                    { name: '癃清片' },
                ]
            },
            {
                name: '清利肝胆剂',
                list: [
                    { name: '茵栀黄口服液' },
                    { name: '茵陈五苓丸' },
                    { name: '消炎利胆片' },
                ]
            },
            {
                name: '清热燥湿止泻剂',
                list: [
                    { name: '香连丸' },
                    { name: '香连化滞丸' },
                ]
            },
            {
                name: '温化水湿剂',
                list: [
                    { name: '五苓散' },
                    { name: '萆薢分清丸' },
                ]
            },
        ]
    },
    {
        name: '蠲痹剂',
        children: [
            {
                name: '祛寒通痹剂',
                list: [
                    { name: '小活络丸' },
                    { name: '木瓜丸' },
                    { name: '风湿骨痛丸' },
                ]
            },
            {
                name: '清热通痹剂',
                list: [
                    { name: '四妙丸' },
                    { name: '痛风定胶囊' },
                ]
            },
            {
                name: '活血通痹剂',
                list: [
                    { name: '颈复康颗粒' },
                ]
            },
            {
                name: '补虚通痹剂',
                list: [
                    { name: '独活寄生合剂' },
                    { name: '天麻丸' },
                    { name: '仙灵骨葆胶囊' },
                    { name: '尪痹颗粒' },
                    { name: '壮腰健肾丸' },
                ]
            },
        ]
    },
    {
        name: '外科',
        children: [
            {
                name: '治疮疡剂',
                children: [
                    {
                        name: '解毒消肿剂',
                        list: [
                            { name: '连翘败毒丸' },
                            { name: '牛黄醒消丸' },
                            { name: '如意金黄散' },
                        ]
                    },
                    {
                        name: '生肌敛疮剂',
                        list: [
                            { name: '生肌玉红膏' },
                            { name: '紫草膏' },
                            { name: '拔毒生肌散' },
                        ]
                    },
                    {
                        name: '清热消痤剂',
                        list: [
                            { name: '当归苦参丸' },
                        ]
                    },
                ]
            },
            {
                name: '治烧伤剂',
                list: [
                    { name: '京万红软膏' },
                ]
            },
            {
                name: '瘰核乳癖剂-散结消核剂',
                list: [
                    { name: '内消瘰疬丸' },
                    { name: '小金丸' },
                    { name: '阳和解凝膏' },
                    { name: '乳癖消胶囊' },
                ]
            },
            {
                name: '治痔肿剂-清肠消痔剂',
                list: [
                    { name: '地榆槐角丸' },
                    { name: '马应龙麝香痔疮膏' },
                ]
            },
            {
                name: '治疹痒剂-祛风止痒剂',
                list: [
                    { name: '消风止痒颗粒' },
                    { name: '消银颗粒' },
                ]
            },
        ]
    },
    {
        name: '妇科',
        children: [
            {
                name: '调经剂',
                children: [
                    {
                        name: '活血行气调经剂',
                        list: [
                            { name: '大黄䗪虫丸' },
                            { name: '益母草颗粒' },
                            { name: '妇科十味片' },
                            { name: '七制香附丸' },
                        ]
                    },
                    {
                        name: '补虚扶正调经剂',
                        list: [
                            { name: '安坤颗粒' },
                            { name: '八珍益母丸' },
                            { name: '乌鸡白凤丸' },
                            { name: '女金丸' },
                        ]
                    },
                    {
                        name: '温经活血调经剂',
                        list: [
                            { name: '少腹逐瘀丸' },
                            { name: '艾附暖宫丸' },
                        ]
                    },
                    {
                        name: '固崩止血剂',
                        list: [
                            { name: '固经丸' },
                            { name: '宫血宁胶囊' },
                        ]
                    },
                    {
                        name: '安坤除烦剂',
                        list: [
                            { name: '更年安片' },
                            { name: '坤宝丸' },
                        ]
                    },
                ]
            },
            {
                name: '止带剂',
                children: [
                    {
                        name: '健脾祛湿止带剂',
                        list: [
                            { name: '千金止带丸' },
                        ]
                    },
                    {
                        name: '清热祛湿止带剂',
                        list: [
                            { name: '白带丸' },
                            { name: '妇科千金片' },
                            { name: '妇炎平胶囊' },
                            { name: '花红颗粒' },
                            { name: '消糜栓' },
                            { name: '保妇康栓' },
                        ]
                    },
                ]
            },
            {
                name: '产后康复剂',
                children: [
                    {
                        name: '化瘀生新剂',
                        list: [
                            { name: '生化丸' },
                            { name: '产复康颗粒' },
                        ]
                    },
                    {
                        name: '调理通乳剂',
                        list: [
                            { name: '下乳涌泉散' },
                            { name: '通乳颗粒' },
                        ]
                    },
                ]
            },
            {
                name: '疗杂病剂',
                children: [
                    {
                        name: '活血消癥剂',
                        list: [
                            { name: '桂枝茯苓丸' },
                        ]
                    },
                ]
            },
        ]
    },
    {
        name: '儿科',
        children: [
            {
                name: '解表剂',
                children: [
                    {
                        name: '疏风散热剂',
                        list: [
                            { name: '小儿热速清口服液' },
                        ]
                    },
                    {
                        name: '发散风寒剂',
                        list: [
                            { name: '儿感清口服液' },
                            { name: '解肌宁嗽丸' },
                        ]
                    },
                ]
            },
            {
                name: '清热剂',
                children: [
                    {
                        name: '清热解毒消肿剂',
                        list: [
                            { name: '小儿咽扁颗粒' },
                            { name: '小儿化毒散' },
                        ]
                    },
                ]
            },
            {
                name: '止泻剂',
                children: [
                    {
                        name: '清利止泻剂',
                        list: [
                            { name: '小儿泻速停颗粒' },
                        ]
                    },
                    {
                        name: '健脾止泻剂',
                        list: [
                            { name: '止泻灵颗粒' },
                            { name: '健脾康儿片' },
                        ]
                    },
                ]
            },
            {
                name: '消导剂',
                children: [
                    {
                        name: '消食导滞剂',
                        list: [
                            { name: '小儿消食片' },
                            { name: '小儿化食丸' },
                        ]
                    },
                    {
                        name: '健脾消食剂',
                        list: [
                            { name: '健脾消食丸' },
                            { name: '肥儿丸' },
                        ]
                    },
                ]
            },
            {
                name: '止咳喘剂',
                children: [
                    {
                        name: '清宣降气化痰剂',
                        list: [
                            { name: '小儿咳喘灵颗粒' },
                            { name: '清宣止咳颗粒' },
                            { name: '鹭鸶咯丸' },
                            { name: '儿童清肺丸' },
                            { name: '小儿消积止咳口服液' },
                        ]
                    },
                ]
            },
            {
                name: '补虚剂',
                children: [
                    {
                        name: '益气养阴剂',
                        list: [
                            { name: '龙牡壮骨颗' },
                        ]
                    },
                ]
            },
            {
                name: '镇惊息风剂',
                children: [
                    {
                        name: '治急惊剂',
                        list: [
                            { name: '琥珀抱龙丸' },
                            { name: '牛黄抱龙丸' },
                        ]
                    },
                ]
            },

        ]
    },
    {
        name: '眼科',
        children: [
            {
                name: '清热剂',
                children: [
                    {
                        name: '清热散风明目剂',
                        list: [
                            {
                                name: '明目蒺藜丸',
                            },
                            {
                                name: '明目上清片',
                            },
                        ]
                    },
                    {
                        name: '清热泻火明目剂',
                        list: [
                            {
                                name: '八宝眼药散',
                            },
                            {
                                name: '黄连羊肝丸',
                            },
                        ]
                    },

                ]
            },
            {
                name: '扶正剂',
                children: [
                    {
                        name: '滋阴养肝明目剂',
                        list: [
                            { name: '明目地黄丸' },
                            { name: '石斛夜光颗粒' },
                            { name: '障眼明片' },
                        ]
                    },
                    {
                        name: '益气养阴化瘀明目剂',
                        list: [
                            { name: '复方血栓通胶囊' },
                        ]
                    },
                ]
            },
        ],
    },
    {
        name: '五官科',
        children: [
            {
                name: '治耳聋耳鸣剂',
                children: [
                    {
                        name: '清肝利耳剂',
                        list: [
                            { name: '耳聋丸' },
                        ]
                    },
                    {
                        name: '益肾聪耳剂',
                        list: [
                            { name: '耳聋左慈丸' },
                        ]
                    },
                ]
            },
            {
                name: '冶鼻鼽鼻渊剂',
                children: [
                    {
                        name: '清宣通窍剂',
                        list: [
                            { name: '鼻炎康片' },
                            { name: '千柏鼻炎片' },
                        ]
                    },
                    {
                        name: '清化通窍剂',
                        list: [
                            { name: '藿胆丸' },
                        ]
                    },
                    {
                        name: '散风通窍剂',
                        list: [
                            { name: '鼻渊舒胶囊' },
                            { name: '辛芩颗粒' },
                        ]
                    },
                ]
            },
            {
                name: '治咽肿声哑剂',
                children: [
                    {
                        name: '清解利咽剂',
                        list: [
                            { name: '冰硼散' },
                            { name: '桂林西瓜霜' },
                            { name: '复方鱼腥草片' },
                            { name: '六神丸' },
                        ]
                    },
                    {
                        name: '滋润利咽剂',
                        list: [
                            { name: '玄麦甘桔含片' },
                            { name: '清音丸' },
                        ]
                    },
                    {
                        name: '化腐利咽剂',
                        list: [
                            { name: '锡类散' },
                            { name: '珠黄散' },
                        ]
                    },
                    {
                        name: '开音利咽剂',
                        list: [
                            { name: '黄氏响声丸' },
                            { name: '清咽滴丸' },
                        ]
                    },

                ]
            },
            {
                name: '治口疮剂',
                children: [
                    {
                        name: '清解消肿剂',
                        list: [
                            { name: '栀子金花丸' },
                        ]
                    },
                    {
                        name: '滋阴清解剂',
                        list: [
                            { name: '口炎清颗粒' },
                        ]
                    },
                ]
            },
        ],
    },
    {
        name: '骨伤科常用中成药',
        children: [
            {
                name: '接骨续伤剂',
                list: [
                    { name: '接骨七厘片' },
                    { name: '接骨丸' },
                ]
            },
            {
                name: '化瘀止痛剂',
                list: [
                    { name: '七厘散' },
                    { name: '云南白药' },
                    { name: '跌打丸' },
                    { name: '舒筋活血片' },
                    { name: '活血止痛散' },
                ]
            },

        ],
    },

]
export { data, miaosha, xiaojie, chengyao }