const tiqv = [
  {
    id: 1,
    label: '溶剂法',
    children: [
      {
        id: 4,
        label: '浸渍法',
      },
      {
        id: 4,
        label: '渗漉法',
      },
      {
        id: 4,
        label: '煎煮法',
      },
      {
        id: 4,
        label: '回流法',
      },
      {
        id: 4,
        label: '连续回流法',
      },
    ],
  },
  {
    id: 2,
    label: '水蒸气蒸馏法',
  },
  {
    id: 2,
    label: '升华法',
  },
  {
    id: 2,
    label: '超声法',
  },
  {
    id: 2,
    label: '临界流体萃取法',
  },
]
const lihuaxingzhi = '性状、挥发性、旋光性、水中溶解性、有机溶剂中溶解性、酸性、碱性、荧光性质、发泡性、溶血性、显色反应、沉淀反应、水解反应、酶解反应、氧化还原反应等'
const yaohuafenlun = [
  {
    title: '生物碱',
    dingyi: '来源于生物界（主要是植物界）的一类含氮有机化合物',
    des: '大多具有复杂的环状结构，氮原子结合在环内（特例：有机胺类生物碱N原子不在环内）',
    fenbu: [
      {
        title: '双子叶(50科120属)：',
        content: '毛茛科（黄连属黄连，乌头属乌头、附子）、防己科（汉防己、北豆根）、罂粟科（罂粟、延胡索）、茄科（曼陀罗属洋金花、颠茄属颠茄、莨菪属莨菪）、马钱科（马钱子）、小檗科（三颗针）、豆科（苦参属苦参、槐属苦豆子）、芸香科吴茱萸属（吴茱萸）等',
      },
      {
        title: '单子叶',
        content: '石蒜科、百合科（贝母属的川贝母、浙贝母）、兰科等'
      },
      {
        title: '裸子植物',
        content: '麻黄科、红豆杉科、三尖杉科和松柏科等'
      },
      {
        title: '低等植物',
        content: '如烟碱存在于蕨类植物中，麦角生物碱存在于菌类植物中'
      },
      {
        title: '其他',
        content: `地衣、苔藓类植物中仅发现少数简单的吲哚类生物碱。
        藻类、水生类植物中未发现生物碱。
        `
      },

    ],
    fenbujiqiao: '宝马别逗罂粟(毛茛科、马钱科、茄科、豆科、罂粟科）,防己终于小破(防己科、吴茱萸属、小檗科',
    kuozhan: `引申知识点——生物碱分布特点（了解）：
    　　（1）在植物体中多数集中分布于某一器官或某一部位（金鸡纳生物碱——树皮；麻黄——髓部；黄柏——树皮；三颗针——根部）；
    　　（2）在不同的植物中含量差别很大；
    　　（3）同科同属的植物常含有相同结构类型生物碱；
    　　（4）生物碱极少和萜类和挥发油共存于一植物中；
    　　（5）绝大多数生物碱以有机酸盐形式存在。
    `,
    
  },
  {
    title:'糖和苷'
  },
  {
    title:'醌类化合物'
  },
  {
    title:'苯丙素类化合物',
    des:'香豆素和木脂素'
  },
  {
    title:'黄酮类化合物'
  },
  {
    title:'萜类和挥发油'
  },
  {
    title:'三萜类与甾体化合物',
    des:`甾体皂苷类
    　　强心苷类
    　　胆汁酸类
    　　蜕皮激素类
    `
  },
  {
    title:'其他化学成分',
    des:'有机酸，鞣质，蛋白质和酶，多糖'
  },
]
const jianding = [
  {
    title:'常用根及根茎类中药',
    children:[
      {
        title:'狗脊'
      },
      {
        title:'绵马贯众'
      },
      {
        title:'细辛',
        buwei:' 根和根茎'
      },
      {
        title:'大黄',
        buwei:' 根和根茎'
      },
      {
        title:'虎杖',
      },
      {
        title:'何首乌',
        buwei:'块根',
      },
      {
        title:'牛膝——四大怀药VS川牛膝',
        buwei:'块根',
      },
      {
        title:'商陆',
      },
      {
        title:'银柴胡',
      },
      {
        title:'太子参—略烫',
      },
      {
        title:'威灵仙——毛茛科',
        buwei:'根及根茎'
      },
      {
        title:'川乌',
        buwei:'乌头母根'
      },
      {
        title:'附子',
        buwei:'乌头子根'
      },
      {
        title:'草乌',
        buwei:'北乌头块根'
      },
      {
        title:'白芍（杭、亳、川）',
        jiagong:'刮粗皮煮透心或沸水煮后除外皮'
      },
      {
        title:'赤芍',
        jiagong:'晒干'
      },
      {
        title:'黄连-毛茛科、二级保护',
        fenlei:'味连，雅连，云连'
      },
      {
        title:'升麻',
      },
      {
        title:'防己-根',
      },
      {
        title:'防己-根',
      },
      {
        title:'北豆根-根茎',
      },
      {
        title:'山豆根-根及根茎',
      },
      {
        title:'延胡索-块茎',
      },
      {
        title:'板蓝根-十字花科',
      },
      {
        title:'南板蓝根-爵床科',
      },
      {
        title:'地榆-蔷薇科',
      },
      {
        title:'苦参-干燥根',
      },
      {
        title:'葛根',
      },
      {
        title:'粉葛',
      },
      {
        title:'甘草-根及根茎',
      },
      {
        title:'黄芪',
      },
      {
        title:'远志——三级保护',
      },
      {
        title:'人参——二级保护',
      },
      {
        title:'红参',
      },
      {
        title:'西洋参',
      },
      {
        title:'三七',
      },
      {
        title:'白芷',
      },
      {
        title:'当归',
      },
      {
        title:'羌活',
      },
      {
        title:'川芎',
      },
      {
        title:'藁本',
      },
      {
        title:'防风——三级保护',
      },
      {
        title:'柴胡VS银柴胡',
      },
      {
        title:'北沙参',
      },
    ]
  }
]
const zhiji = [

  {
    id: 1,
    label: '常见剂型：辅料;分类，特点；生产储藏要求;质量检查项目',
    children: [
      {
        id: 1,
        label: '固体制剂 ',
        children: [
          {
            label: '散剂',
          },
          {
            label: '颗粒剂',
          },
          {
            label: '胶囊剂',
          },
          {
            label: '丸剂',
            children:[
              {
                label:'水丸',
              },
              {
                label:'蜜丸（含水蜜丸）',
              },
              {
                label:'浓缩丸',
              },
              {
                label:'糊丸',
              },
              {
                label:'蜡丸',
              },
              {
                label:'滴丸',
              },
              {
                label:'糖丸',
              },
              {
                label:'丸剂包衣：目的，种类，材料',
              },
              {
                label:'丸剂质量要求',
              },
            ]
          },{
            label:'片剂',
            children:[
              {
                label:`口服片：普通片（素片、包衣片）、
                咀嚼片、口崩片、分散片、泡腾片
                缓释片、控释片、肠溶片
                `
              },
              {
                label:'口腔用片'
              },
              {
                label:'外用片'
              },
              {
                label:'其他'
              },
              {
                label:'中药片剂：全浸膏片、半浸膏片、全粉末片'
              },
              {
                label:'片剂辅料:填充剂（稀释剂，吸收剂），润湿剂，粘合剂，崩解剂，润滑剂，其他着色，矫味剂',
              }
            ]
          }
        ],
      },
      {
        id: 1,
        label: '浸出制剂 ',
        children: [
          {
            label: '汤剂与合剂',
          },
          {
            label: '糖浆剂与煎膏剂',
           
          },
          {
            label: '酒剂与酊剂',
          },
          {
            label: '流浸膏剂，浸膏剂，茶剂',
          }
        ],
      },
      {
        id: 1,
        label: '液体制剂 ',
        children: [
          {
            label: '真溶液，胶体溶液（高分子溶液，溶胶剂），乳浊液，混悬液',
          },
          {
            label: '附加剂：潜溶剂，助溶剂，增溶剂，防腐剂，其他（矫味剂，着色剂，抗氧剂，ph调节剂，金属离子络合剂）',
           
          },
          {
            label: '表面活性剂：阴离子，阳离子，两性离子，非离子',
            children:[
              {label:'应用：增溶剂，乳化剂，润湿剂，起泡剂，去污剂，消毒剂和抑菌剂'}
            ]
          },
          {
            label: '低分子溶液剂',
            children:[
              {
                label:'溶液剂，芳香水剂，浓芳香水剂，露剂，醑剂，甘油剂，糖浆剂'
              }
            ]
          },
          {
            label: '高分子溶液剂与溶胶剂',
          },
          {
            label: '乳浊剂/乳剂',
          },
          {
            label: '混悬剂',
          },
        ],
      },
      {
        id: 1,
        label: '无菌制剂 ',
        children: [
          {
            label: '大小容量注射剂',
          },
          {
            label: '眼用制剂（滴眼液，眼膏剂）',
           
          },
          {
            label: '局部外用无菌制剂',
          },
          {
            label: '用于手术时使用的无菌制剂',
          },
          {
            label: '热源',
          },
          {
            label: '注射剂的溶剂与附加剂',
          },
          {
            label: '注射用中药原料',
          },
          {
            label: '影响中药注射剂质量的因素',
          },
          {
            label: '输液剂',
          },
          {
            label: '眼用制剂',
          },
        ],
      },
      {
        id: 1,
        label: '外用制剂 ',
        children: [
          {
            label: '特点，分类',
            children:[
              {
                label:'软膏剂，乳膏剂，贴膏剂，贴剂，膏药'
              }
            ]
          },
        ],
      },
      {
        id: 1,
        label: '其他制剂',
        children: [
          {
            label: '栓剂',
          },
          {
            label: '气雾剂和喷雾剂',
           
          },
          {
            label: '胶剂',
          },
          {
            label: '膜剂',
          },
          {
            label: '其他传统制剂',
          },
        ],
      },
    ],
  },
  {
    id:2,
    label:'新剂型新技术',
  },
  {
    id:2,
    label:'中药体内过程',
  },
  {
    id:2,
    label:'中药制剂的稳定性',
  },

]
export { tiqv, lihuaxingzhi, yaohuafenlun,jianding,zhiji }
