const tiqv = [
  {
    id: 1,
    label: '溶剂法',
    children: [
      {
        id: 4,
        label: '浸渍法',
      },
      {
        id: 4,
        label: '渗漉法',
      },
      {
        id: 4,
        label: '煎煮法',
      },
      {
        id: 4,
        label: '回流法',
      },
      {
        id: 4,
        label: '连续回流法',
      },
    ],
  },
  {
    id: 2,
    label: '水蒸气蒸馏法',
  },
  {
    id: 2,
    label: '升华法',
  },
  {
    id: 2,
    label: '超声法',
  },
  {
    id: 2,
    label: '临界流体萃取法',
  },
]
const lihuaxingzhi = '性状、挥发性、旋光性、水中溶解性、有机溶剂中溶解性、酸性、碱性、荧光性质、发泡性、溶血性、显色反应、沉淀反应、水解反应、酶解反应、氧化还原反应等'
const yaohuafenlun = [
  {
    title: '生物碱',
    dingyi: '来源于生物界（主要是植物界）的一类含氮有机化合物',
    des: '大多具有复杂的环状结构，氮原子结合在环内（特例：有机胺类生物碱N原子不在环内）',
    fenbu: [
      {
        title: '双子叶(50科120属)：',
        content: '毛茛科（黄连属黄连，乌头属乌头、附子）、防己科（汉防己、北豆根）、罂粟科（罂粟、延胡索）、茄科（曼陀罗属洋金花、颠茄属颠茄、莨菪属莨菪）、马钱科（马钱子）、小檗科（三颗针）、豆科（苦参属苦参、槐属苦豆子）、芸香科吴茱萸属（吴茱萸）等',
      },
      {
        title: '单子叶',
        content: '石蒜科、百合科（贝母属的川贝母、浙贝母）、兰科等'
      },
      {
        title: '裸子植物',
        content: '麻黄科、红豆杉科、三尖杉科和松柏科等'
      },
      {
        title: '低等植物',
        content: '如烟碱存在于蕨类植物中，麦角生物碱存在于菌类植物中'
      },
      {
        title: '其他',
        content: `地衣、苔藓类植物中仅发现少数简单的吲哚类生物碱。
        藻类、水生类植物中未发现生物碱。
        `
      },

    ],
    fenbujiqiao: '宝马别逗罂粟(毛茛科、马钱科、茄科、豆科、罂粟科）,防己终于小破(防己科、吴茱萸属、小檗科',
    kuozhan: `引申知识点——生物碱分布特点（了解）：
    　　（1）在植物体中多数集中分布于某一器官或某一部位（金鸡纳生物碱——树皮；麻黄——髓部；黄柏——树皮；三颗针——根部）；
    　　（2）在不同的植物中含量差别很大；
    　　（3）同科同属的植物常含有相同结构类型生物碱；
    　　（4）生物碱极少和萜类和挥发油共存于一植物中；
    　　（5）绝大多数生物碱以有机酸盐形式存在。
    `,
    
  },
  {
    title:'糖和苷'
  },
  {
    title:'醌类化合物'
  },
  {
    title:'苯丙素类化合物',
    des:'香豆素和木脂素'
  },
  {
    title:'黄酮类化合物'
  },
  {
    title:'萜类和挥发油'
  },
  {
    title:'三萜类与甾体化合物',
    des:`甾体皂苷类
    　　强心苷类
    　　胆汁酸类
    　　蜕皮激素类
    `
  },
  {
    title:'其他化学成分',
    des:'有机酸，鞣质，蛋白质和酶，多糖'
  },
]
const jianding1 = [
  {
    id: 1,
    label:'常用根及根茎类中药',
    children:[
      {
        label:'狗脊',
        children:[
          {label:'蚌壳蕨科-根茎'}
        ]
      },
      {
        label:'绵马贯众',
        children:[
          {label:'鳞毛蕨科-根茎'},
          {label:'长倒卵形、略弯曲、表面密被叶柄残基及鳞片，断面黄白色维管束5～13个，环列'},
          {label:'以个大、质坚实、叶柄残基断面棕绿色者为佳，断面变黑者不能药用'},
        ]
      },
      {
        label:'细辛-三级保护-有毒-辽细辛',
        children:[
          {
            label:' 根和根茎'
          },
          {label:'以根灰黄，干燥、味辛辣、麻舌为佳'}
        ]
      },
      {
        label:'大黄-显微鉴别',
        children:[
          {
            label:' 根和根茎'
          },
          {
            label:'秋末地上部分枯黄、次春植株发芽前采挖——刮去外皮（忌用铁器）——绳穿成串干燥或直接干燥。'
          },
          {
            label:'根茎髓部宽广，有“星点”环列或散在；根木部发达，具放射状纹理，形成层环明显，无“星点”。'
          },
          {label:'气清香，味苦而微涩，嚼之粘牙，有砂粒感'},
          {label:'显微鉴别-草酸钙簇晶大而多，大黄粉末微量升华，可见菱状针晶或羽状结晶'}
        ]
      },
      {
        label:'虎杖',
        children:[
          {label:'切面皮部较薄，木部宽广，皮部与木部较易分离;根茎髓中有隔或呈空洞状'}
        ]
      },
      {
        label:'何首乌',
        children:[
          {label:'块根'},
          {label:'表面红棕色或红褐色'},
          {label:'皮部有4～11个类圆形异常维管束（云锦状花纹）环列'},
          {label:'以个大、身干、表面红褐色、断面显云锦状花纹，质坚粉性足者为佳'},
        ]
      },
      {
        label:'牛膝——四大怀药VS川牛膝',
        children:[
          {label:'牛膝-苋科-中心木质部较大，外周散多数黄白色点状维管束（筋脉点），断续排列成2～4轮同心环'},
          {label:'川牛膝-苋科-维管束点状，排列成数轮同心环'},
        ]
      },
      {
        label:'商陆-有毒',
        children:[
          {label:'横切片-木部隆起形成数个凸起的同心性环轮（罗盘纹）'},
          {label:'纵切片：木部呈平行条状突起'},
          {label:'味稍甜，久嚼麻舌'},
          {label:'以片大、色白、有粉性、“罗盘纹”明显者为佳。'},
        ]
      },
      {
        label:'银柴胡',
        children:[
          {label:'来源-石竹科银柴胡'},
          {label:'来源-浅棕黄至浅棕'},
          {label:'形状-砂眼，珍珠盘'},
          {label:'质地-硬脆'},
          {label:'断面-疏松有缝隙'},
          {label:'气味-味甘'},
          {label:'以根长均匀，外皮淡棕黄色，断面黄白色、 质较疏松者为佳'},
        ]
      },
      {
        label:'太子参—略烫-角质样',
        children:[
          {label:'石竹科孩儿参块根'},
          {label:'质地-质硬而脆'},
          {label:'形状-长纺锤或细长形，弯曲'},
        ]
      },
      {
        label:'威灵仙——毛茛科',
        children:[
          {label:'根及根茎'},
          {label:'来源-威灵仙-根茎呈柱状，下侧着生多数细根。质硬脆，易折断。表面黑褐色，有的皮部脱落，露出黄白色木质部。断面木部略方形。味淡'},
          {label:'棉团铁线莲-断面木部圆形。味咸'},
          {label:'东北铁线莲-断面木部近圆形。味辛辣'},
          {label:'以根长、皮黑肉白、质坚实、无地上残基者为佳'},
        ]
      },
      {
        label:'川乌vs附子vs草乌-毛茛科，有毒',
        children:[
          {label:'川乌-乌头母根-有小瘤状突起的侧根及除去子根后的痕迹，形成层环纹呈多角形，味辛辣、麻舌'},
          {label:'附子-乌头子根',
          children:[
            {label:'盐附子：有盐霜'},
            {label:'黑顺片：外皮黑褐、断面角质样'},
            {label:'白附片：无外皮、断面黄白半透明'},
          ]},
          {label:'草乌-北乌头块根-具不定根残基（钉角），形成环多角形，味辛辣、麻舌'},
          {label:'草乌-以个大、质坚实、断面色白、有粉性、残茎及须根少者为佳'},
          {label:'川乌-以饱满、质坚实、断面色白、有粉性者为佳'},
        ]
      },
      {
        label:'白芍（杭、亳、川）vs赤芍-毛茛科-显微鉴别',
        children:[
          {label:'白芍-刮粗皮煮透心或沸水煮后除外皮'},
          {label:'白芍-表面类白或淡红棕色，偶有残存棕褐色外皮，断面较平坦，类白或微红，形成层环明显，射线放射状，味苦，酸'},
          {label:'白芍-以根粗、坚实、无白心或裂隙者为佳'},
          {label:'赤芍-芍药或川赤芍根-晒干-气微香，味微苦、酸涩'},
          {label:'赤芍-以根粗壮，断面粉白色，粉性大者为佳'},
          {label:'粉末 白芍、炒白芍、酒白芍-糊化淀粉粒团块甚多。草酸钙簇晶直径11～35μm，存在于薄壁细胞中，常排列成行或一个细胞中含数个簇晶。纤维长梭形，直径15～40μm，壁厚， 微木化，具大的圆形纹孔'},
        ]
        
      },
      {
        label:'黄连-毛茛科、二级保护-根茎-显微鉴别',
        children:[
          {label:'味连-来源黄连-产地重庆-多分枝，集聚成簇，形如鸡爪，节间平滑如茎秆，称“过桥”，味极苦'},
          {label:'雅连-来源-三角叶黄连-产地四川-单枝，“过桥”长'},
          {label:'云连-云连-产地云南-单枝，弯曲呈钩状，细小'},
          {label:'粉末 黄连、黄连片、酒黄连、姜黄连、萸黄连：中柱鞘纤维束鲜黄色，纤维壁稍厚，纺锤形或梭形，纹孔明显。石细胞类方形、类圆形、类长方形或近多角形，直径25～64μm, 长至102μm，黄色，壁厚，壁孔明显。鳞叶表皮细胞绿黄色或黄棕色，细胞长方形或长多角形， 壁微波状弯曲或作连珠状增厚'},
        ]
      },
      {
        label:'升麻',
        children:[
          {label:'毛茛科 大三叶升麻、兴安升麻或升麻 根茎'},
          {label:'有数个圆形空洞茎基痕，洞内壁网状沟纹'},
          {label:'断面不平坦，有裂隙，纤维性。'},
          {label:'升麻疹透阳气举,留下空洞和网纹'},
        ]
      },
      {
        label:'防己-防己科粉防己的干燥根',
        children:[
          {label:'弯曲处常有深陷横沟呈结节状瘤块样（猪大肠）'},
          {label:'富粉性'},
          {label:'断面有排列稀疏的放射状纹理（车轮纹）'},
          {label:'以质坚实、粉性足、去净外皮者为佳'},
        ]
      },
      {
        label:'北豆根Vs山豆根',
        children:[
          {label:'北豆根-防己科蝙蝠葛 根茎'},
          {label:'北豆根-表面有弯曲细根，木部淡黄色，放射状排列，髓白色，味苦'},
          {label:'山豆根-豆科越南槐 根及根茎'},
          {label:'山豆根-木部淡黄色，豆腥气、味极苦（技巧：山上种豆太辛苦）'},
        ]
      },
      {
        label:'延胡索-浙八味',
        children:[
          {label:'罂粟科延胡索块茎'},
          {label:'加工：沸水中煮至恰无白心'},
          {label:'性状：表面黄色或黄褐色，有不规则网状皱纹。断面黄色，角质样，有蜡样光泽。'},
          {label:'以个大、饱满、质坚实、断面色黄者为佳'},
        ]
      },
      {
        label:'板蓝根-十字花科',
        children:[
          {label:'十字花科-菘蓝根'},
          {label:'根头部略膨大，可见叶柄残基和密集的疣状突起；皮部黄白色，木部黄色（金井玉栏）；味微甜而后苦涩——以条长、粗大、体实者为佳'}
        ]
      },
      {
        label:'南板蓝根-爵床科',
        children:[
          {label:'爵床科-马蓝根茎及根'},
          {label:'质硬而脆，易折断，断面不平坦，皮部蓝灰色，木部灰蓝色至淡黄褐色，中央有髓（海绵状）。根粗细不一，弯曲有分枝，细根细长而柔韧。气微，味淡'}
        ]
      },
      {
        label:'地榆-蔷薇科',
        children:[
          {label:'蔷薇科 地榆或长叶地榆（绵地榆）根'},
          {label:'有放射状纹理'},
          {label:'以条粗、质坚、断面粉色者为佳'},
        ]
      },
      {
        label:'苦参-干燥根',
        children:[
          {label:'豆科苦参干燥根'},
          {label:'外皮薄，多破裂反卷，易剥落，剥落处显黄色，光滑，味极苦'},
          {label:'以条匀、断面色黄白、无须根、味苦者为佳'},
        ]
      },
      {
        label:'葛根',
        children:[
          {label:'来源-野葛根'},
          {label:'呈纵切的长方形厚片或小方块；外皮淡棕色，有纵皱，粗糙。切面黄白色，纹理不明显。质韧，纤维性强。微甜——以块大、质坚实、色白、粉性足、纤维少者为佳'}
        ]
      },
      {
        label:'粉葛',
        children:[
          {label:'来源-甘葛藤 根'},
          {label:'体重质硬，富粉性，横切面可见由纤维形成的浅棕色同心性环纹。微甜'}
        ]
      },
      {
        label:'甘草-二级保护-根及根茎',
        children:[
          {label:'豆科 甘草、胀果甘草或光果甘草 根及根茎'},
          {label:'内蒙古、新疆、甘肃'},
          {label:'红棕；纵皱纹明显，皮孔横长；横切面形成层环纹明显；射线放射状，有裂隙（菊花心）；味甜而特殊。'},
          {label:'以外皮细紧、色红棕、质坚实、断面黄白色、粉性足、味甜者为佳。'},
        ]
      },
      {
        label:'黄芪',
        children:[
          {label:'豆科 蒙古黄芪（栽培品质佳）或膜荚黄芪 根'},
          {label:'皮部黄白色，木部淡黄色'},
          {label:'有放射状纹理及裂隙（菊花心）'},
          {label:'老根中心偶呈枯朽状，黑褐色或者呈空洞'},
          {label:'嚼之微有豆腥味'},
          {label:'以条粗长、断面色黄白、有粉性者为佳'},
        ]
      },
      {
        label:'远志——三级保护',
        children:[
          {label:'远志科 远志或卵叶远志 根'},
          {label:'有较密深陷的横皱纹，略呈结节状'},
          {label:'皮部易与木部剥离'},
          {label:'味苦、微辛，嚼之有刺喉感'},
        ]
      },
      {
        label:'人参——二级保护-吉辽黑-芦碗-粉性',
        children:[
          {label:'五加科人参的根和根茎'},
          {label:'栽培品：园参（生晒参、全须生晒参，蒸制红参）'},
          {label:'野生品：山参'},
          {label:'播于山林自然生长：林下山参——籽海'},
          {label:'真空冷冻干燥法可防止总皂苷损失（冻干参、活性参）'},
          {label:'人参-以条粗、质硬、完整者为佳'},
          {label:'西洋参——以体轻质硬、表面横纹紧密、气清香、味浓者为佳'},
          {label:'疏浅断续粗横纹及明显纵皱纹；支根2～3条，着生多数细长须根；根茎（芦头）多拘挛而弯曲，具稀疏的凹窝状茎痕（芦碗）及不定根（艼）'},
        ]
      },
      {
        label:'红参-角质样',
        children:[
          {label:'人参栽培品蒸制-根和根茎'},
          {label:'红棕色'},
        ]
      },
      {
        label:'西洋参-略粉性',
        children:[
          {label:'西洋参栽培品-根'},
          {label:'浅黄褐色或黄白色'},
        ]
      },
      {
        label:'三七',
        children:[
          {label:'五加科 三七 根及根茎'},
          {label:'云南文山'},
          {label:'主根（三七）、支根（筋条）、根茎（剪口）、须根（绒根）'},
          {label:'表面灰褐色或灰黄色。顶端有茎痕，周围有瘤状突起。体重，质坚实。断面灰绿色、黄绿色或灰白色。气微，味苦回甜'},
          {label:'以个大、体重、质坚、表面光滑、断面色灰绿或黄绿者为佳'},
        ]
      },
      {
        label:'白芷',
        children:[
          {label:'白芷:禹白芷－河南,祁白芷－河北'},
          {label:'白芷:皮孔样横向突起（疙瘩丁），形成层环近圆形'},
          {label:'杭白芷:川白芷－四川,杭白芷－浙江'},
          {label:'杭白芷:川白芷－四川,杭白芷－浙江'},
          {label:'杭白芷:皮孔样横向突起排成四纵行，形成层环近方形'},
          {label:'断面粉性，皮部散有多数棕色油点，气芳香，味辛、微苦——以条粗壮、体重、粉性足、香气浓郁者为佳'},
        ]
      },
      {
        label:'当归-伞形科',
        children:[
          {label:'甘肃岷县'},
          {label:'采收加工：捆成小把，上棚以烟火慢慢熏干。根上端（归头），主根（归身）、支根（归尾），全体（全归）'},
          {label:'支根3～5条或更多；质柔韧；有裂隙及多数棕色点状分泌腔；香气浓郁、味甘、辛、微苦。'},
          {label:'以主根粗长、油润、外皮色黄棕、断面色黄白、气味浓郁者为佳。柴性大、干枯无油或断面呈绿褐色者不可药用'},
          {label:'甘肃山民要回家，回家之后眼熏瞎，香气浓郁甘辛苦'},
        ]
      },
      {
        label:'羌活',
        children:[
          {label:'羌活（蚕羌、竹节羌），宽叶羌活（大头羌、条羌）根及根茎'},
          {label:'竹节蚕宝抢着活 心宽体胖很大条'},
          {label:'蚕羌：节间缩短， 呈紧密隆起的环状，形似蚕'},
          {label:'竹节羌：节间延长，形如竹节状。'},
          {label:'易折断，断面不平整，有多数裂隙，皮部黄棕色至暗棕色，油润，有棕色油点（朱砂点） ，木部黄白色，射线明显，髓部黄色至黄棕色。气香，味微苦而辛'},
        ]
      },
      {
        label:'川芎-伞形科-根茎',
        children:[
          {label:'不规则结节状拳形团块；表面有隆起的轮节；断面有油室；形成层环波状；纵切片边缘不整齐（蝴蝶片 ）；气浓香，稍有麻舌感，微回甜'},
          {label:'以个大、质坚实、断面黄白、油性大、香气浓者为佳 ）；气浓香，稍有麻舌感，微回甜'}
        ]
      },
      {
        label:'藁本',
      },
      {
        label:'防风——三级保护',
      },
      {
        label:'柴胡VS银柴胡',
      },
      {
        label:'北沙参',
      },
    ]
  }
]
const zhiji = [

  {
    id: 1,
    label: '常见剂型：辅料;分类，特点；生产储藏要求;质量检查项目',
    children: [
      {
        id: 1,
        label: '固体制剂 ',
        children: [
          {
            label: '散剂',
          },
          {
            label: '颗粒剂',
          },
          {
            label: '胶囊剂',
          },
          {
            label: '丸剂',
            children:[
              {
                label:'水丸',
              },
              {
                label:'蜜丸（含水蜜丸）',
              },
              {
                label:'浓缩丸',
              },
              {
                label:'糊丸',
              },
              {
                label:'蜡丸',
              },
              {
                label:'滴丸',
              },
              {
                label:'糖丸',
              },
              {
                label:'丸剂包衣：目的，种类，材料',
              },
              {
                label:'丸剂质量要求',
              },
            ]
          },{
            label:'片剂',
            children:[
              {
                label:`口服片：普通片（素片、包衣片）、
                咀嚼片、口崩片、分散片、泡腾片
                缓释片、控释片、肠溶片
                `
              },
              {
                label:'口腔用片'
              },
              {
                label:'外用片'
              },
              {
                label:'其他'
              },
              {
                label:'中药片剂：全浸膏片、半浸膏片、全粉末片'
              },
              {
                label:'片剂辅料:填充剂（稀释剂，吸收剂），润湿剂，粘合剂，崩解剂，润滑剂，其他着色，矫味剂',
              }
            ]
          }
        ],
      },
      {
        id: 1,
        label: '浸出制剂 ',
        children: [
          {
            label: '汤剂与合剂',
          },
          {
            label: '糖浆剂与煎膏剂',
           
          },
          {
            label: '酒剂与酊剂',
          },
          {
            label: '流浸膏剂，浸膏剂，茶剂',
          }
        ],
      },
      {
        id: 1,
        label: '液体制剂 ',
        children: [
          {
            label: '真溶液，胶体溶液（高分子溶液，溶胶剂），乳浊液，混悬液',
          },
          {
            label: '附加剂：潜溶剂，助溶剂，增溶剂，防腐剂，其他（矫味剂，着色剂，抗氧剂，ph调节剂，金属离子络合剂）',
           
          },
          {
            label: '表面活性剂：阴离子，阳离子，两性离子，非离子',
            children:[
              {label:'应用：增溶剂，乳化剂，润湿剂，起泡剂，去污剂，消毒剂和抑菌剂'}
            ]
          },
          {
            label: '低分子溶液剂',
            children:[
              {
                label:'溶液剂，芳香水剂，浓芳香水剂，露剂，醑剂，甘油剂，糖浆剂'
              }
            ]
          },
          {
            label: '高分子溶液剂与溶胶剂',
          },
          {
            label: '乳浊剂/乳剂',
          },
          {
            label: '混悬剂',
          },
        ],
      },
      {
        id: 1,
        label: '无菌制剂 ',
        children: [
          {
            label: '大小容量注射剂',
          },
          {
            label: '眼用制剂（滴眼液，眼膏剂）',
           
          },
          {
            label: '局部外用无菌制剂',
          },
          {
            label: '用于手术时使用的无菌制剂',
          },
          {
            label: '热源',
          },
          {
            label: '注射剂的溶剂与附加剂',
          },
          {
            label: '注射用中药原料',
          },
          {
            label: '影响中药注射剂质量的因素',
          },
          {
            label: '输液剂',
          },
          {
            label: '眼用制剂',
          },
        ],
      },
      {
        id: 1,
        label: '外用制剂 ',
        children: [
          {
            label: '特点，分类',
            children:[
              {
                label:'软膏剂，乳膏剂，贴膏剂，贴剂，膏药'
              }
            ]
          },
        ],
      },
      {
        id: 1,
        label: '其他制剂',
        children: [
          {
            label: '栓剂',
          },
          {
            label: '气雾剂和喷雾剂',
           
          },
          {
            label: '胶剂',
          },
          {
            label: '膜剂',
          },
          {
            label: '其他传统制剂',
          },
        ],
      },
    ],
  },
  {
    id:2,
    label:'新剂型新技术',
  },
  {
    id:2,
    label:'中药体内过程',
  },
  {
    id:2,
    label:'中药制剂的稳定性',
  },

]
const jianding = jianding1.map(item => {
  item.children = item.children.map((c,index) => ({...c,label:`${index+1}.${c.label}`}))
  return item
})
export { tiqv, lihuaxingzhi, yaohuafenlun,jianding,zhiji }
