const tiqv = [
  {
    id: 1,
    label: '1. 执业药师与中药药学服务',
    children: [
      {
        id: 1-1,
        label: '中药药学服务及其模式',
        children:[
          {
            id: 1-1-1,
            label: '服务内容',
          },
          {
            id: 1-1-2,
            label: '对药师要求',
          },
        ]
      },
      {
        id: 1-2,
        label: '中药用药咨询以及文献',
        children:[
          {
            id: 1-2-1,
            label: '医学典籍',
            children:[
              {
                id: 1-2-1-1,
                label: '黄帝内经',
              },
              {
                id: 1-2-1-2,
                label: '伤寒论',
              },
              {
                id: 1-2-1-3,
                label: '金贵要略',
              },
              {
                id: 1-2-1-3,
                label: '巢氏诸病源候论',
              },
              {
                id: 1-2-1-3,
                label: '瘟疫论',
              },
            ]
          },
          {
            id: 1-2-2,
            label: '本草典籍',
            children:[
              {
                id: 1-2-1-1,
                label: '神农本草经',
              },
              {
                id: 1-2-1-2,
                label: '本草经集注',
              },
              {
                id: 1-2-1-3,
                label: '新修本草',
              },
              {
                id: 1-2-1-3,
                label: '重修政和经史证类备用本草',
              },
              {
                id: 1-2-1-3,
                label: '本草纲目',
              },
            ]
          },
          {
            id: 1-2-2,
            label: '方书典籍',
            children:[
              {
                id: 1-2-1-1,
                label: '肘后备急方',
              },
              {
                id: 1-2-1-2,
                label: '备急千金药方',
              },
              {
                id: 1-2-1-3,
                label: '千金翼方',
              },
              {
                id: 1-2-1-3,
                label: '外台秘要',
              },
              {
                id: 1-2-1-3,
                label: '太平圣惠方',
              },
              {
                id: 1-2-1-3,
                label: '太平惠民和剂局方',
              },
              {
                id: 1-2-1-3,
                label: '普济方',
              },
            ]
          },
          {
            id: 1-2-2,
            label: '炮制典籍',
            children:[
              {
                id: 1-2-1-1,
                label: '雷公炮炙论',
              },
              {
                id: 1-2-1-2,
                label: '炮制大法',
              },
              {
                id: 1-2-1-3,
                label: '修事指南',
              },
            ]
          },
        ]
      },
      {
        id: 1-3,
        label: '用药咨询与用药教育服务',
        children:[
          {
            label: '咨询服务的对象和内容（医生，护士，患者）',
          },
          {
            label: '服药时间',
          },
          {
            label: '特殊提醒的用药人群',
          },
          {
            label: '特殊提醒情景和注意问题',
          },
        ]
      },
      
    ],
  },
  {
    id: 2,
    label: '2. 中医理论基础',
    children:[
      {
        label: '基本特点',
        children:[
          {lable:'症、证(某一阶段病机（部位，原因，性质，邪正关系）)、病的界定'}
        ]
      },
      {
        label: '阴阳学说',
        children:[
          {label:'阴阳的概念、阴阳相互关系的界定、阴阳学说在疾病治疗中确定的治疗原则'}
        ]
      },
      {
        label: '五行学说',
        children:[
          {label:'分类'},
          {label:'生克乘（克太过）侮（反克）'},
        ]
      },
      {
        label: '藏象',
        children:[
          {label:'五脏',
        children:[
          {label:'心：主血脉，主神明'},
          {label:'肺：主气，司呼吸；主宣发肃降；主通调水道；肺朝百脉，主治节'},
          {label:'脾：主运化，主统血'},
          {label:'肝：主疏泄，主藏血'},
          {label:'肾：藏精，主生长发育与生殖，主水（水液代谢，生成尿液），主纳气'},
          {
            label:'与血液生成密切相关的脏腑：心、脾、肾'
          },
          {
            label:'与血液运行密切相关的脏腑：心、肺、肝、脾'
          },
          {
            label:'与津液代谢密切相关的脏腑：肺、脾、肾'
          },
        ]},
          {label:'六腑',
        children:[
          {label:'胆：贮藏和排泄胆汁；胆主决断'},
          {label:'胃（太仓）：胃主受纳腐熟；胃主通降'},
          {label:'小肠：小肠主受盛和化物；小肠泌别清浊（小肠主液）'},
          {label:'大肠：大肠主传化糟粕，并吸收部分水液（大肠主津）'},
          {label:'膀胱：贮尿和排尿'},
          {
            label:'三焦（孤府）:主持诸气，总司人体的气机和气化，为元气运行的通路和水液运行的通道'
          },
        ]},

        ]
      },
      {
        label: '气血精液',
        children:[
          {label:'气的分类及生理功能；气功能失调的临床表现'},
          {
            label:'气的分类：元气，宗气，营气，卫气'
          },
          {
            label:'气的生理功能：推动，温煦，防御，固摄，气化，营养'
          },
        ]
      },
      {
        label: '经络：（督脉，任脉，冲脉，带脉）',
      },
      {
        label: '体质',
        children:[
          {label:'体质的概念（偏阳，偏阴，阴阳平和质）及其易感疾病类型（寒热虚实）'}
        ]
      },
      {
        label: '病因',
        children:[
          {label:'六淫邪气、痰饮的致病特点以及七情内伤对脏腑气机的影响'},
          {label:'病因：六淫，疠气，七情内伤，饮食失宜，劳逸失当，痰饮，淤血，结石'},
          {label:'六淫：风，暑，湿，燥，寒，火（局部），热（全身）'},
          {label:'怒，喜，思，悲，恐，惊'},
          {label:'痰饮：阻滞气血运行（瘰疬痰核，梅核气）;影响水液代谢;易于蒙蔽心神（+气；+风火）;致病广泛，变换多端'},
          {label:'淤血：疼痛，肿块，出血'}
        ]
      },
      {
        label: '发病与病机',
        children:[
          {label:'邪正盛衰:虚实变化，虚实错杂（实中夹虚，虚中夹实），虚实转化（由实转虚，因虚致实），虚实真假（真实假虚，真虚假实）'},
          {label:'阴阳失调:阴阳偏盛，阴阳偏衰，阴阳互损，阴阳格拒，阴阳亡失'}
        ]
      },
      {
        label: '治未病与康复',
        children:[
          {label:'未病先防的原则与方法：未病先防，既病防变，愈后防复'}
        ]
      },
    ]
  },
  {
    id: 2,
    label: '3. 中医诊断法',
  },
  {
    id: 2,
    label: '4. 常用医学检查指标以及临床意义',
  },
  {
    id: 2,
    label: '5. 治法与治则',
  },
  {
    id: 2,
    label: '6. 中医内科常见病辨证论治',
  },
  {
    id: 2,
    label: '7. 外科常见病辨证论治',
  },
  {
    id: 2,
    label: '8. 妇科常见病辨证论治',
  },
  {
    id: 2,
    label: '9. 儿科五官科常见病辨证论治',
  },
  {
    id: 2,
    label: '10. 民族医药',
  },
  {
    id: 2,
    label: '11. 中药调剂与贮藏养护',
  },
  {
    id: 2,
    label: '12. 中药合理应用',
  },
  {
    id: 2,
    label: '13. 中药用药安全',
  },
]
const lihuaxingzhi = '性状、挥发性、旋光性、水中溶解性、有机溶剂中溶解性、酸性、碱性、荧光性质、发泡性、溶血性、显色反应、沉淀反应、水解反应、酶解反应、氧化还原反应等'
const yaohuafenlun = [
  {
    title: '生物碱',
    dingyi: '来源于生物界（主要是植物界）的一类含氮有机化合物',
    des: '大多具有复杂的环状结构，氮原子结合在环内（特例：有机胺类生物碱N原子不在环内）',
    fenbu: [
      {
        title: '双子叶(50科120属)：',
        content: '毛茛科（黄连属黄连，乌头属乌头、附子）、防己科（汉防己、北豆根）、罂粟科（罂粟、延胡索）、茄科（曼陀罗属洋金花、颠茄属颠茄、莨菪属莨菪）、马钱科（马钱子）、小檗科（三颗针）、豆科（苦参属苦参、槐属苦豆子）、芸香科吴茱萸属（吴茱萸）等',
      },
      {
        title: '单子叶',
        content: '石蒜科、百合科（贝母属的川贝母、浙贝母）、兰科等'
      },
      {
        title: '裸子植物',
        content: '麻黄科、红豆杉科、三尖杉科和松柏科等'
      },
      {
        title: '低等植物',
        content: '如烟碱存在于蕨类植物中，麦角生物碱存在于菌类植物中'
      },
      {
        title: '其他',
        content: `地衣、苔藓类植物中仅发现少数简单的吲哚类生物碱。
        藻类、水生类植物中未发现生物碱。
        `
      },

    ],
    fenbujiqiao: '宝马别逗罂粟(毛茛科、马钱科、茄科、豆科、罂粟科）,防己终于小破(防己科、吴茱萸属、小檗科',
    kuozhan: `引申知识点——生物碱分布特点（了解）：
    　　（1）在植物体中多数集中分布于某一器官或某一部位（金鸡纳生物碱——树皮；麻黄——髓部；黄柏——树皮；三颗针——根部）；
    　　（2）在不同的植物中含量差别很大；
    　　（3）同科同属的植物常含有相同结构类型生物碱；
    　　（4）生物碱极少和萜类和挥发油共存于一植物中；
    　　（5）绝大多数生物碱以有机酸盐形式存在。
    `,
    
  },
  {
    title:'糖和苷'
  },
  {
    title:'醌类化合物'
  },
  {
    title:'苯丙素类化合物',
    des:'香豆素和木脂素'
  },
  {
    title:'黄酮类化合物'
  },
  {
    title:'萜类和挥发油'
  },
  {
    title:'三萜类与甾体化合物',
    des:`甾体皂苷类
    　　强心苷类
    　　胆汁酸类
    　　蜕皮激素类
    `
  },
  {
    title:'其他化学成分',
    des:'有机酸，鞣质，蛋白质和酶，多糖'
  },
]
const jianding = [
  {
    title:'常用根及根茎类中药',
    children:[
      {
        title:'狗脊'
      },
      {
        title:'绵马贯众'
      },
      {
        title:'细辛',
        buwei:' 根和根茎'
      },
      {
        title:'大黄',
        buwei:' 根和根茎'
      },
      {
        title:'虎杖',
      },
      {
        title:'何首乌',
        buwei:'块根',
      },
      {
        title:'牛膝——四大怀药VS川牛膝',
        buwei:'块根',
      },
      {
        title:'商陆',
      },
      {
        title:'银柴胡',
      },
      {
        title:'太子参—略烫',
      },
      {
        title:'威灵仙——毛茛科',
        buwei:'根及根茎'
      },
      {
        title:'川乌',
        buwei:'乌头母根'
      },
      {
        title:'附子',
        buwei:'乌头子根'
      },
      {
        title:'草乌',
        buwei:'北乌头块根'
      },
      {
        title:'白芍（杭、亳、川）',
        jiagong:'刮粗皮煮透心或沸水煮后除外皮'
      },
      {
        title:'赤芍',
        jiagong:'晒干'
      },
      {
        title:'黄连-毛茛科、二级保护',
        fenlei:'味连，雅连，云连'
      },
      {
        title:'升麻',
      },
      {
        title:'防己-根',
      },
      {
        title:'防己-根',
      },
      {
        title:'北豆根-根茎',
      },
      {
        title:'山豆根-根及根茎',
      },
      {
        title:'延胡索-块茎',
      },
      {
        title:'板蓝根-十字花科',
      },
      {
        title:'南板蓝根-爵床科',
      },
      {
        title:'地榆-蔷薇科',
      },
      {
        title:'苦参-干燥根',
      },
      {
        title:'葛根',
      },
      {
        title:'粉葛',
      },
      {
        title:'甘草-根及根茎',
      },
      {
        title:'黄芪',
      },
      {
        title:'远志——三级保护',
      },
      {
        title:'人参——二级保护',
      },
      {
        title:'红参',
      },
      {
        title:'西洋参',
      },
      {
        title:'三七',
      },
      {
        title:'白芷',
      },
      {
        title:'当归',
      },
      {
        title:'羌活',
      },
      {
        title:'川芎',
      },
      {
        title:'藁本',
      },
      {
        title:'防风——三级保护',
      },
      {
        title:'柴胡VS银柴胡',
      },
      {
        title:'北沙参',
      },
    ]
  }
]
export { tiqv, lihuaxingzhi, yaohuafenlun,jianding }
