<template>
  <div style="text-align: center">
    <router-link to="/bencao-shennong">神农本草</router-link>
    <router-link to="/huangdineijing-suwen">黄帝内经-素问</router-link>
    <router-link to="/jingui">金匮要略</router-link>
    <router-link to="/shanghan">伤寒论</router-link>
    <router-link to="/zhenjiu">针灸</router-link>
    <router-link to="/yao1">执药1</router-link>
    <router-link to="/yao2">执药2</router-link>
    <router-link to="/yaozong">执药综合</router-link>
    <router-link to="/fagui">执药-法规</router-link>
  </div>
  <p>只有你们人类才会考虑“时间”的问题，而其他生命都是考虑“当下”。</p>
  <p>
    智者察同，愚者察异。愚者不足，智者有余。有
    余则耳目聪明，身体轻强，老者复壮，壮者益治。是以圣人为无为之事，乐恬憺之能从欲快志于虚
    无之守，故寿命无穷，与天地终。此圣人之治身 也。
  </p>
  <p>
    歧伯曰，针石道也，精神不进，志意不治，
    敌病不可愈。今精坏神去，荣卫不复收。何者嗜
    欲无穷，而忧患不止，精气弛坏。荥泣卫除，故 神去之而病不愈也。
  </p>
  <p>
    他意识到有一种职业，<b>要用生命去相伴，要用脚步去丈量</b>，他立志以中医为业，接着爷爷的路继续走下去。
  </p>
  <p>
    他每天早上六点起床，要先跪诵七遍心经，祈求智慧增长，七点准时出门吃早餐，然后在操场一边散步，一边背诵《黄帝内经》、《针灸歌赋》、《药性赋》等歌诀，
    八点到图书馆，里面有一个中医书籍的偏僻角落，几乎无人打扰，他每天便待在这里，午休的时候就垒起两本书当枕头，往书架中间的巷道里一躺。<b>他坚持每周读一本中医古籍</b>，至今已读完数百本。
  </p>
  <p>
    一个单纯追逐自己梦想的人，总能唤起人们的热情相待。杨守真后来结识的许多中医师，对他都非常照顾，颇有几分江湖侠义之风。
  </p>
  <p>
    盛医生常年在全国各地参加学习讲座，但最后发现，别人讲得再好也没用，经典的东西只能靠自己反复研读，否则只能人云亦云。在火车上交谈的时候，他很佩服杨守真年纪轻轻却对《伤寒论》颇有自己的见解，他决定不再参加那些论坛了，他要在延寿禅寺，和杨守真把《伤寒论》390多条条文逐一注解讨论，直到能够相互说服对方为止。
  </p>
  <p>
    在这半年时间里，杨守真每天静心研读经典，上午看《黄帝内经》，下午看《伤寒论》，晚上看医案。盛医生担心他在寺院营养跟不上，常常带他下山吃饭。他们有时爬上东山，远眺富春江和整座富阳城，江南的美景尽收眼底，俩人或是清谈此处的名人雅士，或是从岐黄医道论及天地草木，仿佛两位游览世间的大士，好不悠哉。
  </p>
  <p>
    杨守真说，他不想像许多中医馆那样，把招牌打在闹市区，以一技之长和各种噱头混口饭吃。他在大学的时候就想好了，他想把守真堂打造成一块净土，这里既是他济世救人坚守拙志的医馆，也是他皓首穷经妙悟岐黄的象牙塔，他写下一副对联挂在门前：「承祖业济苍生不务名利守拙志不改，启轩岐穷医理探赜索隐真性情始终。」他每日上午坐诊，下午上山采药或读书研习，自得其乐。
  </p>
  <p>
    哀莫大于心死，爷爷晚年脑溢血发作的时候，也不再用中药调理，他吃下家人为他买的西药，眼神里带着一股倔强，似乎只想早些离开这个世界。可杨守真却清楚地记得，爷爷是如何郑重地将一本本手抄本的医学笔记传给自己，那是他师父留给他的。
  </p>
</template>
<style scoped>
a {
  line-height: 2;
  display: block;
}
p {
  text-align: left;
}
</style>