const menuList = [{
    title: '上古天真论',
    yuanwen: [
      {
        person:'pangbai',
        content: `昔在黄帝，生而神灵，弱而能言，幼而齐，长而敦敏，成而登天。`,
      },
      {
        person:'huangdi',
        content: `乃问于天师曰，余闻上古之人，春秋皆度百岁，而动作不衰。今时之人，年半百而动作皆衰者，时世异耶？人将失之耶？`,
      },
      {
        person:'qibu',
        content:`歧伯对曰，上古之人，其知道者，法于阴阳，和于术数。食饮有节， 起居有常，不妄作劳。故能形与神倶，而尽终其天年，度百岁乃去。今时
        之人，不然也， 以酒为浆， 以妄为常。醉以入房，以欲竭其精，以耗散其眞。不知持满，不时御神。务快其心，逆于生乐，起居无节，故半百而衰也。
        夫上古圣人之教下也，皆谓之虚邪贼风，避之有时。恬淡虚无，眞气从之。精神内守，病安从来。
        是以志闲而少欲，心安而不惧，形劳而不倦。气从以顺，各从其欲，皆得所愿。故美其食，
        任其服，乐其俗，高下不相慕，其民故曰朴。是以嗜欲不能劳其目，淫邪不能惑其心。
        愚智贤不肖，不惧于物，故合于道。所以能年皆度百岁，而动作不衰者，以其德全不危也。`
      },
      {
        person:'huangdi',
        content:`帝曰，人年老而无子者，材力尽邪？将天数然也？`
      },
      {
        person:'qibo',
        content:`歧伯曰，女子七岁，肾气盛，齿更发长。二七而天癸至，任脉通，太冲脉盛，月事以时下，故有子。三七肾气平均，故眞牙生而长极。四七
        筋骨坚，发长极，身体盛壮。五七阳明脉衰，面始焦，发始堕。六七三阳脉衰于上，面皆焦，发始白。
        七七任脉虚，太冲脉衰少，天癸竭，地道不通，
        故形坏而无子也。丈夫八岁肾气实，发长齿更。二八肾气盛，天癸至，精气溢写，阴阳和，故能有子。三八肾气平均，
        筋骨劲强，故眞牙生而长极。四八筋骨隆盛，肌肉满壮。五八肾气衰，发堕齿槁。
        六八阳气衰竭于上，面焦发髸颁白。七八肝气衰，筋不能动，天癸竭，精少，肾藏衰，
        形体皆极。八八则齿发去。肾者主水，受五藏六府之精而藏之，故五藏盛乃能写。
        今五藏皆衰， 筋骨解堕，天癸尽矣。故发鬓白，身体重，行步不正而无子耳。`
      },
      {
        person:'huangdi',
        content:'帝曰，有其年已老而有子者，何也？'
      },
      {
        person:'qibo',
        content:`歧伯曰，此其天数过度，气脉常通，而肾气有余也。此虽有子，男不过尽八八，女不过尽七七，而天地之精气皆竭矣。`
      },
      {
        person:`huangdi`,
        content:`帝曰，夫道者，年皆百数，能有子乎？`
      },
      {
        person:`qibo`,
        content:`歧伯曰，夫道者，能却老而全角，身年虽寿能生子也。`
      },
      {
        person:`huangdi`,
        content:`黄帝曰，余闻上古真人者，提挈天地，把握阴阳，呼吸精气，独立守神，肌肉若一，故能寿敝天地，无有终时，此其道生。
        中古之时，有至人者，淳德全道，和于阴阳，调于四时。去世离
        俗，积精全神。游行天地之间，视听八达之外。此盖益其寿命而强者也，亦归于眞人。其次有圣
        人者，处天地之和，从八风之理。适嗜欲于世俗之间，无恚嗔之心。行不欲离于世，被服章。举不欲观于俗，
        外不劳形于事。内无思想之患。 以恬愉为务， 以自得为功。形体不敝，精神不散，亦可以百数。其次有贤人者，法则天地，象似日
        月，辨列星辰，逆从阴阳，分别四时。将从上古，合同于道，亦可使益寿而有极时。`
      },
    ]
  },
  {
    title: '四气调神大论篇',
    yuanwen: [
      {
        person: 'pangbai',
        content:`春三月，此谓发陈，天地倶生，万物以荣。夜卧早起，广步于庭。被发缓形，
        以使志生，生而勿杀，予而勿夺，赏而勿罚。此春气之应，养生之道也。
        逆之则伤肝。夏为寒变，奉长者少。
        夏三月，此谓蕃秀。天地气交，万物华实。夜卧早起，无厌于日，
        使志无怒，使华英成秀，使气得泄，若所爱在外。此夏气之应，养长之道也。逆之则伤心，秋为痎疟，奉收者少，冬至重病。`
      },
      {
        person: 'pangbai',
        content:`秋三月，此谓容平。天气以急，地气以明。早卧早起，与鸡俱兴。使志安宁，以缓秋刑。
        收敛神气，使秋气平。无外其志，使肺气清。此秋气之应，养收之道也。
        逆之则伤肺，冬为飧泄，奉藏者少。冬三月，此谓闭藏。水冰地坼，
        无扰乎阳。早卧晚起，必待日光。使志若伏若匿，若有私意，若已有得。去寒就温，
        无泄皮肤，使气亟夺。此冬气之应，养藏之遒也。逆之则伤肾，春为痿厥，奉生者少。`
      },
      {
        person: 'pangbai',
        content:`天气清净，光明者也。藏德不止，故不下也。天明则日月不明，邪害空窍。阳气者闭塞，地气
        者冒明。云雾不精，则上应白露不下。交通不表万物命故不施，不施则名木多死。恶气不发，风雨不节，
        白露不下，则菀槁不荥，贼风数至，暴雨数起，天地四时不相保，与道相失，则未央绝灭。
        唯圣人从之，故身无奇病。万物不失，生气不竭。逆春气则少阳不生，肝气内变。逆夏气则太阳不长，
        心气内洞。逆秋气则太阴不收，肺气焦满。逆冬气则少阴不藏，肾气独沈。夫四时阴
        阳者，万物之根本也。所以圣人，春夏养阳，秋冬养阴，以从其根。
        故与万物沈浮于生长之门。逆其根则伐其本，坏其眞矣。故阴阳四时者，万物之终始也，死生之本也。逆之则灾害生，从之
        则苛疾不起，是谓得道。道者圣人行之，愚者佩之。从阴阳则生，逆之则死。从之则治，逆之则乱。
        反顺为逆，是谓内格。是故圣人不治已病，治未病。不治已乱，治未乱，此之谓也。夫病已成而后药之，
        乱已成而后治之，譬犹渴而穿井，斗而铸锥，不亦晚乎。`
      },
    ]
  },
  {
    title: '生气通天论篇',
    submenu: [{
        title: '玉石类',
        danweiyao:[
          {
            ming:'丹砂',
            xingweiguijing:'性味甘（阴），微寒（阳）无毒',
            gongneng:'安神要药',
            tedian:'有阳中之阴药称，与人参南北称王',
            jinji:'多服丹砂因其性质重坠，使人神定目呆',
            paozhi:'丹砂沉底，所以有毒，但是生用无毒，丹砂只可生研水飞用，火炼则为水银而有毒，不可用',
            changyong:1,
            chandi:`在我国四川湖南等山中。以辰州为最佳，故又号辰砂，属石类。（原
            产地所产的形状象箭簇。）`
          },{
            ming:'云母',
            xingweiguijing:'味甘平,无毒',
            gongneng:'云母主补肺下气（白色质重下沉），补中坚肌，除邪气，安精神',
            tedian:`生产不下（难产）。金石类的药，重症能用，因为石头类的东西下沉的力量比较强。如五石乌头
            丸（千金要方）。重症，如癌细胞、肿瘤扩散，用金石类的药来攻坚，是最后一
            种选择。金石类的药因为质比较重，都可以安五脏，定心定神`,
            jinji:'古称云母治百病，服食无忌，但制炼须慎，不可过量服食',
            paozhi:'煅粉',
            chandi:`产四川及各省山中，种类甚多，有黑云母及白云母等，白者良，属
            玉类。是大理石的一种，属于玉，比较偏近于石头。`
          },
          {
            ming:'玉泉',
            xingweiguijing:'味甘平,无毒',
            gongneng:'清热解渴，安神养肌',
            tedian:`玉是阳精的纯的，玉敲起来越清脆越好，有金属的声音“嘡”的
            声音是纯的玉.面身癜痕，真玉日日磨之则自灭`,
            jinji:'不可用已经做成玉器之物必伤人也，璞玉乃可用也',
            paozhi:'煅粉',
            chandi:`玉乃石之美者，产山中，西南深山中多有之，以钟山蓝田产者最良，
            于阗国之白玉最好。`
          },
          {
            ming:'石钟乳',
            xingweiguijing:'味甘性温，无毒',
            gongneng:'为补阳益精要药，主治肺气虚损.咳逆上气，明目利窍，补髓疗弱，消渴引饮',
            tedian:`入肺降逆，利窍下乳`,
            jinji:'石药性悍，不宜久服',
            paozhi:'煅粉',
            chandi:`中国日本俱有出产，生于山中石洞穴中，我国以广西陕西等省多此
            洞`
          },
          {
            ming:'涅石（矾石-明矾/枯矾）',
            xingweiguijing:'味酸性寒无毒',
            gongneng:`为收湿解毒止血要药，功能除湿化痰，追涎（浓痰）坠浊，主明目
            坚齿，除风杀虫，蚀恶肉，生好肉，治蛇虫咬伤`,
            tedian:`枯矾可与麝香合用（麝香矾石散，麝香与枯矾 1:50）麝香无孔不
            入，配合之则可去脑鼻之间的风寒与瘀伤。`,
            jinji:'石药性悍，不宜久服',
            paozhi:'白矾研粉，枯矾煅至全部泡松呈白色蜂巢状，放凉研粉',
            changyong:1,
            fangji:'麝香矾石散',
            chandi:`产四川陕甘，我国南省诸山亦多有之，色白净者为明矾`
          },
          {
            ming:'消石（硝石）',
            xingweiguijing:'味苦性寒，无毒',
            gongneng:'硝石主清积热利小便，治五淋',
            tedian:'含咽治喉痹（不能吞东西）、硝石矾石散治疗黑疸',
            jinji:'忌火',
            chandi:`】产于东印度埃及等热带地方及我国西北。投入火中则爆鸣，立即燃
            烧而发鲜明之焰。`,
            paozhi:'拣去杂质即可，不能炮制。最好用竹筷子，不要用金属的东西捡',
            fangji:'硝石矾石散 治疗黑疸'
          },
          {
            ming:'朴肖（芒硝）',
            xingweiguijing:'味咸辛苦，性寒无毒',
            gongneng:'主软坚化积，逐六腑积聚结固留癖。清热泻下，外用消食化积;治腹胀，大小便不通，女子月经不通',
            tedian:'微咸之味者，皆能引火下行。大咸者能助火升发也(硝石)',
            jinji:'辛香走窜，不宜多用。大便没有了就把芒硝停掉',
            paozhi:'拣去杂质即可。芒硝煮了就没有力量，冲服',
            changyong:1,
            chandi:`生于盐卤之地，凡煎炼水硝，结出细芒者为芒硝，结出马牙状者为
            马牙硝，其凝于底成块者，通为朴硝`
          },
          {
            ming:'滑石',
            xingweiguijing:'味甘性寒无毒',
            gongneng:'为去湿热利小便要药，主通六府九窍津液。上开肌理下通膀胱，治淋疾，水肿，黄疸。',
            tedian:'为去暑之要药，去暑只宜清气利湿（清热利湿），不可用燥药，如黄连亦然，甘草也可',
            jinji:'由于阴虚火热水涸者，均忌，脾胃俱虚者虽不做泄亦忌，因其性滑也',
            paozhi:'拣去杂质，洗净，研细粉即可',
            changyong:1,
            chandi:`产山东及西南诸省山中。色青白或黄白及银灰色`
          },
          {
            ming:'胆石（胆矾）',
            xingweiguijing:'味酸辛，性寒，有小毒;神农酸小寒，扁鹊苦无毒，',
            gongneng:'胆矾为腐蚀催吐要药，功能蚀恶疮散症积（整个恶疮不能收口），涌吐风痰，治咽喉口鼻疮毒及目患。',
            tedian:'石胆、空青、曾青均产自铜坑。石胆是蓝色的，很透；空青是青蓝色的;石胆除了内服以外还可以外敷',
            jinji:'胃弱人不宜多服',
            paozhi:'拣去杂质;真正的胆矾，跟铁一磨，就会出现铜的颜色',
            chandi:`产山中，为蓝色结晶`
          },
          {
            ming:'空青',
            xingweiguijing:'味甘酸，性寒，无毒',
            gongneng:`为一切眼目要药，主治目赤目痛，青盲耳聋，利九窍通血脉，养神
            益肝`,
            tedian:`取其象，青色的石头是空的，可以看到里面有水，像眼眶里的水一样，把水
            取出来点眼睛，非常好。空青治疗青盲、夜盲。但是现在很少见`,
            jinji:'勿过量使用。一日点二次即止',
            paozhi:'拣去杂质',
            chandi:`产河南山西陕西山中，色青质轻，近罕见。今名丹青。`
          },
          {
            ming:'曾青',
            xingweiguijing:'味酸小寒无毒',
            gongneng:`主目痛止泪出，风痹利关节，通九窍，破症瘕积聚,杀白虫，
            久服轻身不老，能化金铜`,
            tedian:`曾青跟空青都产于铜坑中，和空青类似，只是颜色有一点差异。空青里面有
            水，曾青里面没有水`,
            jinji:'',
            paozhi:'拣去杂质'
          },
          {
            ming:'禹余粮（禹粮石）',
            xingweiguijing:'味甘寒，无毒',
            gongneng:`固补下焦要药（下焦虚都可以用，还可以固精，治疗精往外散），
            主治滑泄下血（大肠炎），血闭血虚，四肢虚而不仁，崩露赤白`,
            tedian:`山岛或是池泽，乃石中黄粉;石头很软，黄的像泥土一样;此药多使用于下脓血利不止，常与赤石脂同用`,
            jinji:'重可去怯，故为镇纳固补之剂。下焦有实热者忌，虚者良',
            paozhi:'拣去杂质,醋煅研粉',
            changyong:1,
            chandi:`产于山岛或是池泽，乃石中黄粉`
          },
          {
            ming:'太一余粮',
            xingweiguijing:'味甘平',
            gongneng:`主治咳逆上气（质重的药，如金石药都可以把气往下
            压），症瘕血闭，漏下除邪气，久服耐寒暑不饥，轻身飞行千里神仙`,
            tedian:`生泰山上，石如甲，甲中有白，白中有黄如鸡子黄色，又名太乙余粮，与禹余粮同，唯质较
            佳者`,
            paozhi:''
          },
          {
            ming:'白石英',
            xingweiguijing:'味甘微温无毒',
            gongneng:`肺大肠枯燥（金石类的东西都有滋润的功能），疗肺痰肺痈消渴`,
            tedian:`喉癌：喉咙打不开，可以用生半夏（半夏苦酒汤），如果打不开是
            喉癌（整个舌头喉咙堵住），要用硝石。（巴豆也可以开，但主攻是攻肠胃方面。）`,
            paozhi:'',
            jinji:'不可久服，寇氏曰紫白二石英攻疾可暂煮汁，未闻久服之益',
            chandi:'产深山中'
          },
          {
            ming:'紫石英',
            xingweiguijing:'味甘辛，性温无毒',
            gongneng:`主镇怯润枯，养心益肝，治女子风寒在子宫不孕`,
            tedian:`只要是有虚症的时候都可以用金石类的药来补。紫石英是温药，实热不能用，
            里面虚寒才会用；阳药`,
            paozhi:'拣去杂质,醋淬研粉（补了要收）',
            jinji:'紫石英是温药，实热不能用，里面虚寒才会用。凡绝孕由阴虚火旺，不能摄受精气者忌用',
            chandi:'产深山中'
          },
          {
            ming:'赤石脂',
            xingweiguijing:'性味酸辛，性大温无毒',
            gongneng:'为固肠收敛要药，主治赤白久痢，赤白带下，厚肠胃，除水湿，收脱肛',
            tedian:`辛甘生大热，辛甘发散为阳嘛，加一点酸味收敛，又是补阳又是收敛;赤石脂本身是红色，药性本身的温度比较高，当然不像附子、硫磺那么大热。赤石脂和禹余粮两味药可以和在一起使用治疗大肠炎（下痢出血），一剂下
            去就收掉了`,
            jinji:`凡火热暴注者不宜用，滞下全是湿热，于法当利，自非的受寒邪，
            下利白积者不宜用，崩中法当补阴清热，带下本属湿热积滞，法当去湿除积，止
            涩非宜(寒痢，水痢不适用)`,
            paozhi:'拣去杂质,醋淬研粉',
            changyong:1,
            chandi:'产山西山东河南．他省亦多'
          },
          {
            ming:'白青',
            xingweiguijing:'味甘平',
            gongneng:'主明目利九窍，耳聋心下邪气令人吐，杀诸毒三虫。久服通神明，轻身延年不老',
            tedian:`白青现在已经绝迹，很少用了。金石类的药，如空青、白青、曾青，都是产
            在铜坑里面`,
            jinji:``,
            paozhi:'',
          },
          {
            ming:'扁青',
            xingweiguijing:'味甘平;神农雷公小寒无毒',
            gongneng:'主目痛明目，折跌痈肿，金创不疗，破积聚解毒气，利精神，久服轻身不老;治丈夫内绝令人有子。去寒热风痹，及丈夫茎中百病益精',
            tedian:`最常用的眼科的药都是曾青，空青，扁青，白青，金石类的药很多，草木类
            的有贝母，贝母都可以泡水`,
            jinji:``,
            paozhi:`金石类的药炮制提炼过以后，打碎磨细，放入
            水中，沉底的不要，溶化在水里面的可以作眼科的药来涂，曾青、白青、扁青都
            可以，可以止眼睛痛痒，用炉甘石也可以`,
          }
        ]
      },
      {
        title: '草药类',
        danweiyao:[
          {
            ming:'菖蒲',
            xingweiguijing:'味辛性温无毒',
            gongneng:`菖蒲为宣窍泄热，健胃行滞要药，主开心孔通九窍，明耳目出声音，
            治咳嗽上逆，霍乱转筋，健脾胃杀诸虫，疗噤口痢；四肢湿癣不得曲伸，小儿温疟，身积热不解，可作浴汤`,
            tedian:`菖蒲常常和辛夷花并用，菖蒲质比较重，辛夷花很轻，一般来说辛
            夷花剂量会比较少。菖蒲最主要的功能是开心孔补五脏通九窍，明耳目，在治疗心脏病的时候常
            常用到菖蒲；我国四川，今处处有之，多生水滨，可供盆栽；根入药，一寸九节者良；菖蒲南人多常用置食水中，或加矾（明矾）少许，解一切毒`,
            jinji:`忌饴糖羊肉铁器`,
            paozhi:`拣去杂质，刷去灰尘`,
            fangji:`有菖蒲丸（石菖蒲人参丹参天冬麦冬赤石脂）治小儿心气不足，不能言语。又醋糊丸棉裹置耳中，治耳内卒痛，聋闭不闻
            菖蒲益智丸（菖蒲远志人参枯梗牛膝附子伏签桂心），治健忘恍惚，破积聚止痛，
            安心定神聪明耳目均效`,
            fangji:`鼻窦炎：菖蒲 3 钱、辛夷 2 钱、苍术 3 钱，只去鼻窦炎里面堵到的东西，
            不管寒热。寒热辨证：浓鼻涕是热，流清涕是寒，寒热在肺里面，因为肺开窍于
            鼻，加干姜可以去肺的寒，加杏仁、麦门冬等可以去肺热。`,
            changyong:1
          },
          {
            ming:'菊花',
            xingweiguijing:'味苦甘平无毒',
            gongneng:`为清风热明目解毒要药，主诸风头眩肿痛，目痛翳膜，利血脉，治
            疗疮`,
            tedian:`风是指外感，没有什么其他问题就是头痛，一般是风寒吹到，都可以用菊;近世用为平肝良药，头痛目疼多因肝经风热上乘所致，菊花入肝，
            兼行周身，血脉不利而死肌，得菊花之利血脉皆效，特长于解毒，外科方剂用之
            治疗毒发背者。沈金鳌曰菊花并茎叶打汁饮，外涂内服皆可。时医用之因防邪热
            过久而酝酿化毒；平淡多奇功。`,
            jinji:`味苦辣者，陈久者，不堪用，其甘者亦名甘菊，可饮可食亦入药`,
            paozhi:`拣去杂质及梗叶，拍去灰尘即得`,
            qita:`菊叶解毒之功胜于花，以鲜者良，捣汁敷一切肿毒（脓疮和伤
            口皆可），亦可内服`,
            fangji:``,
            changyong:1
          },{
            ming:'人参',
            xingweiguijing:'味甘微苦性微寒无毒',
            gongneng:`为大补元气要药，功能治一切衰弱痨瘵，通行周身补五脏之气，泻
            五脏之火，效益多但功缓，红色曰高丽参，性温而力较峻`,
            tedian:`真正的高丽红参很干很硬，用烤炉烤一下就软掉了，切片的时候味道很呛鼻，
            里面的确是暗红色的;采收时，人参不用金属的刀去，因为金克木，怕味道跑掉都用竹刀。
            晒干了以后可以用钢刀切。`,
            jinji:`肺家有热诸症及阴虚火动之候与痘疹之初发，身虽热而斑点未形，
            与伤寒始作，形症未定而邪热炽均忌，反葵芦；人参不能常吃，如果每天吃人参，等到真的需要人参的时候，石沉大海，起
            不到疗效`,
            paozhi:`用湿布包裹，焖润用火烤，再晾干或烘干即可得`,
            qita:`a 独参汤：用于救逆的时候，单味一味人参去熬浓汤喝，补气。b 考试时可以口含人参切片含在，能够生津止渴、提神 c 如果人参一吃下去就上火、口腔溃疡、口干舌燥，是因为他肺里有热，人
            参不适合，这个时候可以吃天门冬把肺热去掉`,
            fangji:``,
            changyong:1
          }
        ]
      },
      {
        title: '木头类',
      },
      {
        title: '人体类',
      },
      {
        title: '走兽类',
      },
      {
        title: '家禽类',
      },
      {
        title: '鱼虫类',
      },
      {
        title: '果实类',
      },
      {
        title: '米谷类',
      },
      {
        title: '菜类',
      },
    ]
  },
  {
    title: '金匮真言论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '阴阳应象大论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '阴阳离合篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '阴阳别论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '灵兰秘典论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '六节藏象论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '五脏生成篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '五脏别论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '异法方宜论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '移精变气论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '汤液醪醴论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '玉版论要篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '诊要经终论',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '脉要精微论',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '平人气象论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '玉机真脏论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '三部九侯论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '经脉别论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '藏气法时论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '宣明五气篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '血气形志篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '宝命全角论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '八正神明论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '离合真邪论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '通评虚实论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '太阴阳明论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '阳明脉解篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '热论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '刺热篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '评热病论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '逆调论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '疟论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '刺疟篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '气厥论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '咳论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '举痛论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '腹中论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '刺腰痛篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '风论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '痹论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '痿论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '厥论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '病能论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '奇病论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '大奇论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '脉解篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '刺要论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '刺齐论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '刺禁论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '刺志论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '针解篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '长刺节论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '皮部论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '经络论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '气穴论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '气府论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '骨空论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '水热穴论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '调经论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '缪刺论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '四时刺逆从论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '标本病传论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '天元纪大论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '五运行大论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '六微旨大论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '气交变大论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '五常政大论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '六元正纪大论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '刺法论篇第七十二（遗篇）',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '本病论篇第七十三（遗篇)',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '至真要大论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '着至教论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '示从容论',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '疏五过论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '征四失论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '阴阳类论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '方盛衰论篇',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '解精微论篇',
    submenu: [{
      title: ''
    }]
  },
]


export {
  menuList,
}