const tiqv = [
  {
    id: 1,
    label: '1. 执业药师与健康中国战略10',
    children: [
      {
        label: '健康中国战略和国家基本医疗卫生政策',
        children: [
          {
            label: '健康中国战略',
          },
          {
            label: '基本医疗卫生制度与健康促进',
          },
          {
            label: '深化医药卫生体制改革',
          },
        ]
      },
      {
        label: '医疗保障和药品供应保障制度',
        children: [
          {
            label: '医疗保障制度',
          },
          {
            label: '药品供应保障制度',
            children: [
              {
                label: '药品研制政策与改革措施',
              },
              {
                label: '药品生产政策与改革措施',
              },
              {
                label: '药品流通政策与改革措施',
              },
              {
                label: '药品使用政策与改革措施',
              },
            ]
          },
        ]
      },
      {
        label: '药品安全和相关管理制度',
        children: [
          {
            label: '药品的界定和特点',
          },
          {
            label: '药品安全与风险管理',
          },
          {
            label: '药品追溯制度',
          },
          {
            label: '药物警戒制度',
          },
        ]
      },
      {
        label: '执业药师管理',
        children: [
          { label: '执业药师职业资格制度' },
          { label: '执业药师职业资格考试、注册和继续教育管理 ' },
          { label: '执业药师的配备使用 ' },
          { label: '执业药师职业活动的监督管理 ' },
        ]
      }
    ],
  },
  {
    id: 2,
    label: '2. 药品管理立法与药品监督管理-12',
    children: [
      {
        label: '药品管理立法',
        children: [
          { label: '法的渊源、分类，效力' },
          { label: '药品管理法律体系' },
        ]
      },
      {
        label: '药品监督管理行政行为',
        children: [
          { label: '行政许可' },
          { label: '行政强制' },
          { label: '行政处罚' },
          { label: '行政复议' },
          { label: '行政诉讼' },
        ]
      },
      {
        label: '国家药品监督管理机构',
        children: [
          { label: '药品监督管理部门' },
          { label: '药品管理工作相关部门' },
          { label: '药品监督管理专业技术机构' },
        ]
      },
      {
        label: '4. 药品监督管理',
        children: [
          {
            label: '1.药品标准与国家药品标准',
          },
          {
            label: '2.药品质量监督检验',
          },
          {
            label: '3.药品监督检查',
          },
        ]
      },
    ]
  },
  {
    id: 2,
    label: '3. 药品研制和生产管理-12',
    children: [
      {
        label: '药品研制与注册管理',
        children: [
          {
            label: '药品研制过程与质量管理规范'
          },
          {
            label: '药品注册管理制度',
          },
          {
            label: '药品上市注册',
          },
          {
            label: '仿制药注册要求和一致性评价',
          },
          {
            label: '药品上市后研究和再注册',
          },
        ]
      },
      {
        label: '药品上市许可持有人制度',
        children: [
          { label: '药品上市许可持有人的界定' },
          { label: '药品上市许可持有人的义务' },
          { label: '药品上市许可持有人的权利' },
        ]
      },
      {
        label: '3.药品生产管理',
        children: [
          {
            label: '药品生产许可',
            children: [
              { label: '从事药品生产应具备的条件' },
              { label: '药品生产许可的申请和审批' },
              { label: '药品生产许可证管理' },
              { label: '药品委托生产管理' },
            ]
          },
          {
            label: '药品生产质量管理与要求',
            children: [
              { label: '（GMP）药品生产质量管理规范主要内容' },
              { label: '药品放行和药品追溯要求' },
              { label: '短缺药品报告制度' },
            ]
          },
        ]
      },
      {
        label: '药品召回管理',
        children: [
          { label: '药品召回和药品安全隐患的界定' },
          { label: '药品召回分类与分级' },
          { label: '药品生产、经营企业和使用单位有关药品召回的义务' },
          { label: '主动召回和责令召回的实施和要求' },
        ]
      }
    ]

  },
  {
    id: 2,
    label: '4. 药品经营管理-20',
    children: [
      {
        label: '药品经营许可与行为管理',
        children: [
          { label: '药品经营许可和行为管理' },
          { label: '药品经营质量管理规范' },
          { label: '药品经营行为管理' },
          { label: '网络药品经营管理' },
        ]
      },
      {
        label: '药品进出口管理',
        children: [
          { label: '药品进出口的基本情况' },
          { label: '药品进口管理' },
          { label: '药品出口管理' },
        ]
      },
      {
        label: '处方药与非处方药分类管理',
        children: [
          { label: '药品分类管理的规定' },
          { label: '非处方药注册和转换制度' },
          { label: '处方药与非处方药的经营管理' },
        ]
      },
    ]
  },
  {
    id: 2,
    label: '5. 医疗机构药事管理-10',
    children: [
      {
        label: '医疗机构药事管理和药学工作',
        children: [
          { label: '医疗机构药事管理相关概念' },
          { label: '医疗机构药事管理机构和职责' },
          { label: '医疗机构药学部门的设置条件与职责' },
        ]
      },
      {
        label: '医疗机构药品配备、购进、储存管理',
        children: [
          {
            label: '医疗机构药品配备和采购管理',
          },
          {
            label: '医疗机构药品库存管理',
          },
        ]
      },
      {
        label: '处方与调配管理',
        children: [
          {
            label: '处方和处方开具',
          },
          {
            label: '处方的调剂与审核',
          },
        ]
      },
      {
        label: '医疗机构制剂管理',
        children: [
          {
            label: '医疗机构配制制剂许可管理',
          },
          {
            label: '医疗机构制剂注册管理',
          },
        ]
      },
      {
        label: '药品临床应用管理',
        children: [
          {
            label: '临床用药管理',
          },
          {
            label: '抗菌药物使用管理',
          },
          {
            label: '重点监控合理用药药品管理',
          },
        ]
      },
    ]
  },
  {
    id: 2,
    label: '6. 中药管理-10',
    children: [
      {
        label: '中药材管理',
        children: [
          {
            label: '1. 中药材的生产、经营和使用规定',
          },
          {
            label: '2. 中药材专业市场管理',
          },
          { label: '3. 进口药材规定' },
          { label: '4. 野生药材资源保护' },
        ]
      },
      {
        label: '中药饮片管理',
        children: [
          { label: '生产、经营管理' },
          { label: '医疗机构中药饮片的管理' },
        ]
      },
      {
        label: '中成药与医疗机构中药制剂管理',
        children: [
          { label: '中成药通用名称命名' },
          { label: '中药品种保护' },
          { label: '中药注射剂管理' },
          { label: '古代经典名方中药复方制剂的管理' },
          { label: '医院中药制剂管理' },
        ]
      },
    ]
  },
  {
    id: 2,
    label: '7. 特殊管理规定的药品管理-15',
    children: [
      {
        label: '疫苗管理',
        children: [
          { label: '疫苗研制与生产管理' },
          { label: '疫苗上市后管理' },
        ]
      },
      {
        label: '血液制品管理',
        children: [
          { label: '血液制品生产、经营管理' }
        ]
      },
      {
        label: '麻醉药品、精神药品的管理',
        children: [
          { label: '麻醉药品和精神药品管理部门和目录管理' },
          { label: '麻醉药品和精神药品生产' },
          { label: '麻醉药品和精神药品经营' },
          { label: '麻醉药品和精神药品使用' },
          { label: '麻醉药品和精神药品储存与运输' },
        ]
      },
      {
        label: '医疗用毒性药品管理',
        children: [
          { label: '医疗用毒性药品的品种管理' },
          { label: '生产、经营管理' },
          { label: '使用管理' },
        ]
      },
      {
        label: '药品类易制毒化学品的管理',
        children: [
          { label: '药品类易制毒化学品的管理部门与品种' },
          { label: '药品类易制毒化学品管理生产、购销和安全管理' },
        ]
      },
      {
        label: '含特殊药品复方制剂的管理',
        children: [
          { label: '含麻醉药品、精神药品复方制剂的管理' },
          { label: '含麻黄碱类复方制剂的管理' },
        ]
      },
      {
        label: '兴奋剂的管理',
        children: [
          { label: '兴奋剂的界定' },
          { label: '兴奋剂目录和分类' },
          { label: '含兴奋剂药品标签和说明书管理' },
          { label: '蛋白同化制剂、肽类激素的销售及使用管理' },
        ]
      },
    ]
  },
  {
    id: 2,
    label: '8. 药品信息、广告、价格管理及消费者权益保护-12',
    children: [
      {
        label: '药品安全信息与品种档案管理',
        children: [
          { label: '药品安全用药信息' },
          { label: '药品品种档案管理' },
        ]
      },
      {
        label: '药品包装、说明书和标签管理',
        children: [
          { label: '药品包装管理规定' },
          { label: '药品说明书管理规定' },
          { label: '药品标签管理规定' },
          { label: '药品名称、商标和专有标识管理' },
        ]
      },
      {
        label: '药品广告管理',
        children: [
          { label: '药品广告的界定' },
          { label: '药品广告的审查部门' },
          { label: '药品广告的内容准则和发布要求' },
          { label: '药品广告的申请、审批和注销' },
          { label: '药品广告批准文号管理要求' },
        ]
      },
      {
        label: '互联网药品信息服务管理',
        children: [
          { label: '互联网药品信息服务的定义' },
          { label: '服务网站的开办规定' },
          { label: '互联网药品信息的发布' },
        ]
      },
      {
        label: '药品价格管理',
        children: [
          { label: '实行药品市场调节价应当遵循的原则' },
          { label: '药品经营者遵守药品价格管理的规定' },
          { label: '医药价格和招采信用评价的制度' },
        ]
      },
      {
        label: '反不正当竞争',
        children: [
          { label: '反不正当竞争的界定' },
          { label: '混淆行为、商业贿赂行为、虚假宣传和虚假交易行为、侵犯商业秘密、不正当有奖销售、诋毁商誉行为、互联网不正当竞争行为的界定' },
          { label: '医疗机构工作人员廉洁从业九项准则' },
        ]
      },
      {
        label: '消费者权益保护',
        children: [
          { label: '消费者的权利：安全保障权、真情知悉权、自主选择权、公平交易权、获取赔偿权、结社权、知识获取权、受尊重权、监督批评权' },
          { label: '经营者应履行的义务' },
        ]
      },
    ]
  },
  {
    id: 2,
    label: '9. 医疗器械、化妆品和特殊食品管理-5',
    children: [
      { label: '医疗器械管理' },
      { label: '化妆品管理' },
      { label: '保健食品、特殊医学用途配方食品和婴幼儿配方食品的管理' },
    ]
  },
  {
    id: 2,
    label: '10. 药品安全法律责任 -10',
    children: [
      { label: '药品安全法律责任界定与分类' },
      { label: '违反假药、劣药管理的法律责任' },
      { label: '违反药品监督管理规定的法律责任' },
      {
        label: '违反特殊管理的药品管理规定的法律责任',
        children: [
          { label: '违反疫苗管理法律责任' },
          { label: '违反麻醉药品和精神药品管理规定的法律责任' },
          { label: '违反药品类易制毒化学品管理规定的法律责任' },
          { label: '违反毒性药品管理规定的法律责任' },
        ]
      },
      {
        label: '相关规定的法律责任',
        children: [
          { label: '违反中医药法相关规定的法律责任' },
          { label: '药品质量侵权的法律责任' },
          { label: '违反医疗器械监督管理规定的法律责任' },
        ]
      },
    ]
  },

]
const lihuaxingzhi = '性状、挥发性、旋光性、水中溶解性、有机溶剂中溶解性、酸性、碱性、荧光性质、发泡性、溶血性、显色反应、沉淀反应、水解反应、酶解反应、氧化还原反应等'
const yaohuafenlun = [
  {
    title: '生物碱',
    dingyi: '来源于生物界（主要是植物界）的一类含氮有机化合物',
    des: '大多具有复杂的环状结构，氮原子结合在环内（特例：有机胺类生物碱N原子不在环内）',
    fenbu: [
      {
        title: '双子叶(50科120属)：',
        content: '毛茛科（黄连属黄连，乌头属乌头、附子）、防己科（汉防己、北豆根）、罂粟科（罂粟、延胡索）、茄科（曼陀罗属洋金花、颠茄属颠茄、莨菪属莨菪）、马钱科（马钱子）、小檗科（三颗针）、豆科（苦参属苦参、槐属苦豆子）、芸香科吴茱萸属（吴茱萸）等',
      },
      {
        title: '单子叶',
        content: '石蒜科、百合科（贝母属的川贝母、浙贝母）、兰科等'
      },
      {
        title: '裸子植物',
        content: '麻黄科、红豆杉科、三尖杉科和松柏科等'
      },
      {
        title: '低等植物',
        content: '如烟碱存在于蕨类植物中，麦角生物碱存在于菌类植物中'
      },
      {
        title: '其他',
        content: `地衣、苔藓类植物中仅发现少数简单的吲哚类生物碱。
        藻类、水生类植物中未发现生物碱。
        `
      },

    ],
    fenbujiqiao: '宝马别逗罂粟(毛茛科、马钱科、茄科、豆科、罂粟科）,防己终于小破(防己科、吴茱萸属、小檗科',
    kuozhan: `引申知识点——生物碱分布特点（了解）：
    　　（1）在植物体中多数集中分布于某一器官或某一部位（金鸡纳生物碱——树皮；麻黄——髓部；黄柏——树皮；三颗针——根部）；
    　　（2）在不同的植物中含量差别很大；
    　　（3）同科同属的植物常含有相同结构类型生物碱；
    　　（4）生物碱极少和萜类和挥发油共存于一植物中；
    　　（5）绝大多数生物碱以有机酸盐形式存在。
    `,

  },
  {
    title: '糖和苷'
  },
  {
    title: '醌类化合物'
  },
  {
    title: '苯丙素类化合物',
    des: '香豆素和木脂素'
  },
  {
    title: '黄酮类化合物'
  },
  {
    title: '萜类和挥发油'
  },
  {
    title: '三萜类与甾体化合物',
    des: `甾体皂苷类
    　　强心苷类
    　　胆汁酸类
    　　蜕皮激素类
    `
  },
  {
    title: '其他化学成分',
    des: '有机酸，鞣质，蛋白质和酶，多糖'
  },
]
const jianding = [
  {
    title: '常用根及根茎类中药',
    children: [
      {
        title: '狗脊'
      },
      {
        title: '绵马贯众'
      },
      {
        title: '细辛',
        buwei: ' 根和根茎'
      },
      {
        title: '大黄',
        buwei: ' 根和根茎'
      },
      {
        title: '虎杖',
      },
      {
        title: '何首乌',
        buwei: '块根',
      },
      {
        title: '牛膝——四大怀药VS川牛膝',
        buwei: '块根',
      },
      {
        title: '商陆',
      },
      {
        title: '银柴胡',
      },
      {
        title: '太子参—略烫',
      },
      {
        title: '威灵仙——毛茛科',
        buwei: '根及根茎'
      },
      {
        title: '川乌',
        buwei: '乌头母根'
      },
      {
        title: '附子',
        buwei: '乌头子根'
      },
      {
        title: '草乌',
        buwei: '北乌头块根'
      },
      {
        title: '白芍（杭、亳、川）',
        jiagong: '刮粗皮煮透心或沸水煮后除外皮'
      },
      {
        title: '赤芍',
        jiagong: '晒干'
      },
      {
        title: '黄连-毛茛科、二级保护',
        fenlei: '味连，雅连，云连'
      },
      {
        title: '升麻',
      },
      {
        title: '防己-根',
      },
      {
        title: '防己-根',
      },
      {
        title: '北豆根-根茎',
      },
      {
        title: '山豆根-根及根茎',
      },
      {
        title: '延胡索-块茎',
      },
      {
        title: '板蓝根-十字花科',
      },
      {
        title: '南板蓝根-爵床科',
      },
      {
        title: '地榆-蔷薇科',
      },
      {
        title: '苦参-干燥根',
      },
      {
        title: '葛根',
      },
      {
        title: '粉葛',
      },
      {
        title: '甘草-根及根茎',
      },
      {
        title: '黄芪',
      },
      {
        title: '远志——三级保护',
      },
      {
        title: '人参——二级保护',
      },
      {
        title: '红参',
      },
      {
        title: '西洋参',
      },
      {
        title: '三七',
      },
      {
        title: '白芷',
      },
      {
        title: '当归',
      },
      {
        title: '羌活',
      },
      {
        title: '川芎',
      },
      {
        title: '藁本',
      },
      {
        title: '防风——三级保护',
      },
      {
        title: '柴胡VS银柴胡',
      },
      {
        title: '北沙参',
      },
    ]
  }
]
export { tiqv, lihuaxingzhi, yaohuafenlun, jianding }
