const menuList = [{
    title: '总论',
    submenu: [{
        title: '药和处方'
      },
      {
        title: '药的剂量-两，斗，升'
      },
      {
        title: '炮制的影响'
      },
      {
        title: '用药的奇偶制'
      },
      {
        title: '药物分类：养生？遏制病情？除邪？'
      },
      {
        title: '治病方式'
      },
    ]
  },
  // {
  //   title: '药性总义',
  //   submenu: [{
  //       title: '五味之义'
  //     },
  //     {
  //       title: '五色之义'
  //     },
  //     {
  //       title: '五味之用'
  //     },
  //     {
  //       title: '阴阳之义'
  //     },
  //     {
  //       title: '药之相从'
  //     },
  //     {
  //       title: '药色之入经脉'
  //     },
  //     {
  //       title: '五脏补泻之义'
  //     },
  //     {
  //       title: '六淫主治'
  //     },
  //     {
  //       title: '五行相生'
  //     },
  //     {
  //       title: '五行相克'
  //     },
  //     {
  //       title: '五病所禁'
  //     },
  //     {
  //       title: '五病所伤'
  //     },
  //     {
  //       title: '用药原则'
  //     },
  //     {
  //       title: '药的处理方式'
  //     },
  //     {
  //       title: '称重方法'
  //     },
  //     {
  //       title: '服药时间'
  //     },
  //   ]
  // },
  {
    title: '上经',
    submenu: [{
        title: '玉石类',
        danweiyao:[
          {
            ming:'丹砂',
            xingweiguijing:'性味甘（阴），微寒（阳）无毒',
            gongneng:'安神要药',
            tedian:'有阳中之阴药称，与人参南北称王',
            jinji:'多服丹砂因其性质重坠，使人神定目呆',
            paozhi:'丹砂沉底，所以有毒，但是生用无毒，丹砂只可生研水飞用，火炼则为水银而有毒，不可用',
            changyong:1,
            chandi:`在我国四川湖南等山中。以辰州为最佳，故又号辰砂，属石类。（原
            产地所产的形状象箭簇。）`
          },{
            ming:'云母',
            xingweiguijing:'味甘平,无毒',
            gongneng:'云母主补肺下气（白色质重下沉），补中坚肌，除邪气，安精神',
            tedian:`生产不下（难产）。金石类的药，重症能用，因为石头类的东西下沉的力量比较强。如五石乌头
            丸（千金要方）。重症，如癌细胞、肿瘤扩散，用金石类的药来攻坚，是最后一
            种选择。金石类的药因为质比较重，都可以安五脏，定心定神`,
            jinji:'古称云母治百病，服食无忌，但制炼须慎，不可过量服食',
            paozhi:'煅粉',
            chandi:`产四川及各省山中，种类甚多，有黑云母及白云母等，白者良，属
            玉类。是大理石的一种，属于玉，比较偏近于石头。`
          },
          {
            ming:'玉泉',
            xingweiguijing:'味甘平,无毒',
            gongneng:'清热解渴，安神养肌',
            tedian:`玉是阳精的纯的，玉敲起来越清脆越好，有金属的声音“嘡”的
            声音是纯的玉.面身癜痕，真玉日日磨之则自灭`,
            jinji:'不可用已经做成玉器之物必伤人也，璞玉乃可用也',
            paozhi:'煅粉',
            chandi:`玉乃石之美者，产山中，西南深山中多有之，以钟山蓝田产者最良，
            于阗国之白玉最好。`
          },
          {
            ming:'石钟乳',
            xingweiguijing:'味甘性温，无毒',
            gongneng:'为补阳益精要药，主治肺气虚损.咳逆上气，明目利窍，补髓疗弱，消渴引饮',
            tedian:`入肺降逆，利窍下乳`,
            jinji:'石药性悍，不宜久服',
            paozhi:'煅粉',
            chandi:`中国日本俱有出产，生于山中石洞穴中，我国以广西陕西等省多此
            洞`
          },
          {
            ming:'涅石（矾石-明矾/枯矾）',
            xingweiguijing:'味酸性寒无毒',
            gongneng:`为收湿解毒止血要药，功能除湿化痰，追涎（浓痰）坠浊，主明目
            坚齿，除风杀虫，蚀恶肉，生好肉，治蛇虫咬伤`,
            tedian:`枯矾可与麝香合用（麝香矾石散，麝香与枯矾 1:50）麝香无孔不
            入，配合之则可去脑鼻之间的风寒与瘀伤。`,
            jinji:'石药性悍，不宜久服',
            paozhi:'白矾研粉，枯矾煅至全部泡松呈白色蜂巢状，放凉研粉',
            changyong:1,
            fangji:'麝香矾石散',
            chandi:`产四川陕甘，我国南省诸山亦多有之，色白净者为明矾`
          },
          {
            ming:'消石（硝石）',
            xingweiguijing:'味苦性寒，无毒',
            gongneng:'硝石主清积热利小便，治五淋',
            tedian:'含咽治喉痹（不能吞东西）、硝石矾石散治疗黑疸',
            jinji:'忌火',
            chandi:`】产于东印度埃及等热带地方及我国西北。投入火中则爆鸣，立即燃
            烧而发鲜明之焰。`,
            paozhi:'拣去杂质即可，不能炮制。最好用竹筷子，不要用金属的东西捡',
            fangji:'硝石矾石散 治疗黑疸'
          },
          {
            ming:'朴肖（芒硝）',
            xingweiguijing:'味咸辛苦，性寒无毒',
            gongneng:'主软坚化积，逐六腑积聚结固留癖。清热泻下，外用消食化积;治腹胀，大小便不通，女子月经不通',
            tedian:'微咸之味者，皆能引火下行。大咸者能助火升发也(硝石)',
            jinji:'辛香走窜，不宜多用。大便没有了就把芒硝停掉',
            paozhi:'拣去杂质即可。芒硝煮了就没有力量，冲服',
            changyong:1,
            chandi:`生于盐卤之地，凡煎炼水硝，结出细芒者为芒硝，结出马牙状者为
            马牙硝，其凝于底成块者，通为朴硝`
          },
          {
            ming:'滑石',
            xingweiguijing:'味甘性寒无毒',
            gongneng:'为去湿热利小便要药，主通六府九窍津液。上开肌理下通膀胱，治淋疾，水肿，黄疸。',
            tedian:'为去暑之要药，去暑只宜清气利湿（清热利湿），不可用燥药，如黄连亦然，甘草也可',
            jinji:'由于阴虚火热水涸者，均忌，脾胃俱虚者虽不做泄亦忌，因其性滑也',
            paozhi:'拣去杂质，洗净，研细粉即可',
            changyong:1,
            chandi:`产山东及西南诸省山中。色青白或黄白及银灰色`
          },
          {
            ming:'胆石（胆矾）',
            xingweiguijing:'味酸辛，性寒，有小毒;神农酸小寒，扁鹊苦无毒，',
            gongneng:'胆矾为腐蚀催吐要药，功能蚀恶疮散症积（整个恶疮不能收口），涌吐风痰，治咽喉口鼻疮毒及目患。',
            tedian:'石胆、空青、曾青均产自铜坑。石胆是蓝色的，很透；空青是青蓝色的;石胆除了内服以外还可以外敷',
            jinji:'胃弱人不宜多服',
            paozhi:'拣去杂质;真正的胆矾，跟铁一磨，就会出现铜的颜色',
            chandi:`产山中，为蓝色结晶`
          },
          {
            ming:'空青',
            xingweiguijing:'味甘酸，性寒，无毒',
            gongneng:`为一切眼目要药，主治目赤目痛，青盲耳聋，利九窍通血脉，养神
            益肝`,
            tedian:`取其象，青色的石头是空的，可以看到里面有水，像眼眶里的水一样，把水
            取出来点眼睛，非常好。空青治疗青盲、夜盲。但是现在很少见`,
            jinji:'勿过量使用。一日点二次即止',
            paozhi:'拣去杂质',
            chandi:`产河南山西陕西山中，色青质轻，近罕见。今名丹青。`
          },
          {
            ming:'曾青',
            xingweiguijing:'味酸小寒无毒',
            gongneng:`主目痛止泪出，风痹利关节，通九窍，破症瘕积聚,杀白虫，
            久服轻身不老，能化金铜`,
            tedian:`曾青跟空青都产于铜坑中，和空青类似，只是颜色有一点差异。空青里面有
            水，曾青里面没有水`,
            jinji:'',
            paozhi:'拣去杂质'
          },
          {
            ming:'禹余粮（禹粮石）',
            xingweiguijing:'味甘寒，无毒',
            gongneng:`固补下焦要药（下焦虚都可以用，还可以固精，治疗精往外散），
            主治滑泄下血（大肠炎），血闭血虚，四肢虚而不仁，崩露赤白`,
            tedian:`山岛或是池泽，乃石中黄粉;石头很软，黄的像泥土一样;此药多使用于下脓血利不止，常与赤石脂同用`,
            jinji:'重可去怯，故为镇纳固补之剂。下焦有实热者忌，虚者良',
            paozhi:'拣去杂质,醋煅研粉',
            changyong:1,
            chandi:`产于山岛或是池泽，乃石中黄粉`
          },
          {
            ming:'太一余粮',
            xingweiguijing:'味甘平',
            gongneng:`主治咳逆上气（质重的药，如金石药都可以把气往下
            压），症瘕血闭，漏下除邪气，久服耐寒暑不饥，轻身飞行千里神仙`,
            tedian:`生泰山上，石如甲，甲中有白，白中有黄如鸡子黄色，又名太乙余粮，与禹余粮同，唯质较
            佳者`,
            paozhi:''
          },
          {
            ming:'白石英',
            xingweiguijing:'味甘微温无毒',
            gongneng:`肺大肠枯燥（金石类的东西都有滋润的功能），疗肺痰肺痈消渴`,
            tedian:`喉癌：喉咙打不开，可以用生半夏（半夏苦酒汤），如果打不开是
            喉癌（整个舌头喉咙堵住），要用硝石。（巴豆也可以开，但主攻是攻肠胃方面。）`,
            paozhi:'',
            jinji:'不可久服，寇氏曰紫白二石英攻疾可暂煮汁，未闻久服之益',
            chandi:'产深山中'
          },
          {
            ming:'紫石英',
            xingweiguijing:'味甘辛，性温无毒',
            gongneng:`主镇怯润枯，养心益肝，治女子风寒在子宫不孕`,
            tedian:`只要是有虚症的时候都可以用金石类的药来补。紫石英是温药，实热不能用，
            里面虚寒才会用；阳药`,
            paozhi:'拣去杂质,醋淬研粉（补了要收）',
            jinji:'紫石英是温药，实热不能用，里面虚寒才会用。凡绝孕由阴虚火旺，不能摄受精气者忌用',
            chandi:'产深山中'
          },
          {
            ming:'赤石脂',
            xingweiguijing:'性味酸辛，性大温无毒',
            gongneng:'为固肠收敛要药，主治赤白久痢，赤白带下，厚肠胃，除水湿，收脱肛',
            tedian:`辛甘生大热，辛甘发散为阳嘛，加一点酸味收敛，又是补阳又是收敛;赤石脂本身是红色，药性本身的温度比较高，当然不像附子、硫磺那么大热。赤石脂和禹余粮两味药可以和在一起使用治疗大肠炎（下痢出血），一剂下
            去就收掉了`,
            jinji:`凡火热暴注者不宜用，滞下全是湿热，于法当利，自非的受寒邪，
            下利白积者不宜用，崩中法当补阴清热，带下本属湿热积滞，法当去湿除积，止
            涩非宜(寒痢，水痢不适用)`,
            paozhi:'拣去杂质,醋淬研粉',
            changyong:1,
            chandi:'产山西山东河南．他省亦多'
          },
          {
            ming:'白青',
            xingweiguijing:'味甘平',
            gongneng:'主明目利九窍，耳聋心下邪气令人吐，杀诸毒三虫。久服通神明，轻身延年不老',
            tedian:`白青现在已经绝迹，很少用了。金石类的药，如空青、白青、曾青，都是产
            在铜坑里面`,
            jinji:``,
            paozhi:'',
          },
          {
            ming:'扁青',
            xingweiguijing:'味甘平;神农雷公小寒无毒',
            gongneng:'主目痛明目，折跌痈肿，金创不疗，破积聚解毒气，利精神，久服轻身不老;治丈夫内绝令人有子。去寒热风痹，及丈夫茎中百病益精',
            tedian:`最常用的眼科的药都是曾青，空青，扁青，白青，金石类的药很多，草木类
            的有贝母，贝母都可以泡水`,
            jinji:``,
            paozhi:`金石类的药炮制提炼过以后，打碎磨细，放入
            水中，沉底的不要，溶化在水里面的可以作眼科的药来涂，曾青、白青、扁青都
            可以，可以止眼睛痛痒，用炉甘石也可以`,
          }
        ]
      },
      {
        title: '草药类',
        danweiyao:[
          {
            ming:'菖蒲',
            xingweiguijing:'味辛性温无毒',
            gongneng:`菖蒲为宣窍泄热，健胃行滞要药，主开心孔通九窍，明耳目出声音，
            治咳嗽上逆，霍乱转筋，健脾胃杀诸虫，疗噤口痢；四肢湿癣不得曲伸，小儿温疟，身积热不解，可作浴汤`,
            tedian:`菖蒲常常和辛夷花并用，菖蒲质比较重，辛夷花很轻，一般来说辛
            夷花剂量会比较少。菖蒲最主要的功能是开心孔补五脏通九窍，明耳目，在治疗心脏病的时候常
            常用到菖蒲；我国四川，今处处有之，多生水滨，可供盆栽；根入药，一寸九节者良；菖蒲南人多常用置食水中，或加矾（明矾）少许，解一切毒`,
            jinji:`忌饴糖羊肉铁器`,
            paozhi:`拣去杂质，刷去灰尘`,
            fangji:`有菖蒲丸（石菖蒲人参丹参天冬麦冬赤石脂）治小儿心气不足，不能言语。又醋糊丸棉裹置耳中，治耳内卒痛，聋闭不闻
            菖蒲益智丸（菖蒲远志人参枯梗牛膝附子伏签桂心），治健忘恍惚，破积聚止痛，
            安心定神聪明耳目均效`,
            fangji:`鼻窦炎：菖蒲 3 钱、辛夷 2 钱、苍术 3 钱，只去鼻窦炎里面堵到的东西，
            不管寒热。寒热辨证：浓鼻涕是热，流清涕是寒，寒热在肺里面，因为肺开窍于
            鼻，加干姜可以去肺的寒，加杏仁、麦门冬等可以去肺热。`,
            changyong:1
          },
          {
            ming:'菊花',
            xingweiguijing:'味苦甘平无毒',
            gongneng:`为清风热明目解毒要药，主诸风头眩肿痛，目痛翳膜，利血脉，治
            疗疮`,
            tedian:`风是指外感，没有什么其他问题就是头痛，一般是风寒吹到，都可以用菊;近世用为平肝良药，头痛目疼多因肝经风热上乘所致，菊花入肝，
            兼行周身，血脉不利而死肌，得菊花之利血脉皆效，特长于解毒，外科方剂用之
            治疗毒发背者。沈金鳌曰菊花并茎叶打汁饮，外涂内服皆可。时医用之因防邪热
            过久而酝酿化毒；平淡多奇功。`,
            jinji:`味苦辣者，陈久者，不堪用，其甘者亦名甘菊，可饮可食亦入药`,
            paozhi:`拣去杂质及梗叶，拍去灰尘即得`,
            qita:`菊叶解毒之功胜于花，以鲜者良，捣汁敷一切肿毒（脓疮和伤
            口皆可），亦可内服`,
            fangji:``,
            changyong:1
          },{
            ming:'人参',
            xingweiguijing:'味甘微苦性微寒无毒',
            gongneng:`为大补元气要药，功能治一切衰弱痨瘵，通行周身补五脏之气，泻
            五脏之火，效益多但功缓，红色曰高丽参，性温而力较峻`,
            tedian:`真正的高丽红参很干很硬，用烤炉烤一下就软掉了，切片的时候味道很呛鼻，
            里面的确是暗红色的;采收时，人参不用金属的刀去，因为金克木，怕味道跑掉都用竹刀。
            晒干了以后可以用钢刀切。`,
            jinji:`肺家有热诸症及阴虚火动之候与痘疹之初发，身虽热而斑点未形，
            与伤寒始作，形症未定而邪热炽均忌，反葵芦；人参不能常吃，如果每天吃人参，等到真的需要人参的时候，石沉大海，起
            不到疗效`,
            paozhi:`用湿布包裹，焖润用火烤，再晾干或烘干即可得`,
            qita:`a 独参汤：用于救逆的时候，单味一味人参去熬浓汤喝，补气。b 考试时可以口含人参切片含在，能够生津止渴、提神 c 如果人参一吃下去就上火、口腔溃疡、口干舌燥，是因为他肺里有热，人
            参不适合，这个时候可以吃天门冬把肺热去掉`,
            fangji:``,
            changyong:1
          },
          {
            ming:'天门冬',
            xingweiguijing:'味苦平',
            gongneng:`为清虚热润燥痰要药，主肺气咳逆，风湿偏痹益肌肤，保肺气治消渴、疗咳血。`,
            tedian:``,
            jinji:`胃虚无热及泻者均忌，忌鲤鱼。`,
            paozhi:``,
            qita:`天冬麦冬性相近，故一般方剂二药并用`,
            fangji:``,
            changyong:1
          },
          {
            ming:'甘草',
            xingweiguijing:'味甘平无毒',
            gongneng:`甘草为调合周身气血要药，功能解百毒，补脏腑，泻诸火，在上去痰止咳，在中调和脾胃，在下清热利溲，入和剂则补益，入汗剂则解肌，入凉剂则泻热，入润剂则生津，入峻剂则缓正气，制药之暴性，效益甚多，为诸药之君。`,
            tedian:`炙甘草入心`,
            jinji:`凡中满人呕家酒家，诸湿肿满及胀满均忌，反大戟甘遂芫花海藻，恶远志忌猪肉。`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'干地黄',
            xingweiguijing:'味甘性寒无毒',
            gongneng:`干地黄为滋阴养血要药，功能凉血热，滋肝肾，养心益肺，通血脉逐血痹`,
            tedian:`产中州，得土深水厚之性，内含润泽之湿也。原色为黄，制后为黑，故人知地黄之能滋肾阴，不知地黄实滋脾阴，内经云脾为阴中之至阴，地黄以湿归脾，脾阴足，则肝肾自受其灌溉。其不辛温，故能益水液，滋血之源，而不能变化、以成血色。以水配火，不使壮火食气，如此气纳矣`,
            jinji:`凡病人脾胃弱，大便泄，产后不食或泻，及胸膈多痰，气道不利者均忌，忌铜铁及茶，得清酒麦冬良。`,
            paozhi:``,
            qita:`男子多阴虚宜熟地，女子多血热宜生地`,
            fangji:``,
            changyong:1
          },
          {
            ming:'白术',
            xingweiguijing:'味甘性温无毒',
            gongneng:`白术为健脾胃要药，功能利水去湿，和中调气，外科用托疡疮`,
            tedian:`白术补脾补气，苍术燥湿发汗`,
            jinji:`凡病属阴虚血少，精不足，内热骨蒸，口干唇燥，咳嗽吐痰，吐血鼻血，齿血，咽塞，便秘，滞下均忌，溃疡用之反生脓作痛，忌与蛤雀桃李菘菜青鱼同食。`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'菟丝子',
            xingweiguijing:'味辛甘，性平无毒',
            gongneng:`菟丝子为补肾益精要药，主绝续伤，补不足，坚筋骨，强阴分，治茎中寒，精自出，溺有余沥，腰痛膝冷`,
            tedian:`白术补脾补气，苍术燥湿发汗`,
            jinji:`肾家多火，阳强不痿，及大便燥急者，均忌，得酒良`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'牛膝',
            xingweiguijing:'味苦酸性平无毒',
            gongneng:`牛膝为寒湿痹痿，骨节疼痛要药，走血能补，益肝肾强筋骨，痛淋浊，引诸药下行，治膝痛，能堕胎`,
            tedian:`杜牛膝──性专走下，毫无补益，散恶血破症瘕，止痛，治淋药中宜用`,
            jinji:``,
            paozhi:``,
            qita:`牛膝性降，因根深味苦，故能引水火下行。因根坚实，形不空，无升达之孔道，味既苦泻，故下行双足。其节如膝，能利膝胫，以其形似也。`,
            fangji:``,
            changyong:1
          },
          {
            ming:'充蔚子（益母草）',
            xingweiguijing:'味辛苦性微寒，无毒',
            gongneng:`此药为去瘀生新，通调月经，及产后要药，根茎功用相同`,
            tedian:``,
            jinji:`血崩及瞳子散大均忌，唯热血欲贯瞳仁者，可与凉药同用`,
            paozhi:``,
            qita:`主明目益精，除水气，久服轻身，茎主瘾疹痒，可做浴汤，一名益母`,
            fangji:``,
            changyong:1
          },
          {
            ming:'女萎（玉竹）',
            xingweiguijing:'味甘性平无毒',
            gongneng:`萎蕤为治风热风湿入肌作痛要药，功能祛风清热，除湿止痛，主邪热头痛，及腰痛身痛，补劳伤`,
            tedian:`久服去面黑皯，好颜色，润泽，轻身不老`,
            jinji:`畏咸卤`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'防葵',
            xingweiguijing:'味辛苦，性寒',
            gongneng:`根为解热利尿，镇静药，治膀胱宿水，膀胱热结，癃闭，癫狂痫症`,
            tedian:``,
            jinji:``,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:0
          },
          {
            ming:'柴胡',
            xingweiguijing:'味苦性平无毒',
            gongneng:`发表清热要药，功能散三焦肝胆诸经之热邪，主治寒热疟疾，口苦耳聋，头痛眩晕`,
            tedian:`其性轻扬，能逐半表半里之邪`,
            jinji:`凡虚人气升呕吐，及阴虚火热炎上，法同所忌。`,
            paozhi:``,
            qita:`北柴胡，南柴胡，银柴胡`,
            fangji:`小柴胡汤，大柴胡汤`,
            changyong:1
          },
          {
            ming:'麦门冬',
            xingweiguijing:'味甘性寒，无毒',
            gongneng:`麦冬为润肺清火要药，主治肺中伏火，痰多，心腹结气，肺弱胃弱，津少口渴，止咳嗽，疗肺病吐脓血`,
            tedian:`其性轻扬，能逐半表半里之邪`,
            jinji:`麦冬性寒，虽主脾胃而虚寒泄泻及痘疮虚寒作泻，产后虚寒作泻均忌，入补药，酒浸良。秉水阴，能滋肺以清气分。`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'独活',
            xingweiguijing:'味辛苦，性温，无毒',
            gongneng:`独活为风痛要药，主治头痛身痛脚痛，机关不利，风湿诸痹`,
            tedian:`此药有风花不动，无风独摇`,
            jinji:`凡血虚发痉，血虚头痛，及遍身疼痛，骨痛，因而带寒热者，均属内症，均忌，误用必反剧`,
            paozhi:``,
            qita:`色黑，故兼入少阴经，以达太阳，能散背脊之风寒，同天麻与白头翁皆有风不动，无风而动。但味太辛，气太温，能散风寒，其力胜于天麻，兼能燥湿，但不如天麻之刚柔得中也`,
            fangji:``,
            changyong:1
          },
        ]
      },
      {
        title: '木头类',
      },
      {
        title: '人体类',
      },
      {
        title: '走兽类',
      },
      {
        title: '家禽类',
      },
      {
        title: '鱼虫类',
      },
      {
        title: '果实类',
      },
      {
        title: '米谷类',
      },
      {
        title: '菜类',
      },
    ]
  },
  {
    title: '中经',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '下经',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '增补',
    submenu: [{
      title: ''
    }]
  },
]
const zongyi = {
  wuxing: [{
    weiyi: '酸属木入肝',
    seyi: '青属木入肝',
    weiyong: '能涩能收',
    rujing: '气燥，足厥阴肝经，足少阳胆经',
    wuzangbuxie: '肝苦急，急食甘而缓之；肝欲散，急食辛以散之，以辛补之，以酸泻之',
    xiangsheng: '',
    xiangke: '',
    bingjin: '',
    suoshang: '',
    yinyang: '',
    xiangcong: '',
    liuyin: '',
  },
 ]
}

export {
  menuList,
  zongyi
}