
const menuList = [
  {
    title:'总论',
    submenu:[
      {
        title:'药和处方'
      }
    ]
  },
  {
    title:'上经',
    submenu:[
      {
        title:'玉石类',
      },
      {
        title:'草药类',
      },
      {
        title:'木头类',
      },
      {
        title:'人体类',
      },
      {
        title:'走兽类',
      },
      {
        title:'家禽类',
      },
      {
        title:'鱼虫类',
      },
      {
        title:'果实类',
      },
      {
        title:'米谷类',
      },
      {
        title:'菜类',
      },
    ]
  },
  {
    title:'中经',
    submenu:[
      {
        title:''
      }
    ]
  },
  {
    title:'下经',
    submenu:[
      {
        title:''
      }
    ]
  },
  {
    title:'增补',
    submenu:[
      {
        title:''
      }
    ]
  },
]
const lihuaxingzhi = '性状、挥发性、旋光性、水中溶解性、有机溶剂中溶解性、酸性、碱性、荧光性质、发泡性、溶血性、显色反应、沉淀反应、水解反应、酶解反应、氧化还原反应等'
const yaohuafenlun = [
  {
    title: '生物碱',
    dingyi: '来源于生物界（主要是植物界）的一类含氮有机化合物',
    des: '大多具有复杂的环状结构，氮原子结合在环内（特例：有机胺类生物碱N原子不在环内）',
    fenbu: [
      {
        title: '双子叶(50科120属)：',
        content: '毛茛科（黄连属黄连，乌头属乌头、附子）、防己科（汉防己、北豆根）、罂粟科（罂粟、延胡索）、茄科（曼陀罗属洋金花、颠茄属颠茄、莨菪属莨菪）、马钱科（马钱子）、小檗科（三颗针）、豆科（苦参属苦参、槐属苦豆子）、芸香科吴茱萸属（吴茱萸）等',
      },
      {
        title: '单子叶',
        content: '石蒜科、百合科（贝母属的川贝母、浙贝母）、兰科等'
      },
      {
        title: '裸子植物',
        content: '麻黄科、红豆杉科、三尖杉科和松柏科等'
      },
      {
        title: '低等植物',
        content: '如烟碱存在于蕨类植物中，麦角生物碱存在于菌类植物中'
      },
      {
        title: '其他',
        content: `地衣、苔藓类植物中仅发现少数简单的吲哚类生物碱。
        藻类、水生类植物中未发现生物碱。
        `
      },

    ],
    fenbujiqiao: '宝马别逗罂粟(毛茛科、马钱科、茄科、豆科、罂粟科）,防己终于小破(防己科、吴茱萸属、小檗科',
    kuozhan: `引申知识点——生物碱分布特点（了解）：
    　　（1）在植物体中多数集中分布于某一器官或某一部位（金鸡纳生物碱——树皮；麻黄——髓部；黄柏——树皮；三颗针——根部）；
    　　（2）在不同的植物中含量差别很大；
    　　（3）同科同属的植物常含有相同结构类型生物碱；
    　　（4）生物碱极少和萜类和挥发油共存于一植物中；
    　　（5）绝大多数生物碱以有机酸盐形式存在。
    `,

  },
  {
    title: '糖和苷'
  },
  {
    title: '醌类化合物'
  },
  {
    title: '苯丙素类化合物',
    des: '香豆素和木脂素'
  },
  {
    title: '黄酮类化合物'
  },
  {
    title: '萜类和挥发油'
  },
  {
    title: '三萜类与甾体化合物',
    des: `甾体皂苷类
    　　强心苷类
    　　胆汁酸类
    　　蜕皮激素类
    `
  },
  {
    title: '其他化学成分',
    des: '有机酸，鞣质，蛋白质和酶，多糖'
  },
]
const jianding1 = [
  {
    id: 1,
    label: '常用根及根茎类中药91/94',
    children: [
      {
        label: '狗脊',
        children: [
          { label: '蚌壳蕨科-根茎' }
        ]
      },
      {
        label: '绵马贯众',
        children: [
          { label: '鳞毛蕨科-根茎' },
          { label: '长倒卵形、略弯曲、表面密被叶柄残基及鳞片，断面黄白色维管束5～13个，环列' },
          { label: '以个大、质坚实、叶柄残基断面棕绿色者为佳，断面变黑者不能药用' },
        ]
      },
      {
        label: '细辛-三级保护-有毒-辽细辛',
        children: [
          {
            label: ' 根和根茎'
          },
          { label: '以根灰黄，干燥、味辛辣、麻舌为佳' }
        ]
      },
      {
        label: '大黄-显微鉴别-廖科',
        children: [
          {
            label: ' 根和根茎'
          },
          {
            label: '秋末地上部分枯黄、次春植株发芽前采挖——刮去外皮（忌用铁器）——绳穿成串干燥或直接干燥。'
          },
          {
            label: '根茎髓部宽广，有“星点”环列或散在；根木部发达，具放射状纹理，形成层环明显，无“星点”。'
          },
          { label: '气清香，味苦而微涩，嚼之粘牙，有砂粒感' },
          { label: '显微鉴别-草酸钙簇晶大而多，大黄粉末微量升华，可见菱状针晶或羽状结晶' }
        ]
      },
      {
        label: '虎杖-廖科-根茎和根',
        children: [
          { label: '切面皮部较薄，木部宽广，皮部与木部较易分离;根茎髓中有隔或呈空洞状' }
        ]
      },
      {
        label: '何首乌-廖科',
        children: [
          { label: '块根' },
          { label: '表面红棕色或红褐色' },
          { label: '皮部有4～11个类圆形异常维管束（云锦状花纹）环列' },
          { label: '以个大、身干、表面红褐色、断面显云锦状花纹，质坚粉性足者为佳' },
        ]
      },
      {
        label: '牛膝——四大怀药VS川牛膝-根',
        children: [
          { label: '牛膝-苋科-中心木质部较大，外周散多数黄白色点状维管束（筋脉点），断续排列成2～4轮同心环' },
          { label: '川牛膝-苋科-维管束点状，排列成数轮同心环' },
        ]
      },
      {
        label: '商陆-有毒-商陆科-根',
        children: [
          { label: '横切片-木部隆起形成数个凸起的同心性环轮（罗盘纹）' },
          { label: '纵切片：木部呈平行条状突起' },
          { label: '味稍甜，久嚼麻舌' },
          { label: '以片大、色白、有粉性、“罗盘纹”明显者为佳。' },
        ]
      },
      {
        label: '银柴胡-根',
        children: [
          { label: '来源-石竹科银柴胡' },
          { label: '来源-浅棕黄至浅棕' },
          { label: '形状-砂眼，珍珠盘' },
          { label: '质地-硬脆' },
          { label: '断面-疏松有缝隙' },
          { label: '气味-味甘' },
          { label: '以根长均匀，外皮淡棕黄色，断面黄白色、 质较疏松者为佳' },
        ]
      },
      {
        label: '太子参—略烫-角质样',
        children: [
          { label: '石竹科孩儿参块根' },
          { label: '质地-质硬而脆' },
          { label: '形状-长纺锤或细长形，弯曲' },
        ]
      },
      {
        label: '威灵仙——毛茛科',
        children: [
          { label: '根及根茎' },
          { label: '来源-威灵仙-断面木部略方形。味淡，根茎呈柱状，下侧着生多数细根。质硬脆，易折断。表面黑褐色，有的皮部脱落，露出黄白色木质部。' },
          { label: '棉团铁线莲-断面木部圆形。味咸' },
          { label: '东北铁线莲-断面木部近圆形。味辛辣' },
          { label: '以根长、皮黑肉白、质坚实、无地上残基者为佳' },
        ]
      },
      {
        label: '川乌vs附子vs草乌-毛茛科，有毒',
        children: [
          { label: '川乌-乌头母根-有小瘤状突起的侧根及除去子根后的痕迹，形成层环纹呈多角形，味辛辣、麻舌' },
          {
            label: '附子-乌头子根',
            children: [
              { label: '盐附子：有盐霜' },
              { label: '黑顺片：外皮黑褐、断面角质样' },
              { label: '白附片：无外皮、断面黄白半透明' },
            ]
          },
          { label: '草乌-北乌头块根-具不定根残基（钉角），形成环多角形，味辛辣、麻舌' },
          { label: '草乌-以个大、质坚实、断面色白、有粉性、残茎及须根少者为佳' },
          { label: '川乌-以饱满、质坚实、断面色白、有粉性者为佳' },
        ]
      },
      {
        label: '白芍（杭、亳、川）vs赤芍-毛茛科-显微鉴别',
        children: [
          { label: '白芍-刮粗皮煮透心或沸水煮后除外皮' },
          { label: '白芍-表面类白或淡红棕色，偶有残存棕褐色外皮，断面较平坦，类白或微红，形成层环明显，射线放射状，味苦，酸' },
          { label: '白芍-以根粗、坚实、无白心或裂隙者为佳' },
          { label: '赤芍-芍药或川赤芍根-晒干-气微香，味微苦、酸涩' },
          { label: '赤芍-以根粗壮，断面粉白色，粉性大者为佳' },
          { label: '粉末 白芍、炒白芍、酒白芍-糊化淀粉粒团块甚多。草酸钙簇晶直径11～35μm，存在于薄壁细胞中，常排列成行或一个细胞中含数个簇晶。纤维长梭形，直径15～40μm，壁厚， 微木化，具大的圆形纹孔' },
        ]

      },
      {
        label: '黄连-毛茛科、二级保护-根茎-显微鉴别',
        children: [
          { label: '味连-来源黄连-产地重庆-多分枝，集聚成簇，形如鸡爪，节间平滑如茎秆，称“过桥”，味极苦' },
          { label: '雅连-来源-三角叶黄连-产地四川-单枝，“过桥”长' },
          { label: '云连-云连-产地云南-单枝，弯曲呈钩状，细小' },
          { label: '粉末 黄连、黄连片、酒黄连、姜黄连、萸黄连：中柱鞘纤维束鲜黄色，纤维壁稍厚，纺锤形或梭形，纹孔明显。石细胞类方形、类圆形、类长方形或近多角形，直径25～64μm, 长至102μm，黄色，壁厚，壁孔明显。鳞叶表皮细胞绿黄色或黄棕色，细胞长方形或长多角形， 壁微波状弯曲或作连珠状增厚' },
        ]
      },
      {
        label: '升麻',
        children: [
          { label: '毛茛科 大三叶升麻、兴安升麻或升麻 根茎' },
          { label: '有数个圆形空洞茎基痕，洞内壁网状沟纹' },
          { label: '断面不平坦，有裂隙，纤维性。' },
          { label: '升麻疹透阳气举,留下空洞和网纹' },
        ]
      },
      {
        label: '防己-防己科粉防己的干燥根',
        children: [
          { label: '弯曲处常有深陷横沟呈结节状瘤块样（猪大肠）' },
          { label: '富粉性' },
          { label: '断面有排列稀疏的放射状纹理（车轮纹）' },
          { label: '以质坚实、粉性足、去净外皮者为佳' },
        ]
      },
      {
        label: '北豆根Vs山豆根',
        children: [
          { label: '北豆根-防己科蝙蝠葛 根茎' },
          { label: '北豆根-表面有弯曲细根，木部淡黄色，放射状排列，髓白色，味苦' },
          { label: '山豆根-豆科越南槐 根及根茎' },
          { label: '山豆根-木部淡黄色，豆腥气、味极苦（技巧：山上种豆太辛苦）' },
        ]
      },
      {
        label: '延胡索-浙八味',
        children: [
          { label: '罂粟科延胡索块茎' },
          { label: '加工：沸水中煮至恰无白心' },
          { label: '性状：表面黄色或黄褐色，有不规则网状皱纹。断面黄色，角质样，有蜡样光泽。' },
          { label: '以个大、饱满、质坚实、断面色黄者为佳' },
        ]
      },
      {
        label: '板蓝根-十字花科',
        children: [
          { label: '十字花科-菘蓝根' },
          { label: '根头部略膨大，可见叶柄残基和密集的疣状突起；皮部黄白色，木部黄色（金井玉栏）' },
          { label: '味微甜而后苦涩——以条长、粗大、体实者为佳' }
        ]
      },
      {
        label: '南板蓝根-爵床科',
        children: [
          { label: '爵床科-马蓝根茎及根' },
          { label: '质硬而脆，易折断，断面不平坦，皮部蓝灰色，木部灰蓝色至淡黄褐色，中央有髓（海绵状）。' },
          { label: '根粗细不一，弯曲有分枝，细根细长而柔韧。气微，味淡' }
        ]
      },
      {
        label: '地榆-蔷薇科',
        children: [
          { label: '蔷薇科 地榆或长叶地榆（绵地榆）根' },
          { label: '有放射状纹理' },
          { label: '以条粗、质坚、断面粉色者为佳' },
        ]
      },
      {
        label: '苦参-干燥根',
        children: [
          { label: '豆科苦参干燥根' },
          { label: '外皮薄，多破裂反卷，易剥落，剥落处显黄色，光滑，味极苦' },
          { label: '以条匀、断面色黄白、无须根、味苦者为佳' },
        ]
      },
      {
        label: '葛根',
        children: [
          { label: '来源-野葛根' },
          { label: '呈纵切的长方形厚片或小方块；外皮淡棕色，有纵皱，粗糙。切面黄白色，纹理不明显。质韧，纤维性强。微甜——以块大、质坚实、色白、粉性足、纤维少者为佳' }
        ]
      },
      {
        label: '粉葛',
        children: [
          { label: '来源-甘葛藤 根' },
          { label: '体重质硬，富粉性，横切面可见由纤维形成的浅棕色同心性环纹。微甜' }
        ]
      },
      {
        label: '甘草-二级保护-根及根茎',
        children: [
          { label: '豆科 甘草、胀果甘草或光果甘草 根及根茎' },
          { label: '内蒙古、新疆、甘肃' },
          { label: '红棕；纵皱纹明显，皮孔横长；横切面形成层环纹明显；射线放射状，有裂隙（菊花心）；味甜而特殊。' },
          { label: '以外皮细紧、色红棕、质坚实、断面黄白色、粉性足、味甜者为佳。' },
        ]
      },
      {
        label: '黄芪',
        children: [
          { label: '豆科 蒙古黄芪（栽培品质佳）或膜荚黄芪 根' },
          { label: '皮部黄白色，木部淡黄色' },
          { label: '有放射状纹理及裂隙（菊花心）' },
          { label: '老根中心偶呈枯朽状，黑褐色或者呈空洞' },
          { label: '嚼之微有豆腥味' },
          { label: '以条粗长、断面色黄白、有粉性者为佳' },
        ]
      },
      {
        label: '远志——三级保护',
        children: [
          { label: '远志科 远志或卵叶远志 根' },
          { label: '有较密深陷的横皱纹，略呈结节状' },
          { label: '皮部易与木部剥离' },
          { label: '味苦、微辛，嚼之有刺喉感' },
        ]
      },
      {
        label: '人参——二级保护-吉辽黑-芦碗-粉性',
        children: [
          { label: '五加科人参的根和根茎' },
          { label: '栽培品：园参（生晒参、全须生晒参，蒸制红参）' },
          { label: '野生品：山参' },
          { label: '播于山林自然生长：林下山参——籽海' },
          { label: '真空冷冻干燥法可防止总皂苷损失（冻干参、活性参）' },
          { label: '人参-以条粗、质硬、完整者为佳' },
          { label: '西洋参——以体轻质硬、表面横纹紧密、气清香、味浓者为佳' },
          { label: '疏浅断续粗横纹及明显纵皱纹；支根2～3条，着生多数细长须根；根茎（芦头）多拘挛而弯曲，具稀疏的凹窝状茎痕（芦碗）及不定根（艼）' },
        ]
      },
      {
        label: '红参-角质样',
        children: [
          { label: '人参栽培品蒸制-根和根茎' },
          { label: '红棕色' },
        ]
      },
      {
        label: '西洋参-略粉性',
        children: [
          { label: '西洋参栽培品-根' },
          { label: '浅黄褐色或黄白色' },
          { label: '五加三参最可爱,人参整容变红参,远道而来西洋参,体重个大质坚实' },
        ]
      },
      {
        label: '三七',
        children: [
          { label: '五加科 三七 根及根茎' },
          { label: '云南文山' },
          { label: '主根（三七）、支根（筋条）、根茎（剪口）、须根（绒根）' },
          { label: '表面灰褐色或灰黄色。顶端有茎痕，周围有瘤状突起。体重，质坚实。断面灰绿色、黄绿色或灰白色。气微，味苦回甜' },
          { label: '以个大、体重、质坚、表面光滑、断面色灰绿或黄绿者为佳' },
        ]
      },
      {
        label: '白芷-伞形科',
        children: [
          { label: '白芷:禹白芷－河南,祁白芷－河北' },
          { label: '白芷:皮孔样横向突起（疙瘩丁），形成层环近圆形' },
          { label: '杭白芷:川白芷－四川,杭白芷－浙江' },
          { label: '杭白芷:皮孔样横向突起排成四纵行，形成层环近方形' },
          { label: '断面粉性，皮部散有多数棕色油点，气芳香，味辛、微苦——以条粗壮、体重、粉性足、香气浓郁者为佳' },
        ]
      },
      {
        label: '当归-伞形科',
        children: [
          { label: '甘肃岷县' },
          { label: '采收加工：捆成小把，上棚以烟火慢慢熏干。根上端（归头），主根（归身）、支根（归尾），全体（全归）' },
          { label: '支根3～5条或更多；质柔韧；有裂隙及多数棕色点状分泌腔；香气浓郁、味甘、辛、微苦。' },
          { label: '以主根粗长、油润、外皮色黄棕、断面色黄白、气味浓郁者为佳。' },
          { label: '柴性大、干枯无油或断面呈绿褐色者不可药用' },
          { label: '甘肃山民要回家，回家之后眼熏瞎，香气浓郁甘辛苦' },
        ]
      },
      {
        label: '羌活',
        children: [
          { label: '羌活（蚕羌、竹节羌），宽叶羌活（大头羌、条羌）根及根茎' },
          { label: '竹节蚕宝抢着活 心宽体胖很大条' },
          { label: '蚕羌：节间缩短， 呈紧密隆起的环状，形似蚕' },
          { label: '竹节羌：节间延长，形如竹节状。' },
          { label: '易折断，断面不平整，有多数裂隙，皮部黄棕色至暗棕色，油润，有棕色油点（朱砂点） ，木部黄白色，射线明显，髓部黄色至黄棕色。气香，味微苦而辛' },
        ]
      },
      {
        label: '川芎-伞形科-根茎',
        children: [
          { label: '不规则结节状拳形团块；表面有隆起的轮节；断面有油室；形成层环波状；纵切片边缘不整齐（蝴蝶片 ）；气浓香，稍有麻舌感，微回甜' },
          { label: '以个大、质坚实、断面黄白、油性大、香气浓者为佳' }
        ]
      },
      {
        label: '藁本',
        children: [
          { label: '藁本、辽藁本 根茎及根' },
          { label: '根茎呈不规则结节状圆柱形' },
          { label: '表面棕褐色或暗棕色，粗糙，有纵皱纹，上侧残留数个凹陷的圆形茎基，下侧有多数点状突起的根痕及残根。体轻，质较硬，易折断，断面黄色或黄白色，纤维状' },
          { label: '气浓香，味辛、苦、微麻' },
          { label: '口诀：老高长得张牙舞爪，凸凹不平。' },
        ]
      },
      {
        label: '防风——三级保护',
        children: [
          { label: '伞形科 防风 根' },
          { label: '东北、内蒙古（关防风）' },
          { label: '根头部有明显密集环纹：蚯蚓头' },
          { label: '断面有裂隙，散生黄棕色油点' },
          { label: '以条粗壮，断面皮部色浅棕，木部浅黄色者为佳' },
          { label: '防风辛甘最去风,关上门来为防风,断面油点蚯蚓头' },
        ]
      },
      {
        label: '柴胡VS银柴胡',
        children: [
          { label: '柴胡（北柴胡）:伞形科柴胡-下部分枝-硬韧-纤维性-微香' },
          { label: '柴胡（南柴胡）:伞形科狭叶柴胡-多不分枝-软易断-无纤维性-败油气' },
          { label: '银柴胡:石竹科-砂眼、珍珠盘-硬脆-疏松，有裂隙-味甘' },
          { label: '石竹柴胡去相亲，银盆大脸看傻眼，硬气十足北上闯，遇到软语败南方' },
        ]
      },
      {
        label: '北沙参-伞形科',
        children: [
          { label: '伞形科珊瑚菜根' },
          { label: '长15～45cm，质脆，易折断，气特异，味微甘' },
          { label: '瘦瘦长长北沙参,气味特异味微甘' }
        ]
      },
      {
        label: '龙胆vs秦艽——龙胆科',
        children: [
          {
            label: '龙胆根及根茎',
            children: [
              { label: '龙胆（关龙胆：条叶龙胆、龙胆、三花龙胆）坚龙胆（滇龙胆）' },
              { label: '根多、细长，气微，味甚苦' },
              { label: '以条粗长、色黄或黄棕色为佳' },
            ]
          },
          {
            label: '秦艽根',
            children: [
              { label: '秦艽/麻花艽（秦艽、麻花秦艽、粗茎秦艽）:发汗或不发汗，晒干' },
              { label: '小秦艽：趁鲜搓去黑皮，晒干' },
              { label: '秦艽：上粗下细，扭曲不直，气特异，味苦，微涩' },
              { label: '以质实、色棕黄、气味浓厚者为佳。' }
            ]
          },
        ]
      },
      {
        label: '萝藦三杰——徐长卿、白前、白薇',
        children: [
          { label: '萝藦科，有三杰' },
          { label: '徐长卿，须细长，气香味辛凉' },
          { label: '鹅管白前节中空，气微味微甜' },
          { label: '白薇簇生细长根，气微味微苦' },
        ]
      },
      {
        label: '紫草',
        children: [
          { label: '紫草科 新疆紫草（软紫草）或内蒙紫草 根' },
          { label: '表面紫红色或紫褐色，顶端有茎残基；皮部疏松，呈条形片状，常10余层重叠，易剥落；木部较小。' },
        ]
      },
      {
        label: '丹参',
        children: [
          { label: '唇形科丹参干燥根及根茎' },
          { label: '根数条，长圆柱形，略弯曲，有的分枝并具须状细根，表面棕红色或暗棕红色，粗糙，具纵皱纹。老根外皮疏松，多显紫棕色，常呈鳞片状剥落' },
          { label: '质硬而脆，断面疏松，有裂隙或略平整而致密，皮部棕红色，木部灰黄色或紫褐色，导管束黄白色，呈放射状排列。气微，味微苦涩。栽培品较粗壮。' },
          { label: '以条粗壮、紫红者为佳' },
        ]
      },
      {
        label: '黄芩-唇形科',
        children: [
          { label: '质硬而脆，易折断；断面黄，中心红棕，老根中心呈枯朽状或中空，暗棕或棕黑；气微，味苦；栽培品：较细长，多有分枝' },
          { label: '外表皮黄棕色至棕褐色，切面黄棕色或黄绿色，具放射状纹理' },
          { label: '以条长、质坚实、色黄者为佳' },
        ]
      },
      {
        label: '玄参——玄参科，浙八味-发汗',
        children: [
          { label: '坚实不易断' },
          { label: '黑色，微有光泽' },
          { label: '气特异似焦糖' },
          { label: '以条粗壮、坚实，断面乌黑色者为佳。' },
        ]
      },
      {
        label: '地黄——玄参科，四大怀药',
        children: [
          { label: '鲜地-新鲜块根-除去芦头，须根，泥沙，洗净-易断-皮部淡黄白可见橘红色油点，木部黄白-微甜、微苦' },
          { label: '鲜地-以粗壮、色红黄者为佳' },
          { label: '地黄-生地-干燥块根-烘焙至内部变黑，八成干捏成团块-软韧不易折断-棕黄色至黑色或乌黑，有光泽-微甜' },
          { label: '地黄-以块大、体重、断面乌黑色者为佳' },
        ]
      },
      {
        label: '胡黄连VS黄连',
        children: [
          { label: '胡黄连-玄参科-藏云川-表面有较密环状节，木部有4～10个类白色维管束排列成环-味极苦' },
          { label: '黄连-味连-重庆-多分枝，集聚成簇，形如鸡爪，节间平滑如茎秆，称“过桥”' },
        ]
      },
      {
        label: '巴戟天VS茜草——茜草科',
        children: [
          { label: '巴戟天形似连珠，皮部横向断离露出木部；断面皮部易与木部剥离。' },
          { label: '巴戟天——以粗壮、断面紫色者为佳' },
          { label: '茜草-结节状，皮部易剥落，露出黄红色木部，久嚼刺舌' },
        ]
      },
      {
        label: '续断——川续断科-发汗',
        children: [
          { label: '切面皮部墨绿色或棕褐色；木部灰黄色或黄褐色' },
          { label: '可见放射状排列的导管束纹；形成层部位多有深色环' },
        ]
      },
      {
        label: '天花粉-葫芦科',
        children: [
          { label: '葫芦科栝楼或双边栝楼的干燥根' },
          { label: '断面富粉性，横切面可见黄色小孔（导管），略呈放射状排列。纵切面可见黄色条纹状木质部。味微苦。' },
          { label: '以色白、质坚实、粉性足者为佳' },
        ]
      },
      {
        label: '桔梗——桔梗科VS板蓝根',
        children: [
          { label: '有的分枝，略扭曲' },
          { label: '皮部黄白，木部淡黄（金井玉栏）' },
          { label: '桔梗——以根肥大、色白、质坚实、味苦者为佳。' },
          { label: '板蓝根——以条长、粗大、体实者为佳' },
          { label: '十字花科小板蓝,瘦长扭曲大头膨,金井玉栏身上穿,尝到甜头忘记苦,后来居上小桔梗,裂隙增多木部宽' },
        ]
      },
      {
        label: '党参——桔梗科',
        children: [
          { label: '党参——东党：东北，野生；潞党：山西，栽培' },
          { label: '素花党参（西党参）：甘肃、四川' },
          { label: '川党参:四川' },
          { label: '细、长，根头有多数疣状突起茎痕及芽，茎痕顶端有凹下圆点（狮子头）' },
          { label: '特殊香气、微甜' },
          { label: '以条粗壮、质柔韧、气味浓、嚼之无渣者为佳。' },
        ]
      },
      {
        label: '南沙参VS北沙参',
        children: [
          { label: '南沙参-桔梗科轮叶沙参、沙参 根' },
          { label: '北沙参——伞形科 珊瑚菜根' },
          { label: '南沙参 质松泡，多裂隙——以色白、根粗细均匀、肥壮、味甘淡者为佳' },
          { label: '北沙参：长15～45cm，质脆，易折断，气特异，味微甘' },
          { label: '瘦瘦长长北沙参，气味特异珊瑚根，跑到南方爱桔梗，裂隙增多质松泡' },
        ]
      },
      {
        label: '木香VS川木香——菊科',
        children: [
          { label: '木香（云木香）-圆柱或半圆柱，断面形成层环棕色，有放射状纹理及散在的褐色点状油室' },
          { label: '木香（云木香）-坚实，体重，不易折断' },
          { label: '木香（云木香）-气香特异味微苦' },
          { label: '川木香 川木香、灰毛川木香' },
          { label: '川木香-圆柱或有纵槽的半圆柱形；外皮脱落呈丝瓜络状；根头偶有黑色发黏的胶状物（油头）；有深黄色稀疏油点及裂隙' },
          { label: '川木香-硬脆，较轻，易折断' },
          { label: '川木香-气微香，味苦，嚼之粘牙' },
          { label: '油头小伙川木香' },
        ]
      },
      {
        label: '白术——浙八味',
        children: [
          { label: '不规则肥厚团块；断面：棕黄色的点状油室散在；气清香，味甘，微辛，嚼之略带黏性' },
          { label: '年幼白术肥又厚，苍术爱美点朱砂' },
        ]
      },
      {
        label: '苍术——菊科',
        children: [
          { label: '茅苍术-江苏-呈不规则连珠状或结节状圆柱形，略弯曲，表面灰棕' },
          { label: '茅苍术-橙黄色或棕红色油点（朱砂点），暴露稍久，可析出白色细针状结晶' },
          { label: '茅苍术-气香特异，味微甘、辛、苦' },
          { label: '北苍术-华北，西北-呈疙瘩块状或结节状圆柱形，表面黑棕' },
          { label: '北苍术-散有黄棕色油点' },
          { label: '北苍术-香气淡，味辛、苦' },
          { label: '苍术——个大，质坚实，断面朱砂点多，香气浓' },
          { label: '白术——个大，质坚实，断面色黄白、香气浓' },
        ]
      },
      {
        label: '紫菀',
        children: [
          { label: '根茎簇生多数细根，多编成辫状' },
        ]
      },
      {
        label: '三棱——黑三棱科',
        children: [
          { label: '块茎；有刀削痕；须根痕小点状，略呈横向环状排列；嚼之微有麻辣感' },
          { label: '饮片：切面细筋脉点明显' },
          { label: '体重、质坚、去净外皮、表面黄白色' },
          { label: '口诀：沉香会武术，三刀削苏木' },
        ]
      },
      {
        label: '泽泻——泽泻科',
        children: [
          { label: '有不规则的横向环状浅沟纹及多数细小突起的须根痕；断面粉性，有多数细孔' },
        ]
      },
      {
        label: '香附——莎草科',
        children: [
          { label: '莎草科莎草干燥根茎' },
          { label: '燎去毛须，置沸水中略煮或蒸透后晒干，或燎后直接晒干' },
          { label: '呈纺锤形，有略隆起的环节。断面内皮层环纹明显。气香' },
        ]
      },
      {
        label: '天南星VS半夏——天南星科，块茎，有毒',
        children: [
          { label: '天南星-天南星、异叶天南星或东北天南星_扁球形，直径1.5～6.5cm' },
          { label: '天南星-气微辛，味麻辣' },
          { label: '半夏-半夏_类球形，稍偏斜，直径0.7～1.6cm' },
          { label: '半夏-气微，味辛辣,麻舌而刺喉' },
          { label: '二者都顶端有凹陷的茎痕，周围密布麻点状根痕;断面白，粉性' },
          { label: '半夏去看天南星，麻点辛辣麻舌粉；半大小子很刺喉' },
          { label: '天南星——个大、色白、粉性足。' },
          { label: '半夏——外皮色白，上端圆平、中心凹陷，质坚实，断面洁白或白色、粉质细腻，气微，味辛辣、麻舌而刺喉者' },
        ]
      },
      {
        label: '石菖蒲——天南星科，根茎',
        children: [
          { label: '有疏密不均的环节；叶痕呈三角形，左右交互排列。有的有鳞毛状叶基残余；切面有明显环纹及' },
          { label: '条粗，断面色类白、香气浓郁' },
          { label: '半夏去看天南星，麻点辛辣麻舌粉；遇到水边石菖蒲，交互排列有毛鳞' },
        ]
      },
      {
        label: '百部',
        children: [
          { label: '百部科 直立百部、蔓生百部或对叶百部 块根' },
          { label: '药材：直立百部：呈纺锤形，上端较细长，皱缩弯曲，长5～12cm' },
          { label: '质脆，易折断，断面平坦，角质样（略烫或蒸至无白心）。' },
          { label: '质脆、断面平坦、角质样、皮部较宽' },
          { label: '百部的彩图口诀：“海纳百川”' },
        ]
      },
      {
        label: '川贝母——百合科，鳞茎，三级保护',
        children: [
          {
            label: '川贝母暗紫贝母甘肃贝母',
            children: [
              {
                label: '松贝-外层鳞叶2瓣，大小悬殊，大瓣紧抱小瓣，未抱部分呈新月形（怀中抱月'
              },
              { label: '青贝-外层鳞叶2瓣，大小相近，相对抱合，顶端开裂' }
            ]
          },
          {
            label: '梭砂贝母',
            children: [
              { label: '炉贝（四大藏药）-有的具棕色斑点（虎皮斑），外层鳞叶2瓣，大小相近，相对抱合，顶端多开裂而略尖' }
            ]
          },
          {
            label: '太白贝母瓦布贝母',
            children: [
              { label: '多为栽培品-有的具浅黄斑点，鳞叶2瓣大小相近，顶端多开裂较平' }
            ]
          },
          { label: '松贝——色白，外形呈“怀中抱月”，质硬而脆，断面白色，富粉性。气微，味微苦' },
          { label: '淀粉粒甚多（多为单粒），层纹隐约可见' }
        ]
      },
      {
        label: '浙贝母——浙八味',
        children: [
          {
            label: '大贝：大者除去芯芽，为鳞茎外层单瓣鳞叶，略呈新月形，直径2～3.5cm',
          },
          {
            label: '珠贝：为完整的鳞茎，呈扁圆形，直径1～2.5cm',
          },
          {
            label: '撞擦，除去外皮，拌以煅过的贝壳粉，吸去擦出的浆汁',
          },
          { label: '色白，质脆，易折断，断面粉白色，富粉性' },
          { label: '淀粉粒甚多，多为单粒，层纹不明显' },
        ]
      },
      {
        label: '黄精VS玉竹——百合科',
        children: [
          {
            label: '黄精-置沸水中略烫或蒸至透心',
          },
          {
            label: '黄精-外形肥大、质硬而韧、切面略呈角质样、 淡黄色至黄棕色、嚼之有黏性，味苦者不可药用',
          },
          {
            label: '玉竹-揉搓晒干或蒸透后揉至半透明，晒干',
          },
          {
            label: '玉竹-具纵皱纹和微隆起的环节，断面半透明角质或颗粒性，味甘，嚼之发黏',
          },
        ]
      },
      {
        label: '重楼',
        children: [
          {
            label: '百合科 云南重楼或七叶一枝花 根茎',
          },
          {
            label: '结节状，密具层状突起粗环纹；一面结节明显，有茎痕，一面有须根痕',
          },
          {
            label: '断面平坦，白色至浅棕色，粉性或角质样',
          },
        ]
      },
      {
        label: '土茯苓',
        children: [
          {
            label: '百合科 光叶菝葜 根茎',
          },
          {
            label: '饮片：呈长圆形或不规则的薄片，边缘不整齐。切面黄白色或红棕色，粉性，可见点状维管束及多数小亮点；以水湿润后有黏滑感。气微，味微甘、涩。切面粉性，折断时有粉尘飞扬，',
          },
        ]
      },
      {
        label: '麦冬、山麦冬VS天冬VS太子参——块根',
        children: [
          {
            label: '品名-长度-质地-断面-中柱',
          },
          {
            label: '麦冬-1.5～3-质柔韧-半透明-中柱细小',
          },
          {
            label: '山麦冬-1.2～3 -质柔软-角质样-中柱细小',
          },
          {
            label: '天冬-5～18-质硬或柔润，有黏性-角质样-中柱黄白色',
          },
          {
            label: '太子参-3～10-质硬而脆-角质样-无',
          },
          {
            label: '麦冬——个肥大、身干、色黄白、半透明、质柔韧、味甜，嚼之发黏',
          },
          {
            label: '天冬——条粗壮、色黄白、半透明',
          },
        ]
      },
      {
        label: '知母',
        children: [
          {
            label: '百合科 知母 根茎',
          },
          {
            label: '不除外皮者称毛知母，除去外皮者称知母肉',
          },
          {
            label: '一端有浅黄色的茎叶残痕（金包头），嚼之带黏性',
          },
        ]
      },
      {
        label: '山药VS天花粉',
        children: [
          { label: '山药-薯蓣科-根茎-粉性-微酸，嚼之发黏' },
          { label: '天花粉-葫芦科 栝楼或双边栝楼-根-粉性，黄色木质部小孔明显，放射状排列-微苦' },
        ]
      },
      {
        label: '射干',
        children: [
          { label: '鸢尾科 射干 根茎' },
          { label: '结节状；表面有排列较密的横向环纹。上面有数个圆盘状凹陷的茎痕，偶有茎基残存；下面有残留的细根及根痕。断面黄色，颗粒性（筋脉点、筋脉纹）。' },
        ]
      },
      {
        label: '郁金VS莪术VS姜黄——姜科',
        children: [
          {
            label: '郁金-块根-质坚实，横断面灰棕色， 角质样；内皮层环明显。气微香',
            children: [
              { label: '温郁金-温郁金(原植物名)' },
              { label: '黄丝郁金-姜黄' },
              { label: '绿丝郁金-蓬莪术' },
              { label: '桂郁金-广西莪术' },
              { label: '质坚实、外皮皱纹细、断面色黄。传统认为黄丝郁金质量最佳' },
            ]
          },
          {
            label: '莪术-根茎-有须根痕、芽痕、茎痕，有的可见刀削痕，断面灰褐色至蓝褐色，蜡样，气微香',
            children: [
              { label: '温莪术-温郁金' },
              { label: '莪术-蓬莪术' },
              { label: '莪术-广西莪术' },
              { label: '个大、质坚实、气香' },
            ]
          },
          { label: '姜黄-根茎-姜黄-有的具短叉状分枝，断面棕黄色至金黄色气香特异' },
          { label: '姜黄-质坚实、断面金黄、香气浓厚' },
        ]
      },
      {
        label: '天麻',
        children: [
          { label: '兰科 天麻 块茎' },
          { label: '四川、云南、贵州' },
          { label: '除去地上苗茎，蒸透心，敞开低温干燥' },
          { label: '表面有点状突起（潜伏芽）排列成多轮横环纹，有时可见棕褐色菌索' },
          { label: '春麻：顶端有残留茎基，冬麻：红棕色鹦哥嘴状顶芽（红小辫）' },
          { label: '底端有圆脐形疤痕；④质坚硬，不易折断，断面角质样。' },
          { label: '以质地坚实沉重、有鹦哥嘴、断面明亮、 无空心者（冬麻）质佳；质地轻泡、有残留茎基、断面色晦暗、空心者（春麻）质次' },
        ]
      },
      {
        label: '白及',
        children: [
          { label: '置沸水中煮或蒸至无白心' },
          { label: '四多有2～3个爪状分枝' },
          { label: '质硬，不易折断，断面角质样' },
          { label: '气微，味苦，嚼之有黏性。' },
          { label: '个大、饱满、色白、半透明、质坚实。' },
        ]
      },
    ]
  },
  {
    label: '茎木类中药13/11',
    children: [
      {
        label: '茎类中药',
        children: [
          {
            label: '茎藤',
            children: [
              {
                label: '木通-木通科',
                children: [
                  { label: '外皮有不规则裂纹或纵沟纹，皮孔突起，节膨大，断面皮部可见淡黄色颗粒状小点，木部放射状纹理，髓小有时中空' },
                  { label: '条匀、断面色黄' },
                ]
              },
              {
                label: '川木通-毛茛科',
                children: [
                  { label: '有纵向凹沟及棱线，节多膨大，残余皮部易撕裂，木部有放射状纹理及裂隙，其间布满细孔（导管），髓小' }
                ]
              },
              {
                label: '大血藤-木通科-大血藤',
                children: [
                  { label: '皮部呈红棕色，有数处向内嵌入黄白色木部，木部有多数细孔状导管，射线呈放射状排列（车轮纹）' },
                  { label: '条匀，粗如拇指' },
                ]
              },
              {
                label: '鸡血藤-豆科-密花豆',
                children: [
                  { label: '韧皮部树脂状分泌物呈红棕色至黑棕色，与木部相间排列呈数个同心性椭圆形环或偏心性半圆形环，髓偏向一侧' },
                  { label: '树脂状分泌物多' }
                ]
              },
            ]
          },
          {
            label: '茎枝',
            children: [
              { label: '桂枝' },
              { label: '桑枝' },
              {
                label: '槲寄生-桑寄生科',
                children: [
                  { label: '茎枝2～5叉状分枝，节膨大，节上有分枝或枝痕。体轻，质脆，易折断，断面不平坦，皮部黄色，木部色较浅，射线放射状，髓部常偏向一边' },
                  { label: '枝嫩，色黄绿，叶多' },
                ]
              },
              {
                label: '桑寄生（带叶茎枝）',
                children: [
                  { label: '表面红褐色或灰褐色，具细纵纹，有多数细小突起的棕色皮孔；质坚硬，断面不整齐，皮部红棕色，木部色较浅' },
                ]
              },
              {
                label: '钩藤',
                children: [
                  { label: '茜草科　钩藤、大叶钩藤、毛钩藤、华钩藤、无柄果钩藤带钩茎枝' },
                  { label: '①红棕色至紫红色；②多数枝节上对生两个向下弯曲的钩（不育花序梗），或仅一侧有钩；钩基部枝上可见叶柄脱落后的窝点状痕迹和环状托叶痕。' },
                  { label: '双钩，茎细，钩结实，光滑、色紫红、无枯枝为佳' },
                ]
              },
            ]
          },
          {
            label: '棘刺：皂角刺'
          },
          {
            label: '茎髓',
            children: [
              {
                label: '通草',
                children: [
                  { label: '五加科 通脱木茎髓' },
                  { label: '体轻，质松软，稍有弹性，易折断。断面平坦，显银白色光泽，中部空心或半透明圆形的薄膜，纵剖面薄膜呈梯状排列——条粗，色洁白，有弹性' },
                ]
              },
              { label: '灯心草' },
            ]
          },
          {
            label: '鲜用茎',
            children: [
              { label: '石斛VS铁皮石斛——兰科' },
              { label: '蓝天白云去看石斛。（蓝=兰科，天=天麻，白=白及）' },
              {
                label: '石斛-广西',
                children: [
                  { label: '来源：金钗石斛、霍山石斛、鼓槌石斛或流苏石斛栽培品及其同属植物近似种-新鲜或干燥茎' },
                  { label: '干石斛：为扁圆柱形或圆柱形段，表面金黄色、绿黄色或棕黄色，有节，有光泽，有深纵沟或纵棱，切面有筋脉点——色金黄、有光泽、质柔韧' },
                  { label: '鲜石斛：节明显，色较深，节上有膜质叶鞘。肉质多汁，易折断。气微，味微苦而回甜，嚼之有黏性' },
                ]
              },
              {
                label: '铁皮石斛-云南',
                children: [
                  { label: '铁皮石斛干燥茎' },
                  { label: '铁皮枫斗（耳环石斛）：螺旋形或弹簧状，通常2～6个旋纹' },
                  { label: '铁皮石斛：圆柱形的段，长短不等' },
                ]
              }
            ]
          },

        ]
      },
      {
        label: '木类药材-形成层以内的部分',
        children: [
          { label: '边材（液材）' },
          {
            label: '心材',
            children: [
              {
                label: '沉香-瑞香科',
                children: [
                  { label: '白木香 含树脂的木材' },
                  { label: '表面凹凸不平，有刀削痕，可见黑褐色树脂与黄白色木部相间的斑纹。气芳香，味苦。燃烧时有浓烟及强烈香气，并有黑色油状物渗出' },
                  { label: '色黑，质坚硬，油性足，香气浓而持久、能沉水' },
                ]
              },
              {
                label: '苏木-豆科',
                children: [
                  { label: '苏木-心材' },
                  { label: '表面黄红色至棕红色，具刀削痕。断面年轮明显。饮片有的可见带亮星的髓部。气微。取小段放入热水中，水被染成桃红色' },
                ]
              },
              {
                label: '降香-豆科',
                children: [
                  { label: '降香檀 树干和根的心材' },
                  { label: '切面纹理致密。微有香气，点燃则香气浓烈，有油状物流出，灰烬白色' },
                  { label: '色紫红、质坚硬、富油性、香气浓' },
                ]
              },
              { label: '檀香' },
            ]
          },
        ]
      },
      {
        label: '海风藤味苦，辛辣感'
      },
      {
        label: '清风藤味苦，无辛辣'
      },
      {
        label: '海风铺面很辛辣，轻风拂面不辛辣'
      },
    ]
  },
  {
    label: '皮类中药',
    children: [
      {
        label: '桑白皮',
        children: [
          { label: '桑科　桑　根皮' },
          { label: '纤维性强，难折断，易纵向撕裂，撕裂时有粉尘飞扬。气微，味微甘' },
          { label: '色白，皮厚，柔韧、粉性足' },
        ]
      },
      {
        label: '牡丹皮',
        children: [
          { label: '毛茛科　牡丹　根皮' },
          { label: '筒状或半筒状' },
          { label: '栓皮脱落处粉红色，内表面常见发亮的结晶（丹皮酚），断面平坦，气芳香，味微苦涩' },
          { label: '条粗长、皮厚、无木心、断面粉白色、粉性足、结晶多、香气浓者' },
        ]
      },
      {
        label: '厚朴',
        children: [
          { label: '木兰科　厚朴及凹叶厚朴' },
          { label: '干皮、枝皮和根皮' },
          { label: '根皮及枝皮阴干；干皮置沸水中微煮，发汗至内表面变紫褐色或棕褐色时，再蒸软，取出，卷成筒状，干燥。' },
          { label: '干皮：卷筒状或双卷筒状。外表面灰棕色或灰褐色，有明显椭圆形皮孔或纵皱纹，刮去粗皮者显黄棕色' },
          { label: '内表面紫棕色或深紫褐色，较平滑，具细密纵纹，划之显油痕' },
          { label: '断面颗粒性，外层灰棕色，内层紫褐色或棕色，有油性，有时可见多数小亮星（厚朴酚、和厚朴酚）。气香，味辛辣、微苦' },
          { label: '干皮：筒朴 近根部一端展开——靴筒朴' },
          { label: '厚朴——皮厚、肉细、油性足、内表面紫棕色，断面有发亮结晶物、香气浓、味苦辛微甜、嚼之残渣少' },
          { label: '不规则石细胞、油细胞、壁厚呈波浪状或锯齿状的纤维' },
        ]
      },
      {
        label: '肉桂',
        children: [
          { label: '樟科　肉桂　树皮' },
          { label: '4～5月/9～10月采收' },
          { label: '加工品：桂通/官桂（5～6年生）、企边桂（＞10年）、板桂（老树最下部）、桂碎（碎块）' },
          { label: '呈槽状或卷筒状，外表面灰棕色，稍粗糙，有不规则的细皱纹及横向突起的皮孔，有时可见灰白色的斑纹' },
          { label: '内表面红棕色，较平坦，有细纵纹，划之显油痕' },
          { label: '断面不平坦，外层棕色而较粗糙，内层红棕色而油润，中间有1条黄棕色的线纹。气香浓烈，味甜、辣。' },
          { label: '不破碎、体重、外皮细、肉厚、断面紫红色、油性大、香气浓、味甜而辛、嚼之渣少' },
          { label: '马蹄形石细胞（三面增厚、一面菲薄）、油细胞' },
          { label: '厚朴肉桂香气浓,油性太大划油痕' },
          { label: '厚朴发汗内憋紫,肉桂断面有线纹' },
          { label: '厚朴辛辣能行气,肉桂甜辣温肾阳' },
        ]
      },
      {
        label: '杜仲-发汗',
        children: [
          { label: '外表面可见明显的斜方形皮孔。断面有细密、银白色、富弹性橡胶丝相连' },
          { label: '气微，味稍苦' },
          { label: '皮厚、块大、去净粗皮、内表面暗紫色、 断面银白色，橡胶丝多' },
        ]
      },
      {
        label: '合欢皮',
        children: [
          { label: '豆科　合欢　树皮' },
          { label: '密生明显的椭圆形横向皮孔，棕色或棕红色，偶有突起的横棱或较大的圆形枝痕，常附有地衣斑。断面呈纤维性片状。' },
          { label: '气微香，味淡、微涩、稍刺舌，而后喉头有不适感' },
        ]
      },
      {
        label: '黄柏VS关黄柏——树皮',
        children: [
          {
            label: '黄柏（川黄柏）',
            children: [
              { label: '芸香科，黄皮树' },
              { label: '外表面可见皮孔痕，内表面具细密纵沟纹，断面纤维性，深黄色,呈裂片状分层' },
              { label: '气微，味极苦，嚼之有黏性，可使唾液染成黄色' },
              { label: '皮厚，断面色黄' },
            ]
          },
          {
            label: '关黄柏',
            children: [
              { label: '芸香科，黄果' },
              { label: '外表面有不规则纵裂纹，皮孔痕小而少见。断面纤维性，有的呈裂片状分层，鲜黄色或黄绿色。' },
              { label: '气微，味极苦，嚼之有黏性' },
            ]
          }, {
            label: '鲜黄色分枝状石细胞、鲜黄色纤维及晶纤维、草酸钙方晶'
          }
        ]
      },
      {
        label: '白鲜皮VS香加皮VS地骨皮——根皮',
        children: [
          {
            label: '白鲜皮-芸香科-白鲜',
            children: [
              { label: '折断时粉尘飞扬；剥去外层，迎光可见闪烁小亮点（土茯苓）；有羊膻气，味微苦' },
            ]
          },
          {
            label: '香加皮-萝藦科-杠柳',
            children: [
              { label: '栓皮松软常呈鳞片状，易剥落。有特异的香气，味苦' },
              { label: '条粗、皮厚、呈卷筒状、香气浓、味苦' },
            ]
          }, {
            label: '地骨皮-茄科-枸杞或宁夏枸杞',
            children: [
              { label: '外表面易成鳞片状剥落。气微，味微甘而后苦' },
              { label: '块大、肉厚、无木心' },
            ]
          },
        ]
      },
      {
        label: '苦楝皮',
        children: [
          { label: '楝科 川楝或楝的干燥树皮和根皮' },
          { label: '呈不规则板片状、槽状或半卷筒状，长宽不一。外表面灰棕色或灰褐色，粗糙，有交织的纵皱纹和点状灰棕色皮孔，除去粗皮者淡黄色；内表面类白色或淡黄色。' },
          { label: '质韧，不易折断，断面纤维性，呈层片状，易剥离。气微，味苦。' },
        ]
      },
      {
        label: '秦皮',
        children: [
          { label: '木犀科　苦枥白蜡树、白蜡树、尖叶白蜡树或宿柱白蜡树　枝皮或干皮' },
          { label: '外表面灰白色、灰棕色至黑棕色或相间呈斑状，平坦或稍粗糙，并有灰白色圆点状皮孔及细斜皱纹，有的具分枝痕。' },
          { label: '浸出液在日光下显碧蓝色荧光。' },
        ]
      },
    ]
  },
  {
    label: '叶类中药',
    children: [
      {
        label: '侧柏叶',
        children: [
          { label: '枝梢及叶' },
          { label: '叶细小鳞片状，交互对生，贴伏于枝上' },
        ]
      },
      {
        label: '淫羊藿-小檗科',
        children: [
          { label: '顶生小叶基部心形，两侧小叶较小，偏心形，外侧较大，呈耳状，边缘刺毛状锯齿，革质' },
          { label: '口诀：小羊有爱心' },
          { label: '饮片：呈丝片状，上表面绿色，黄绿色或浅黄色，下表面灰绿色，网脉明显，近革质' },
        ]
      },
      {
        label: '大青叶VS蓼大青叶',
        children: [
          {
            label: '大青叶-十字花科-菘蓝',
            children: [
              { label: '基部狭窄下延至叶柄成翼状，上表面暗灰绿色，有的可见色较深稍突起的小点' },
              { label: '口诀：大青叶会飞。' },
              { label: '叶片完整，色暗灰绿' },
            ]
          },
          { label: '蓼大青叶-廖科-蓼蓝-蓝绿或蓝黑色，偶带膜质托叶鞘' },
        ]
      },
      {
        label: '枇杷叶-蔷薇科　枇杷',
        children: [
          { label: '先端尖，基部楔形。边缘具疏锯齿，近基部全缘。上表面较光滑，下表面密被黄色绒毛' },
          { label: '主脉突出。革质' },
          { label: '口诀：黄毛丫头弹琵琶，累了歇歇' },
        ]
      },
      {
        label: '番泻叶——豆科　小叶',
        children: [
          {
            label: '狭叶番泻-印度，丁内为利-印度，埃及和苏丹',
            children: [
              { label: '下表面无毛或近无毛，革质，气微弱而特异，味微苦，稍有黏性' },
              { label: '狭叶番泻：开花前摘叶，阴干分级，水压机打包' }
            ]
          },
          {
            label: '尖叶番泻-埃及-埃及，我国广东，海南云南-',
            children: [
              { label: '两面均有细短毛茸' },
              { label: '9月间果实将成熟时，剪下枝条，摘取叶片晒干，按全叶与碎叶分别包装。' }
            ]
          },
          { label: '叶片大、完整、色绿、梗少，无泥沙杂质' }

        ]
      },
      {
        label: '罗布麻叶',
        children: [
          { label: '夹竹桃科　罗布麻' },
          { label: '有小芒尖，边缘具细齿，常反卷，两面无毛' },
          { label: '口诀：罗妈妈很忙。' },
        ]
      },
      {
        label: '紫苏叶',
        children: [
          { label: '唇形科　紫苏　叶（或带嫩枝）' },
          { label: '边缘具圆锯齿。两面紫色或上表面绿色，下表面紫色，疏生灰白色毛，下表面有多数凹点状的腺鳞。气清香，味微辛' },
          { label: '叶完整、色紫、气清香' },
        ]
      },
      {
        label: '艾叶',
        children: [
          { label: '菊科　艾' },
          { label: '羽状深裂；裂片椭圆状披针形，边缘有不规则的粗锯齿。上表面有稀疏的柔毛和腺点。下表面密生灰白色绒毛。气清香，味苦' },
          { label: '口诀：哎呀妈呀，上下全是毛。' },
          { label: '显微：非腺毛：T形毛、单列性非腺毛；腺毛：表面观鞋底形' },
        ]
      },

    ]
  },
  {
    label: '花类中药',
    children: [
      { label: '鉴别要点：完整的花，花序，雄蕊雌蕊，花粉粒' },
      {
        label: '辛夷',
        children: [
          { label: '【来源】木兰科　望春花、玉兰或武当玉兰　花蕾' },
          { label: '【产地】望春花、玉兰：河南；武当玉兰：湖北' },
          { label: '苞片外表面密被灰白色或灰绿色有光泽的长茸毛（毛笔头）' },
          { label: '花蕾完整、肉瓣紧密、无枝梗、香气浓' },
        ]
      },
      {
        label: '槐花',
        children: [
          { label: '【来源】豆科　槐　花及花蕾' },
          { label: '【性状】花萼钟状，花瓣5' },
          { label: '槐花——以干燥，色黄白，整齐不碎，无枝梗杂质为佳' },
          { label: '槐米——以未开放者为佳' },
        ]
      },
      {
        label: '丁香',
        children: [
          { label: '桃金娘科　丁香　花蕾' },
          { label: '坦桑尼亚、印度尼西亚、马来西亚' },
          { label: '略呈研棒状，覆瓦状抱合，富油性。萼筒圆柱状，上部有4枚三角状的萼片，十字状分开。质坚实，气芳香浓烈，味辛辣、有麻舌感' },
          { label: '个大、身干，色红棕，油性足，入水则萼管沉于水面下，香气浓郁' },
        ]
      },
      {
        label: '洋金花',
        children: [
          { label: '【来源】茄科　白花曼陀罗 花' },
          { label: '【性状】皱缩成条状，花萼呈筒状' },
        ]
      },
      {
        label: '金银花VS山银花——花蕾或带初开的花',
        children: [
          {
            label: '金银花',
            children: [
              { label: '忍冬科：忍冬' },
              { label: '呈棒状，上粗下细，略弯曲，密被短柔毛——花蕾多、色绿白、质柔软、气清香' },
            ]
          },
          {
            label: '山银花',
            children: [
              { label: '忍冬科：灰毡毛忍冬、红腺忍冬、华南忍冬或黄褐毛忍冬' },
              { label: '呈棒状而稍弯曲，总花梗集结成簇，开放者花冠裂片不及全长之半，质稍硬，手捏之稍有弹性' }
            ]
          },
          {
            label: '款冬花',
            children: [
              { label: '菊科　款冬　花蕾' },
              { label: '常单生或2～3个基部连生，撕开后可见白色茸毛' },
              { label: '蕾大、肥壮、色紫红鲜艳、花梗短' },
            ]
          },
          {
            label: '菊花——花朵完整、颜色鲜艳、气清香、梗叶少',
            children: [
              { label: '亳菊-安徽亳州、涡阳-倒圆锥形,舌状花白,管状花藏' },
              { label: '滁菊-安徽滁州-不规则球形,舌状花白,管状花多藏' },
              { label: '贡菊-安徽歙县,浙江德清-扁球形,舌状花白,管状花外露' },
              { label: '杭菊-浙江嘉兴桐乡-碟形,舌状花白或黄,管状花外露' },
              { label: '怀菊-河南-不规则球形,舌状花白或黄,管状花多藏' },
              { label: '亳菊圆锥杭菊碟，贡菊扁球，其他不规则' },
            ]
          },
          {
            label: '红花vs西红花',
            children: [
              {
                label: '红花',
                children: [
                  { label: '菊科-红花-花' },
                  { label: '为不带子房的管状花，表面红黄色或红色（由黄变红晨摘）。花冠筒细长，5裂成狭条形。雄蕊5。柱头长圆柱形，顶端微分叉' },
                  { label: '花冠长、色红鲜艳、无枝刺、柔软如茸毛' },
                ]
              },
              {
                label: '西红花-鸢尾科-番红花柱头',
                children: [
                  { label: '线形，三分枝，长约3cm，暗红色。无油润光泽。浸水中，可见橙黄色直线下降，逐渐扩散，水染成黄色，无沉淀。柱头有短缝；短时间内，针拨之不碎' },
                  { label: '体轻，质松软，柱头色暗红、黄色花柱少' },
                ]
              },
            ]
          },
        ]
      },
    ]
  },
  {
    label: '果实及种子类中药',
    children: [
      {
        label: '五味子vs南五味子-果实',
        children: [
          {
            label: '五味子（北）',
            children: [
              { label: '木兰科五味子' },
              { label: '表面油润，有的有“白霜”，种子肾形（滋肾宁心），果肉味酸；种子破碎后有香气、味辛微苦——粒大、果皮紫红、肉厚、柔润者' }
            ]
          },
          {
            label: '南五味子',
            children: [
              { label: '木兰科华中五味子' },
              { label: '表面干瘪，种子肾形' }
            ]
          },
        ]
      },
      {
        label: '葶苈子——同科不同属-种子',
        children: [
          {
            label: '南葶苈子',
            children: [
              { label: '十字花科播娘蒿' },
              { label: '外表棕色或红棕色，一端钝圆，另端微凹或较平截，味微辛并有黏性' },
              { label: '膨胀度：3' }
            ]
          },
          {
            label: '北葶苈子',
            children: [
              { label: '十字花科独行菜' },
              { label: '黏性较强，一端钝圆；另一端渐尖而微凹，凹处现白色点（种脐）' },
              { label: '膨胀度：12' }
            ]
          },
        ]
      },
      {
        label: '木瓜VS山楂VS乌梅——蔷薇科',
        children: [
          {
            label: '木瓜',
            children: [
              { label: '贴梗海棠近成熟果实' },
              { label: '外表面紫红或红棕，置沸水中烫至外皮灰白色，对半纵剖；味酸；饮片呈类月牙形薄片' },
              { label: '外皮抽皱、肉厚、内外紫红色、质坚实、味酸' },
            ]
          },
          {
            label: '山楂',
            children: [
              { label: '山里红或山楂成熟果实' },
              { label: '形片，外皮红，有灰白小斑点；中部横切片具5果核，多脱落中空；味酸、微甜' },
              { label: '片大、皮红、肉厚、核少' },
            ]
          },
          {
            label: '乌梅',
            children: [
              { label: '梅近成熟果实' },
              { label: '低温烘干闷至变黑，味极酸' },
              { label: '个大、核小、柔润、肉厚、不破裂、味极酸' },
            ]
          },
        ]
      },
      {
        label: '苦杏仁VS桃仁——种子',
        children: [
          {
            label: '苦杏仁',
            children: [
              { label: '蔷薇科-山杏、西伯利亚杏、东北杏或杏' },
              { label: '呈扁心形，左右不对称；尖端一侧有短种脐；子叶乳白色，富油性；味苦' },
              { label: '颗粒饱满、完整、味苦' },
            ]
          },
          {
            label: '桃仁', children: [
              { label: '蔷薇科桃或山桃' },
              { label: '呈扁长卵形，边缘较薄；尖端一侧有短线形种脐，子叶类白色，富油性。味微苦' },
              { label: '颗粒饱满、均匀、完整' },
            ]
          },
        ]
      },
      {
        label: '金樱子',
        children: [
          { label: '蔷薇科 金樱子 果实' },
          { label: '呈倒卵形，略似花瓶，全身被有突起的刺状小点；剥开外皮（花托），内壁及瘦果均有淡黄色绒毛。' },
          { label: '个大、肉厚、色红、有光泽、去净刺' },
        ]
      },
      {
        label: '沙苑子VS决明子',
        children: [
          {
            label: '沙苑子',
            children: [
              { label: '豆科 扁茎黄芪 种子' },
              { label: '肾形稍扁（补肾固精），嚼之有豆腥味' },
            ]
          },
          {
            label: '决明子',
            children: [
              { label: '豆科 决明或小决明 种子' },
              { label: '菱状方形或短圆柱形，子叶2片，呈“S”形折曲并重叠' },
              { label: '颗粒饱满、身干、无杂质、色绿棕' },
            ]
          },

        ]
      },
      {
        label: '补骨脂',
        children: [
          {
            label: '豆科 补骨脂 果实'
          },
          { label: '果实扁肾形（补肾壮阳），具细微网状皱纹' },
          { label: '子叶黄白色，具油性' },
          { label: '颗粒饱满均匀、色黑褐、纯净无杂质' },
        ]
      },
      {
        label: '枳壳',
        children: [
          { label: '芸香科 酸橙,未成熟果实' },
          { label: '半球形，外果皮有颗粒状突起，中果皮厚，气清香，味苦、微酸' },
          { label: '外皮色棕褐、果肉厚、质坚硬、香气浓' },
        ]
      },
      {
        label: '吴茱萸VS山茱萸',
        children: [
          {
            label: '吴茱萸-芸香科',
            children: [
              { label: '吴茱萸、石虎或疏毛 吴茱萸 近成熟果实' },
              { label: '呈球形或略呈五角状扁球形，有多数点状突起或凹下的油点。顶端有五角星状的裂隙。横切面可见子房5室。气芳香浓郁，味辛辣而苦' },
              { label: '粒小、饱满坚实、色绿、香气浓烈' },
            ]
          },
          {
            label: '山茱萸',
            children: [
              { label: '山茱萸科-山茱萸 成熟果肉' },
              { label: '文火烘或略烫后去果核，呈不规则片状或囊状。气微，味酸、涩、微苦' },
              { label: '个大皮肉厚、色紫红、质柔软、油润、无核、味酸' },
            ]
          },
        ]
      },
      {
        label: '巴豆',
        children: [
          { label: '大戟科 巴豆 果实' },
          { label: '呈卵圆形，一般具三棱，表面有纵线6条，顶端平截，基部有果梗痕' },
          { label: '破开果壳，可见3室，每室含种子1粒，种子有种阜' },
          { label: '种子饱满、种仁色黄白、无杂质' },
        ]
      },
      {
        label: '小茴香VS蛇床子——伞形科、双悬果',
        children: [
          {
            label: '小茴香',
            children: [
              { label: '分果背面有纵棱5条；香气特异，味微甜、辛' },
              { label: '以颗粒饱满、色黄绿、气香浓者' },
            ]
          },
          {
            label: '蛇床子',
            children: [
              { label: '分果背面有纵棱5条；气香，味辛凉，麻舌' }
            ]
          }
        ]
      },
      {
        label: '连翘——木犀科，果实',
        children: [
          { label: '表面有不规则的纵皱纹和多数突起的小斑点' },
          { label: '青翘（果实初熟带绿色采收）——色墨绿、不开裂' },
          { label: '老翘（果实熟透时采收）：色较黄、开裂或裂成两瓣，内表面具一纵隔——色黄、壳厚、无种子、纯净' },
        ]
      },
      {
        label: '女贞子——木犀科，果实',
        children: [
          { label: '呈卵形、椭圆形或肾形（滋肾补肝）；表面黑紫色或灰黑色，皱缩不平；内果皮具纵棱；种子肾形，紫黑色 ' },
        ]
      },
      {
        label: '马钱子',
        children: [
          { label: '印度、越南、泰国' },
          { label: '呈纽扣状圆板形' },
          { label: '表面密被灰棕或灰绿色绢状茸毛' },
          { label: '有丝样光泽' },
          { label: '味极苦' },
          { label: '个大饱满，质坚肉厚，表面灰棕色微带绿色，有细密毛茸，有光泽' },
        ]
      },
      {
        label: '菟丝子VS牵牛子——旋花科',
        children: [
          { label: '菟丝子=类球形，直径1～2mm；质坚实，不易以指甲压碎' },
          {
            label: '牵牛子',
            children: [
              { label: '似橘瓣状，表面灰黑或淡黄白色；有麻感' },
              { label: '水浸泡后种皮龟裂，手捻黏滑' },
              { label: '颗粒饱满、无果壳' },
            ]
          },
        ]
      },
      {
        label: '槟榔',
        children: [
          { label: '棕榈科 槟榔 种子' },
          { label: '海南、云南、广东' },
          { label: '表面有稍凹下的网状沟纹，底部中心有圆形凹陷的珠孔，旁边有疤痕状种脐' },
          { label: '断面可见棕色种皮与白色胚乳相间的大理石样花纹' },
          { label: '个大、体重、坚实、断面颜色鲜艳、无破裂' },
        ]
      },
      {
        label: '砂仁VS草果 VS豆蔻VS益智——姜科',
        children: [
          { label: '砂仁密生刺突起,草果沟多易撕裂,豆蔻辛凉似樟脑,凹凸很多才益智' },
          {
            label: '砂仁',
            children: [
              { label: '阳春砂、绿壳砂或海南砂' },
              { label: '密生刺状突起，气芳香而浓烈' },
              { label: '个大、饱满、坚实、种子棕红色、气香浓、搓之果皮不易脱落' },
            ]
          },
          {
            label: '草果',
            children: [
              { label: '草果' },
              { label: '表面具纵沟及棱线，易纵向撕裂，有特异香气' },
            ]
          },
          {
            label: '豆蔻',
            children: [
              { label: '白豆蔻（原豆蔻）或爪哇白豆蔻（印尼豆蔻' },
              { label: '表面有3条较深的纵向槽纹，两端有绒毛；内分3室；气芳香，味辛凉，略似樟脑' },
              { label: '个大饱满、果皮薄而洁白、气味浓香' },
              {
                label: '草豆蔻VS肉豆蔻VS豆蔻',
                children: [
                  {
                    label: '草豆蔻',
                    children: [
                      { label: '姜科 草豆蔻 近成熟种子' },
                      { label: '种子团3瓣，气香，味辛、微苦 ' }
                    ]
                  },
                  {
                    label: '肉豆蔻',
                    children: [
                      { label: '肉豆蔻科 肉豆蔻 种仁（石灰水浸泡后低温烘干）' },
                      { label: '表面有沟纹，断面有大理石花纹，富油性，气香浓烈，味辛 ' },
                    ]
                  },
                  {
                    label: '豆蔻',
                    children: [
                      { label: '白豆蔻（原豆蔻）或爪哇白豆蔻（印尼豆蔻 ' },
                      { label: '表面有3条较深的纵向槽纹，两端有绒毛；内分3室；气芳香，味辛凉，略似樟脑' },
                    ]
                  },
                  {
                    label: '小子落草为寇，肉多才能扒皮，果实要找白豆蔻'
                  }
                ]
              }
            ]
          },
          {
            label: '益智',
            children: [
              { label: '表面有凹凸不平的突起棱线13～20条，种子外被假种皮，香气特异' },
            ]
          },
        ]
      },
      {
        label: '其他',
        children: [
          { label: '地肤子-藜科 果实-五星，外披宿存花被' },
          { label: '酸枣仁-鼠李科 紫红或紫褐，味淡' },
          { label: '枸杞子-茄科 宁夏枸杞果实 =红，果肉肉质，柔润。种子20～50粒，类肾形（滋补肝肾），微甜' },
          { label: '栀子-茜草科 果实 表面具6条翅状纵棱，味微酸而苦' },
          { label: '瓜蒌-葫芦科 果实 有焦糖味，味酸甜' },
          { label: '牛蒡子-菊科 果实 有纵棱，味苦后微辛，稍麻舌' },
          { label: '薏苡仁 禾本科 种仁 乳白光滑，腹部有宽深纵沟，粉性' },
          { label: '酸枣仁 粒大 饱满 完整，有光泽，外皮红棕色，无核壳' },
          { label: '枸杞子 粒大 肉厚 籽小 色红，质柔，味甜' },
          { label: '栀子 皮薄，饱满 色红黄' },
          { label: '薏苡仁 粒大，饱满，无破碎，色白' },
        ]
      }
    ]
  },
  {
    label: '全草类中药的性状鉴别要点',
    children: [
      {
        label: '麻黄',
        children: [
          { label: '麻黄科 草麻黄、中麻黄或木贼麻黄 草质茎' },
          { label: '草麻黄－河北、山西；中麻黄－甘肃、青海；木贼麻黄－河北、山西' },
          { label: '草麻黄：少分枝，表面淡绿色至黄绿色，有细纵脊线，触之微有粗糙感' },
          { label: '节明显，节上有膜质鳞叶。断面髓部红棕色（生物碱）' },
          { label: '干燥、茎粗、淡绿色，内心充实、味苦涩' },
        ]
      },
      {
        label: '紫花地丁',
        children: [
          { label: '堇菜科 紫花地丁 全草' },
          { label: '主根长圆锥形，叶基生，灰绿色，披针形，花茎纤细，花瓣紫堇色或淡棕色；花距细管状。蒴果椭圆形或3裂，种子多数，淡棕色' },
          { label: '根、花、果、叶齐全，叶灰绿色，花紫色，根黄，味微苦' },
        ]
      },
      {
        label: '金钱草VS广金钱草',
        children: [
          {
            label: '金钱草（川）',
            children: [
              { label: '报春花科-过路黄-全草' },
              { label: '常缠结成团，叶对生，多皱缩。主脉明显突起，水浸后，透光可见黑色或褐色条纹——' },
              { label: '叶完整、色绿、气清香' },
            ]
          },
          {
            label: '广金钱草',
            children: [
              { label: '豆科-广金钱草，地上部分' },
              { label: '茎呈圆柱形，长可达1m，叶互生，上表面无毛，下表面具灰白色紧贴的绒毛，侧脉羽状' },
            ]
          },
          {
            label: '广藿香、薄荷、荆芥、益母草、香薷（地上部分）',
            children: [
              {
                label: '广藿香（石牌、海南）',
                children: [
                  { label: '茎略呈方柱形，被柔毛，叶对生，两面均被灰白色绒毛。气香特异，味微苦' },
                  { label: '茎叶粗壮、不带须根、香气浓厚（含叶量不得少于20%）' },
                ]
              },
              {
                label: '薄荷（江苏）',
                children: [
                  { label: '茎呈方柱形，有对生分枝。表面紫棕或淡绿。轮伞花序腋生。叶下表面有凹点状腺鳞。揉搓后有特殊清凉香气，味辛凉' },
                  { label: '叶多（不得少于30％）、色绿深、气味浓' },
                ]
              },
              {
                label: '荆芥',
                children: [
                  { label: '茎方柱形，被短柔毛，叶对生，多已脱落，叶片3～5羽状分裂，裂片细长。穗状轮伞花序顶生。气芳香，味微涩辛凉' },
                ]
              },
              {
                label: '益母草',
                children: [
                  { label: '鲜用、干用，下部叶掌状3裂，上部羽状3浅裂。轮伞花序腋生。气微，味微苦' },
                  { label: '以质嫩、叶多、色灰绿为佳；质老、枯黄、 无叶者不可供药用' },
                ]
              },
              {
                label: '香薷',
                children: [
                  { label: '穗状花序密被茸毛，气浓清香，味微辛而凉' },
                ]
              },
            ]
          },
          {
            label: '半枝莲VS穿心莲',
            children: [
              { label: '半枝莲-唇形科 半枝莲全草-茎方柱形，花单生于叶腋。味微苦' },
              { label: '穿心莲（广东）-爵床科 穿心莲 地上部分，节稍膨大，味极苦' },
            ]
          },
          {
            label: '肉苁蓉VS锁阳',
            children: [
              {
                label: '肉苁蓉',
                children: [
                  { label: '列当科 肉苁蓉或管花肉苁蓉带鳞叶的肉质茎' },
                  { label: '表面密被覆瓦状排列的肉质鳞叶，断面有淡棕色点状维管束，排列成波状环纹' },
                ]
              },
              {
                label: '锁阳',
                children: [
                  { label: '锁阳科 锁阳 肉质茎' },
                  {
                    label:'表面具明显纵沟及不规则凹陷，有的残存三角形黑棕色鳞片。断面有黄色三角状维管束'
                  }
                ]
              },
              {
                label:'茵陈VS青蒿',
                children:[
                  {label:'茵陈-菊科 滨蒿或茵陈蒿地上部分'}
                ]
              }
            ]
          },
        ]
      },
    ]
  }
]
const keshu = [
  {
    label: '根及根茎91/94',
    children: [
      {
        label: '伞形科',
        children: [
          { label: '根-北沙参、当归、柴胡、防风、白芷' },
          { label: '根茎-川芎' },
          { label: '根茎及根-羌活、藁本' },
          { label: '北归川才放松，搞明白，以前算是白活了' },
        ]
      },
      {
        label: '菊科药',
        children: [
          { label: '根-木香、川木香' },
          { label: '根茎-白术、苍术' },
          { label: '根及根茎-紫菀' },
          { label: '菊花开了，搂着紫色木柱子。' },
        ]
      },
      {
        label: '百合科药材',
        children: [
          { label: '鳞茎-川贝母、浙贝母' },
          { label: '根茎-黄精、玉竹、重楼、土茯苓、知母' },
          { label: '块根-天冬、麦冬、山麦冬' },
          { label: '百年好合，三冬知母，黄精玉竹，贝母重楼，吐槽茯苓' },
        ]
      },
      {
        label: '豆科',
        children: [
          { label: '根-苦参、葛根、粉葛、黄芪' },
          { label: '根及根茎-山豆根、甘草' },
          { label: '茎木类-鸡血藤，降香，苏木' },
        ]
      },
      {
        label: '毛茛科',
        children: [
          { label: '根-川乌、草乌、附子、白芍、赤芍' },
          { label: '根茎-黄连、升麻' },
          { label: '根及根茎-威灵仙' },
          { label: '茎木类-川木通' },
        ]
      },
      {
        label: '兰科',
        children: [
          { label: '蓝天白云去看石斛。（蓝=兰科，天=天麻，白=白及）' },
        ]
      },
      {
        label: '五加科',
        children: [
          { label: '五加三参能通天。通草' },
        ]
      },
      {
        label: '木通',
        children: [
          { label: '大血藤，木通' },
        ]
      },
      {
        label: '单子叶植物',
        children: [
          { label: '黑三棱科、莎草科、姜科、泽泻科、天南星科、薯蓣科、百部科、百合科、鸢尾科、兰科' },
          { label: '黑莎草，姜泽天，薯百部，看百合，遇到鸢尾和兰科' },
        ]
      },
      {
        label: '根VS根茎横切面特征',
        children: [
          { label: '双子叶有形成层' },
          { label: '栓皮在外根无髓' },
          { label: '正好相反单子叶' },
          { label: '表皮在外根有髓' },
        ]
      },
    ]
  },
  {
    label: '皮类用药部位总结',
    children: [
      { label: '根皮-地骨皮，香加皮，牡丹皮，桑白皮，白鲜皮' },
      { label: '茎干皮-肉桂，杜仲，黄柏' },
      { label: '茎干皮+根皮+枝皮：厚朴' },
      { label: '茎干皮或枝皮：秦皮，' },
      { label: '茎干皮+根皮：苦楝皮' },
      { label: '黄柏杜仲肉很厚,地骨香加掉鳞片,牡丹桑心粉性强,白鲜亮点有膻气,厚朴皮厚啥都有' }
    ]
  },
  {
    label: '花类用药部位总结',
    children: [
      { label: '已开放：洋金花，红花（初开采收）' },
      { label: '尚未开放：丁香，金银花，辛夷' },
      { label: '花序：款冬花：未开； 菊花，旋覆花：头状花序' },
      { label: '带花的果穗：夏枯草' },
      { label: '花的一部分：西红花：柱头；玉米须：花柱；莲须-雄蕊； 松花粉，蒲黄：花粉粒' },
      {
        label: '显微鉴别：',
        children: [
          { label: '丁香：暗红棕色；花粉粒极面观三角形，赤道表面观双凸镜形，具3副合沟；含草酸钙簇晶、油室。' },
          { label: '金银花：浅黄色；花粉粒黄色，球形，外壁具细刺状突起，萌发孔3个。非腺毛有2种，长有微细疣状突起、短具壁疣' },
          { label: '红花：橙黄色；有长管状分泌细胞，含黄棕色至红棕色分泌物。花粉粒类圆形、椭圆形，具3个萌发孔，外壁齿状突起' },
          { label: '西红花（补充）：橙红色；柱头顶端表皮细胞绒毛状；含草酸钙结晶' },
          { label: '极地赤道看丁香，金银外壁细刺突，红花笑到齿突起' },
        ]
      }
    ]
  },
  {
    label: '果实种子类用药部位总结',
    children: [
      { label: '种子-葶苈子、苦杏仁、桃仁、沙苑子、决明子、酸枣仁、马钱子、菟丝子、牵牛子、槟榔、草豆蔻' },
      { label: '种仁：薏苡仁、肉豆蔻、莲子心（胚）' },
      { label: '假种皮：肉豆蔻衣、龙眼肉' },
      { label: '成熟果实：山楂、补骨脂、巴豆、小茴香、连翘、草果、豆蔻、瓜蒌、益智,地肤子、五味子、南五味子、金樱子、枸杞子、女贞子、栀子、牛蒡子、蛇床子、砂仁' },
      { label: '成熟果实：牛郎织女来种地，采购五金来杀蛇' },
      { label: '特别的果实：枳实-幼果；枳壳：未成熟；木瓜，乌梅，吴茱萸-近成熟；桑葚-果穗;山茱萸-果肉；' },
      { label: '乌梅-干缩有皱纹' },
      { label: '栀子：稍有光泽' },
      { label: '蔓荆子：具粉霜状茸毛' },
      { label: '陈皮，吴茱萸：凹下油点' },
      { label: '砂仁：刺状突起' },
      { label: '茴香，蛇床子：隆起的肋线' },
    ]
  }


]
const zhiji = [

  {
    id: 1,
    label: '常见剂型：辅料;分类，特点；生产储藏要求;质量检查项目',
    children: [
      {
        id: 1,
        label: '固体制剂 ',
        children: [
          {
            label: '散剂',
          },
          {
            label: '颗粒剂',
          },
          {
            label: '胶囊剂',
          },
          {
            label: '丸剂',
            children: [
              {
                label: '水丸',
              },
              {
                label: '蜜丸（含水蜜丸）',
              },
              {
                label: '浓缩丸',
              },
              {
                label: '糊丸',
              },
              {
                label: '蜡丸',
              },
              {
                label: '滴丸',
              },
              {
                label: '糖丸',
              },
              {
                label: '丸剂包衣：目的，种类，材料',
              },
              {
                label: '丸剂质量要求',
              },
            ]
          }, {
            label: '片剂',
            children: [
              {
                label: `口服片：普通片（素片、包衣片）、
                咀嚼片、口崩片、分散片、泡腾片
                缓释片、控释片、肠溶片
                `
              },
              {
                label: '口腔用片'
              },
              {
                label: '外用片'
              },
              {
                label: '其他'
              },
              {
                label: '中药片剂：全浸膏片、半浸膏片、全粉末片'
              },
              {
                label: '片剂辅料:填充剂（稀释剂，吸收剂），润湿剂，粘合剂，崩解剂，润滑剂，其他着色，矫味剂',
              }
            ]
          }
        ],
      },
      {
        id: 1,
        label: '浸出制剂 ',
        children: [
          {
            label: '汤剂与合剂',
          },
          {
            label: '糖浆剂与煎膏剂',

          },
          {
            label: '酒剂与酊剂',
          },
          {
            label: '流浸膏剂，浸膏剂，茶剂',
          }
        ],
      },
      {
        id: 1,
        label: '液体制剂 ',
        children: [
          {
            label: '真溶液，胶体溶液（高分子溶液，溶胶剂），乳浊液，混悬液',
          },
          {
            label: '附加剂：潜溶剂，助溶剂，增溶剂，防腐剂，其他（矫味剂，着色剂，抗氧剂，ph调节剂，金属离子络合剂）',

          },
          {
            label: '表面活性剂：阴离子，阳离子，两性离子，非离子',
            children: [
              { label: '应用：增溶剂，乳化剂，润湿剂，起泡剂，去污剂，消毒剂和抑菌剂' }
            ]
          },
          {
            label: '低分子溶液剂',
            children: [
              {
                label: '溶液剂，芳香水剂，浓芳香水剂，露剂，醑剂，甘油剂，糖浆剂'
              }
            ]
          },
          {
            label: '高分子溶液剂与溶胶剂',
          },
          {
            label: '乳浊剂/乳剂',
          },
          {
            label: '混悬剂',
          },
        ],
      },
      {
        id: 1,
        label: '无菌制剂 ',
        children: [
          {
            label: '大小容量注射剂',
          },
          {
            label: '眼用制剂（滴眼液，眼膏剂）',

          },
          {
            label: '局部外用无菌制剂',
          },
          {
            label: '用于手术时使用的无菌制剂',
          },
          {
            label: '热源',
          },
          {
            label: '注射剂的溶剂与附加剂',
          },
          {
            label: '注射用中药原料',
          },
          {
            label: '影响中药注射剂质量的因素',
          },
          {
            label: '输液剂',
          },
          {
            label: '眼用制剂',
          },
        ],
      },
      {
        id: 1,
        label: '外用制剂 ',
        children: [
          {
            label: '特点，分类',
            children: [
              {
                label: '软膏剂，乳膏剂，贴膏剂，贴剂，膏药'
              }
            ]
          },
        ],
      },
      {
        id: 1,
        label: '其他制剂',
        children: [
          {
            label: '栓剂',
          },
          {
            label: '气雾剂和喷雾剂',

          },
          {
            label: '胶剂',
          },
          {
            label: '膜剂',
          },
          {
            label: '其他传统制剂',
          },
        ],
      },
    ],
  },
  {
    id: 2,
    label: '新剂型新技术',
  },
  {
    id: 2,
    label: '中药体内过程',
  },
  {
    id: 2,
    label: '中药制剂的稳定性',
  },

]
const jianding = jianding1.map(item => {
  item.children = item.children.map((c, index) => ({ ...c, label: `${index + 1}.${c.label}` }))
  return item
})
export { menuList, lihuaxingzhi, yaohuafenlun, jianding, zhiji, keshu }
