const menuList = [{
    title: '总论',
    submenu: [{
        title: '药和处方'
      },
      {
        title: '药的剂量-两，斗，升'
      },
      {
        title: '炮制的影响'
      },
      {
        title: '用药的奇偶制'
      },
      {
        title: '药物分类：养生？遏制病情？除邪？'
      },
      {
        title: '治病方式'
      },
    ]
  },
  // {
  //   title: '药性总义',
  //   submenu: [{
  //       title: '五味之义'
  //     },
  //     {
  //       title: '五色之义'
  //     },
  //     {
  //       title: '五味之用'
  //     },
  //     {
  //       title: '阴阳之义'
  //     },
  //     {
  //       title: '药之相从'
  //     },
  //     {
  //       title: '药色之入经脉'
  //     },
  //     {
  //       title: '五脏补泻之义'
  //     },
  //     {
  //       title: '六淫主治'
  //     },
  //     {
  //       title: '五行相生'
  //     },
  //     {
  //       title: '五行相克'
  //     },
  //     {
  //       title: '五病所禁'
  //     },
  //     {
  //       title: '五病所伤'
  //     },
  //     {
  //       title: '用药原则'
  //     },
  //     {
  //       title: '药的处理方式'
  //     },
  //     {
  //       title: '称重方法'
  //     },
  //     {
  //       title: '服药时间'
  //     },
  //   ]
  // },
  {
    title: '上经',
    submenu: [{
        title: '玉石类',
        danweiyao:[
          {
            ming:'丹砂',
            xingweiguijing:'性味甘（阴），微寒（阳）无毒',
            gongneng:'安神要药',
            tedian:'有阳中之阴药称，与人参南北称王',
            jinji:'多服丹砂因其性质重坠，使人神定目呆',
            paozhi:'丹砂沉底，所以有毒，但是生用无毒，丹砂只可生研水飞用，火炼则为水银而有毒，不可用',
            changyong:1,
            chandi:`在我国四川湖南等山中。以辰州为最佳，故又号辰砂，属石类。（原
            产地所产的形状象箭簇。）`
          },{
            ming:'云母',
            xingweiguijing:'味甘平,无毒',
            gongneng:'云母主补肺下气（白色质重下沉），补中坚肌，除邪气，安精神',
            tedian:`生产不下（难产）。金石类的药，重症能用，因为石头类的东西下沉的力量比较强。如五石乌头
            丸（千金要方）。重症，如癌细胞、肿瘤扩散，用金石类的药来攻坚，是最后一
            种选择。金石类的药因为质比较重，都可以安五脏，定心定神`,
            jinji:'古称云母治百病，服食无忌，但制炼须慎，不可过量服食',
            paozhi:'煅粉',
            chandi:`产四川及各省山中，种类甚多，有黑云母及白云母等，白者良，属
            玉类。是大理石的一种，属于玉，比较偏近于石头。`
          },
          {
            ming:'玉泉',
            xingweiguijing:'味甘平,无毒',
            gongneng:'清热解渴，安神养肌',
            tedian:`玉是阳精的纯的，玉敲起来越清脆越好，有金属的声音“嘡”的
            声音是纯的玉.面身癜痕，真玉日日磨之则自灭`,
            jinji:'不可用已经做成玉器之物必伤人也，璞玉乃可用也',
            paozhi:'煅粉',
            chandi:`玉乃石之美者，产山中，西南深山中多有之，以钟山蓝田产者最良，
            于阗国之白玉最好。`
          },
          {
            ming:'石钟乳',
            xingweiguijing:'味甘性温，无毒',
            gongneng:'为补阳益精要药，主治肺气虚损.咳逆上气，明目利窍，补髓疗弱，消渴引饮',
            tedian:`入肺降逆，利窍下乳`,
            jinji:'石药性悍，不宜久服',
            paozhi:'煅粉',
            chandi:`中国日本俱有出产，生于山中石洞穴中，我国以广西陕西等省多此
            洞`
          },
          {
            ming:'涅石（矾石-明矾/枯矾）',
            xingweiguijing:'味酸性寒无毒',
            gongneng:`为收湿解毒止血要药，功能除湿化痰，追涎（浓痰）坠浊，主明目
            坚齿，除风杀虫，蚀恶肉，生好肉，治蛇虫咬伤`,
            tedian:`枯矾可与麝香合用（麝香矾石散，麝香与枯矾 1:50）麝香无孔不
            入，配合之则可去脑鼻之间的风寒与瘀伤。`,
            jinji:'石药性悍，不宜久服',
            paozhi:'白矾研粉，枯矾煅至全部泡松呈白色蜂巢状，放凉研粉',
            changyong:1,
            fangji:'麝香矾石散',
            chandi:`产四川陕甘，我国南省诸山亦多有之，色白净者为明矾`
          },
          {
            ming:'消石（硝石）',
            xingweiguijing:'味苦性寒，无毒',
            gongneng:'硝石主清积热利小便，治五淋',
            tedian:'含咽治喉痹（不能吞东西）、硝石矾石散治疗黑疸',
            jinji:'忌火',
            chandi:`】产于东印度埃及等热带地方及我国西北。投入火中则爆鸣，立即燃
            烧而发鲜明之焰。`,
            paozhi:'拣去杂质即可，不能炮制。最好用竹筷子，不要用金属的东西捡',
            fangji:'硝石矾石散 治疗黑疸'
          },
          {
            ming:'朴肖（芒硝）',
            xingweiguijing:'味咸辛苦，性寒无毒',
            gongneng:'主软坚化积，逐六腑积聚结固留癖。清热泻下，外用消食化积;治腹胀，大小便不通，女子月经不通',
            tedian:'微咸之味者，皆能引火下行。大咸者能助火升发也(硝石)',
            jinji:'辛香走窜，不宜多用。大便没有了就把芒硝停掉',
            paozhi:'拣去杂质即可。芒硝煮了就没有力量，冲服',
            changyong:1,
            chandi:`生于盐卤之地，凡煎炼水硝，结出细芒者为芒硝，结出马牙状者为
            马牙硝，其凝于底成块者，通为朴硝`
          },
          {
            ming:'滑石',
            xingweiguijing:'味甘性寒无毒',
            gongneng:'为去湿热利小便要药，主通六府九窍津液。上开肌理下通膀胱，治淋疾，水肿，黄疸。',
            tedian:'为去暑之要药，去暑只宜清气利湿（清热利湿），不可用燥药，如黄连亦然，甘草也可',
            jinji:'由于阴虚火热水涸者，均忌，脾胃俱虚者虽不做泄亦忌，因其性滑也',
            paozhi:'拣去杂质，洗净，研细粉即可',
            changyong:1,
            chandi:`产山东及西南诸省山中。色青白或黄白及银灰色`
          },
          {
            ming:'胆石（胆矾）',
            xingweiguijing:'味酸辛，性寒，有小毒;神农酸小寒，扁鹊苦无毒，',
            gongneng:'胆矾为腐蚀催吐要药，功能蚀恶疮散症积（整个恶疮不能收口），涌吐风痰，治咽喉口鼻疮毒及目患。',
            tedian:'石胆、空青、曾青均产自铜坑。石胆是蓝色的，很透；空青是青蓝色的;石胆除了内服以外还可以外敷',
            jinji:'胃弱人不宜多服',
            paozhi:'拣去杂质;真正的胆矾，跟铁一磨，就会出现铜的颜色',
            chandi:`产山中，为蓝色结晶`
          },
          {
            ming:'空青',
            xingweiguijing:'味甘酸，性寒，无毒',
            gongneng:`为一切眼目要药，主治目赤目痛，青盲耳聋，利九窍通血脉，养神
            益肝`,
            tedian:`取其象，青色的石头是空的，可以看到里面有水，像眼眶里的水一样，把水
            取出来点眼睛，非常好。空青治疗青盲、夜盲。但是现在很少见`,
            jinji:'勿过量使用。一日点二次即止',
            paozhi:'拣去杂质',
            chandi:`产河南山西陕西山中，色青质轻，近罕见。今名丹青。`
          },
          {
            ming:'曾青',
            xingweiguijing:'味酸小寒无毒',
            gongneng:`主目痛止泪出，风痹利关节，通九窍，破症瘕积聚,杀白虫，
            久服轻身不老，能化金铜`,
            tedian:`曾青跟空青都产于铜坑中，和空青类似，只是颜色有一点差异。空青里面有
            水，曾青里面没有水`,
            jinji:'',
            paozhi:'拣去杂质'
          },
          {
            ming:'禹余粮（禹粮石）',
            xingweiguijing:'味甘寒，无毒',
            gongneng:`固补下焦要药（下焦虚都可以用，还可以固精，治疗精往外散），
            主治滑泄下血（大肠炎），血闭血虚，四肢虚而不仁，崩露赤白`,
            tedian:`山岛或是池泽，乃石中黄粉;石头很软，黄的像泥土一样;此药多使用于下脓血利不止，常与赤石脂同用`,
            jinji:'重可去怯，故为镇纳固补之剂。下焦有实热者忌，虚者良',
            paozhi:'拣去杂质,醋煅研粉',
            changyong:1,
            chandi:`产于山岛或是池泽，乃石中黄粉`
          },
          {
            ming:'太一余粮',
            xingweiguijing:'味甘平',
            gongneng:`主治咳逆上气（质重的药，如金石药都可以把气往下
            压），症瘕血闭，漏下除邪气，久服耐寒暑不饥，轻身飞行千里神仙`,
            tedian:`生泰山上，石如甲，甲中有白，白中有黄如鸡子黄色，又名太乙余粮，与禹余粮同，唯质较
            佳者`,
            paozhi:''
          },
          {
            ming:'白石英',
            xingweiguijing:'味甘微温无毒',
            gongneng:`肺大肠枯燥（金石类的东西都有滋润的功能），疗肺痰肺痈消渴`,
            tedian:`喉癌：喉咙打不开，可以用生半夏（半夏苦酒汤），如果打不开是
            喉癌（整个舌头喉咙堵住），要用硝石。（巴豆也可以开，但主攻是攻肠胃方面。）`,
            paozhi:'',
            jinji:'不可久服，寇氏曰紫白二石英攻疾可暂煮汁，未闻久服之益',
            chandi:'产深山中'
          },
          {
            ming:'紫石英',
            xingweiguijing:'味甘辛，性温无毒',
            gongneng:`主镇怯润枯，养心益肝，治女子风寒在子宫不孕`,
            tedian:`只要是有虚症的时候都可以用金石类的药来补。紫石英是温药，实热不能用，
            里面虚寒才会用；阳药`,
            paozhi:'拣去杂质,醋淬研粉（补了要收）',
            jinji:'紫石英是温药，实热不能用，里面虚寒才会用。凡绝孕由阴虚火旺，不能摄受精气者忌用',
            chandi:'产深山中'
          },
          {
            ming:'赤石脂',
            xingweiguijing:'性味酸辛，性大温无毒',
            gongneng:'为固肠收敛要药，主治赤白久痢，赤白带下，厚肠胃，除水湿，收脱肛',
            tedian:`辛甘生大热，辛甘发散为阳嘛，加一点酸味收敛，又是补阳又是收敛;赤石脂本身是红色，药性本身的温度比较高，当然不像附子、硫磺那么大热。赤石脂和禹余粮两味药可以和在一起使用治疗大肠炎（下痢出血），一剂下
            去就收掉了`,
            jinji:`凡火热暴注者不宜用，滞下全是湿热，于法当利，自非的受寒邪，
            下利白积者不宜用，崩中法当补阴清热，带下本属湿热积滞，法当去湿除积，止
            涩非宜(寒痢，水痢不适用)`,
            paozhi:'拣去杂质,醋淬研粉',
            changyong:1,
            chandi:'产山西山东河南．他省亦多'
          },
          {
            ming:'白青',
            xingweiguijing:'味甘平',
            gongneng:'主明目利九窍，耳聋心下邪气令人吐，杀诸毒三虫。久服通神明，轻身延年不老',
            tedian:`白青现在已经绝迹，很少用了。金石类的药，如空青、白青、曾青，都是产
            在铜坑里面`,
            jinji:``,
            paozhi:'',
          },
          {
            ming:'扁青',
            xingweiguijing:'味甘平;神农雷公小寒无毒',
            gongneng:'主目痛明目，折跌痈肿，金创不疗，破积聚解毒气，利精神，久服轻身不老;治丈夫内绝令人有子。去寒热风痹，及丈夫茎中百病益精',
            tedian:`最常用的眼科的药都是曾青，空青，扁青，白青，金石类的药很多，草木类
            的有贝母，贝母都可以泡水`,
            jinji:``,
            paozhi:`金石类的药炮制提炼过以后，打碎磨细，放入
            水中，沉底的不要，溶化在水里面的可以作眼科的药来涂，曾青、白青、扁青都
            可以，可以止眼睛痛痒，用炉甘石也可以`,
          }
        ]
      },
      {
        title: '草药类',
        danweiyao:[
          {
            ming:'菖蒲',
            xingweiguijing:'味辛性温无毒',
            gongneng:`菖蒲为宣窍泄热，健胃行滞要药，主开心孔通九窍，明耳目出声音，
            治咳嗽上逆，霍乱转筋，健脾胃杀诸虫，疗噤口痢；四肢湿癣不得曲伸，小儿温疟，身积热不解，可作浴汤`,
            tedian:`菖蒲常常和辛夷花并用，菖蒲质比较重，辛夷花很轻，一般来说辛
            夷花剂量会比较少。菖蒲最主要的功能是开心孔补五脏通九窍，明耳目，在治疗心脏病的时候常
            常用到菖蒲；我国四川，今处处有之，多生水滨，可供盆栽；根入药，一寸九节者良；菖蒲南人多常用置食水中，或加矾（明矾）少许，解一切毒`,
            jinji:`忌饴糖羊肉铁器`,
            paozhi:`拣去杂质，刷去灰尘`,
            fangji:`有菖蒲丸（石菖蒲人参丹参天冬麦冬赤石脂）治小儿心气不足，不能言语。又醋糊丸棉裹置耳中，治耳内卒痛，聋闭不闻
            菖蒲益智丸（菖蒲远志人参枯梗牛膝附子伏签桂心），治健忘恍惚，破积聚止痛，
            安心定神聪明耳目均效`,
            fangji:`鼻窦炎：菖蒲 3 钱、辛夷 2 钱、苍术 3 钱，只去鼻窦炎里面堵到的东西，
            不管寒热。寒热辨证：浓鼻涕是热，流清涕是寒，寒热在肺里面，因为肺开窍于
            鼻，加干姜可以去肺的寒，加杏仁、麦门冬等可以去肺热。`,
            changyong:1
          },
          {
            ming:'菊花',
            xingweiguijing:'味苦甘平无毒',
            gongneng:`为清风热明目解毒要药，主诸风头眩肿痛，目痛翳膜，利血脉，治
            疗疮`,
            tedian:`风是指外感，没有什么其他问题就是头痛，一般是风寒吹到，都可以用菊;近世用为平肝良药，头痛目疼多因肝经风热上乘所致，菊花入肝，
            兼行周身，血脉不利而死肌，得菊花之利血脉皆效，特长于解毒，外科方剂用之
            治疗毒发背者。沈金鳌曰菊花并茎叶打汁饮，外涂内服皆可。时医用之因防邪热
            过久而酝酿化毒；平淡多奇功。`,
            jinji:`味苦辣者，陈久者，不堪用，其甘者亦名甘菊，可饮可食亦入药`,
            paozhi:`拣去杂质及梗叶，拍去灰尘即得`,
            qita:`菊叶解毒之功胜于花，以鲜者良，捣汁敷一切肿毒（脓疮和伤
            口皆可），亦可内服`,
            fangji:``,
            changyong:1
          },{
            ming:'人参',
            xingweiguijing:'味甘微苦性微寒无毒',
            gongneng:`为大补元气要药，功能治一切衰弱痨瘵，通行周身补五脏之气，泻
            五脏之火，效益多但功缓，红色曰高丽参，性温而力较峻`,
            tedian:`真正的高丽红参很干很硬，用烤炉烤一下就软掉了，切片的时候味道很呛鼻，
            里面的确是暗红色的;采收时，人参不用金属的刀去，因为金克木，怕味道跑掉都用竹刀。
            晒干了以后可以用钢刀切。`,
            jinji:`肺家有热诸症及阴虚火动之候与痘疹之初发，身虽热而斑点未形，
            与伤寒始作，形症未定而邪热炽均忌，反葵芦；人参不能常吃，如果每天吃人参，等到真的需要人参的时候，石沉大海，起
            不到疗效`,
            paozhi:`用湿布包裹，焖润用火烤，再晾干或烘干即可得`,
            qita:`a 独参汤：用于救逆的时候，单味一味人参去熬浓汤喝，补气。b 考试时可以口含人参切片含在，能够生津止渴、提神 c 如果人参一吃下去就上火、口腔溃疡、口干舌燥，是因为他肺里有热，人
            参不适合，这个时候可以吃天门冬把肺热去掉`,
            fangji:``,
            changyong:1
          },
          {
            ming:'天门冬',
            xingweiguijing:'味苦平',
            gongneng:`为清虚热润燥痰要药，主肺气咳逆，风湿偏痹益肌肤，保肺气治消渴、疗咳血。`,
            tedian:``,
            jinji:`胃虚无热及泻者均忌，忌鲤鱼。`,
            paozhi:``,
            qita:`天冬麦冬性相近，故一般方剂二药并用`,
            fangji:``,
            changyong:1
          },
          {
            ming:'甘草',
            xingweiguijing:'味甘平无毒',
            gongneng:`甘草为调合周身气血要药，功能解百毒，补脏腑，泻诸火，在上去痰止咳，在中调和脾胃，在下清热利溲，入和剂则补益，入汗剂则解肌，入凉剂则泻热，入润剂则生津，入峻剂则缓正气，制药之暴性，效益甚多，为诸药之君。`,
            tedian:`炙甘草入心`,
            jinji:`凡中满人呕家酒家，诸湿肿满及胀满均忌，反大戟甘遂芫花海藻，恶远志忌猪肉。`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'干地黄',
            xingweiguijing:'味甘性寒无毒',
            gongneng:`干地黄为滋阴养血要药，功能凉血热，滋肝肾，养心益肺，通血脉逐血痹`,
            tedian:`产中州，得土深水厚之性，内含润泽之湿也。原色为黄，制后为黑，故人知地黄之能滋肾阴，不知地黄实滋脾阴，内经云脾为阴中之至阴，地黄以湿归脾，脾阴足，则肝肾自受其灌溉。其不辛温，故能益水液，滋血之源，而不能变化、以成血色。以水配火，不使壮火食气，如此气纳矣`,
            jinji:`凡病人脾胃弱，大便泄，产后不食或泻，及胸膈多痰，气道不利者均忌，忌铜铁及茶，得清酒麦冬良。`,
            paozhi:``,
            qita:`男子多阴虚宜熟地，女子多血热宜生地`,
            fangji:``,
            changyong:1
          },
          {
            ming:'白术',
            xingweiguijing:'味甘性温无毒',
            gongneng:`白术为健脾胃要药，功能利水去湿，和中调气，外科用托疡疮`,
            tedian:`白术补脾补气，苍术燥湿发汗`,
            jinji:`凡病属阴虚血少，精不足，内热骨蒸，口干唇燥，咳嗽吐痰，吐血鼻血，齿血，咽塞，便秘，滞下均忌，溃疡用之反生脓作痛，忌与蛤雀桃李菘菜青鱼同食。`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'菟丝子',
            xingweiguijing:'味辛甘，性平无毒',
            gongneng:`菟丝子为补肾益精要药，主绝续伤，补不足，坚筋骨，强阴分，治茎中寒，精自出，溺有余沥，腰痛膝冷`,
            tedian:`白术补脾补气，苍术燥湿发汗`,
            jinji:`肾家多火，阳强不痿，及大便燥急者，均忌，得酒良`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'牛膝',
            xingweiguijing:'味苦酸性平无毒',
            gongneng:`牛膝为寒湿痹痿，骨节疼痛要药，走血能补，益肝肾强筋骨，痛淋浊，引诸药下行，治膝痛，能堕胎`,
            tedian:`杜牛膝──性专走下，毫无补益，散恶血破症瘕，止痛，治淋药中宜用`,
            jinji:``,
            paozhi:``,
            qita:`牛膝性降，因根深味苦，故能引水火下行。因根坚实，形不空，无升达之孔道，味既苦泻，故下行双足。其节如膝，能利膝胫，以其形似也。`,
            fangji:``,
            changyong:1
          },
          {
            ming:'充蔚子（益母草）',
            xingweiguijing:'味辛苦性微寒，无毒',
            gongneng:`此药为去瘀生新，通调月经，及产后要药，根茎功用相同`,
            tedian:``,
            jinji:`血崩及瞳子散大均忌，唯热血欲贯瞳仁者，可与凉药同用`,
            paozhi:``,
            qita:`主明目益精，除水气，久服轻身，茎主瘾疹痒，可做浴汤，一名益母`,
            fangji:``,
            changyong:1
          },
          {
            ming:'女萎（玉竹）',
            xingweiguijing:'味甘性平无毒',
            gongneng:`萎蕤为治风热风湿入肌作痛要药，功能祛风清热，除湿止痛，主邪热头痛，及腰痛身痛，补劳伤`,
            tedian:`久服去面黑皯，好颜色，润泽，轻身不老`,
            jinji:`畏咸卤`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'防葵',
            xingweiguijing:'味辛苦，性寒',
            gongneng:`根为解热利尿，镇静药，治膀胱宿水，膀胱热结，癃闭，癫狂痫症`,
            tedian:``,
            jinji:``,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:0
          },
          {
            ming:'柴胡',
            xingweiguijing:'味苦性平无毒',
            gongneng:`发表清热要药，功能散三焦肝胆诸经之热邪，主治寒热疟疾，口苦耳聋，头痛眩晕`,
            tedian:`其性轻扬，能逐半表半里之邪`,
            jinji:`凡虚人气升呕吐，及阴虚火热炎上，法同所忌。`,
            paozhi:``,
            qita:`北柴胡，南柴胡，银柴胡`,
            fangji:`小柴胡汤，大柴胡汤`,
            changyong:1
          },
          {
            ming:'麦门冬',
            xingweiguijing:'味甘性寒，无毒',
            gongneng:`麦冬为润肺清火要药，主治肺中伏火，痰多，心腹结气，肺弱胃弱，津少口渴，止咳嗽，疗肺病吐脓血`,
            tedian:`其性轻扬，能逐半表半里之邪`,
            jinji:`麦冬性寒，虽主脾胃而虚寒泄泻及痘疮虚寒作泻，产后虚寒作泻均忌，入补药，酒浸良。秉水阴，能滋肺以清气分。`,
            paozhi:``,
            qita:``,
            fangji:``,
            changyong:1
          },
          {
            ming:'独活',
            xingweiguijing:'味辛苦，性温，无毒',
            gongneng:`独活为风痛要药，主治头痛身痛脚痛，机关不利，风湿诸痹`,
            tedian:`此药有风花不动，无风独摇`,
            jinji:`凡血虚发痉，血虚头痛，及遍身疼痛，骨痛，因而带寒热者，均属内症，均忌，误用必反剧`,
            paozhi:``,
            qita:`色黑，故兼入少阴经，以达太阳，能散背脊之风寒，同天麻与白头翁皆有风不动，无风而动。但味太辛，气太温，能散风寒，其力胜于天麻，兼能燥湿，但不如天麻之刚柔得中也`,
            fangji:``,
            changyong:1
          },
          {
            ming:'车前子',
            xingweiguijing:'味甘寒，无毒',
            gongneng:`车前子为行水泄热要药，主利小便，通淋沥，清肺肝风热，渗膀胱
            湿热，强阴益精明目。`,
            tedian:`主气癃，止痛，利水道小便，除湿痹，久服轻
            身耐老。因喜在牛迹中生，故又名当道也。`,
            jinji:`内伤劳倦，阳气下陷者忌，肾气虚脱者忌与淡渗药同用。`,
            paozhi:``,
            qita:`专利小便（有实热或湿热结在里面才用）车前叶——凉血除热，止吐衄，消症瘕，与车前子同功`,
            fangji:``,
            changyong:1
          },
          {
            ming:'木香',
            xingweiguijing:'味辛苦，性温无毒',
            gongneng:`木香为开胃调气要药，功能行三焦之气，宣扬肠胃之滞，主治心腹
            诸痛呕吐泄泻，消痞积，辟邪气`,
            tedian:`主邪气，辟毒疫温鬼，强志，主淋露，久服不梦寤魇寐。`,
            jinji:`肺虚有热，元气虚脱，及阴虚内热，诸病有热，心痛属火，均忌`,
            paozhi:``,
            yongliang:'普通五分至二钱。',
            qita:`开胃调气：不管是胃癌或是什么肠胃方面的问题，只要寒症、寒结住，都可
            以使用木香。只要病人出现寒湿，有结气都可以使用木香，木香是行气的药;
            辟邪气：是说可以预防一些食物中毒的现象，预防疾病用的。
            对于下焦、肚子的问题，行气用木香，行血用白芍。`,
            fangji:`【弘景】曰木香疗毒肿消恶气有验，今唯制蛀虫丸中用之，至于木香配合之
            成方颇多，著者有木香丸（香附黄柏胡黄连木香），治腹痛食伤，气郁作痛，诸
            虫痛，盖佐以苦寒之药，则不仅治冷痛也。香连丸（木香黄连）治痢疾为调和之
            剂，木香丸（木香附子卤砂）治寒痛绕脐作痛，结鞭不消。木香饼（生地木香作
            饼），热熨贴之，治纺肿成核，消乳中结核酸痛等，均有灵效`,
            changyong:1
          },
          {
            ming:'署豫（淮山/山药）',
            xingweiguijing:'味甘性温平，无毒。',
            gongneng:`署豫为补虚扶弱要药，主益肺脾，清虚热，治虚羸，长肌肉，补心
            益肾，疗健忘遗精，生捣敷痈疮，消肿硬。`,
            tedian:`味甘温，主伤中，补虚羸，除寒热邪气，补中，益气力，长肌
            肉，久服耳目聪明，轻身不饥，延年。又名薯豫。又名山药。今名淮山`,
            jinji:`恶甘遂，不宜与面同食。`,
            paozhi:``,
            yongliang:'普通钱半至三钱。病人虚弱可以多开点都没关系。',
            qita:`【容川】味甘有液，得土之湿气（里面很粘），功能补脾阴即补脾之水以补
            湿，因其色白，得土中之金气，故有益肺之功，带酸之性故兼入肝肺`,
            fangji:``,
            changyong:1
          },
          {
            ming:'薏苡仁',
            xingweiguijing:'味甘淡（甘淡可以利湿、渗利），性微寒，无毒',
            gongneng:`为除湿行水，健胃补肺要药，主除筋骨邪气，拘痹不仁，利肠胃，
            消水肿，祛风湿，治脚气。`,
            tedian:`味甘微寒，主筋急拘挛不可屈伸，风湿痹，下气，久服轻身益气，其根下三虫，一名解蠡。`,
            paozhi:'',
            jinji:`大便燥结，因寒转筋，及孕妇忌。其实孕妇不要忌。如果孕妇本身湿很盛，有积水、胃口也不是很好，可以用
            薏仁，同时可以利水又可以去湿。一般来说孕妇禁忌的药都是能够活血化瘀的药`,
            yongliang:'普通三钱至六钱。',
            qita:`【容川】味甘有液，得土之湿气（里面很粘），功能补脾阴即补脾之水以补
            湿，因其色白，得土中之金气，故有益肺之功，带酸之性故兼入肝肺；
            【附录】薏苡根——主下三焦，能堕胎，治黄疸，卒心腹烦满，胸胁痛`,
            fangji:`薏仁绿豆汤，能够消暑止渴。因为甜味，能够止痉、抽筋、筋拘。薏仁甘淡渗利，去湿很好，还可以去疣，很多人皮肤上，如在夏天脖领子最
            潮湿的地方生疣，吃薏仁绿豆汤，加些糖，是很好的药`,
            changyong:1
          },
          {
            ming:'泽泻',
            xingweiguijing:'味甘咸，性寒无毒',
            gongneng:`泽泻为渗湿利尿要药，主风寒湿痹，逐膀胱三焦停水，通淋沥（小
            便滴漏不止），止遗泄，利小便，消肿胀。`,
            tedian:`味甘寒，主风寒湿痹，乳难消水，养五脏，益气力，肥健，久
            服耳目聪明，不饥延年，轻身，面生光，能行水上。其叶如车前草，味亦相似`,
            jinji:`凡病人无湿无饮而阴虚，及肾气乏绝，阳衰精自流出，肾气不固，
            精滑目痛，虚寒作泄等候，均忌。（泽泻可以常吃，但是不能吃太多。）`,
            paozhi:`【炮制】拣去杂质，大小分开，浸泡四小时，热天加少量明矾，冬天不用。
            捞出，沥干除水，用盐水喷洒，晒干，火烤使色现微黄色，取出，冷却即得`,
            yongliang:'普通一钱至三钱。严重的时候开到 5 钱、6 钱都没有关系。',
            qita:`【引申】泽泻与薏仁：泽泻是阴虚的人忌用，阳虚的水肿、小便不利，可以
            用泽泻；而薏仁阴虚的人用很好，因为薏仁能够滋阴。辨证：阴虚的人出现阳症，
            脸红是阴虚；阳虚的人出现阴症，脸黑暗，没有人的颜色，是暗色。案例：肚子
            很大，积水，很热，是因为阴虚阳往外走（危险的现象）。如果是阴阳俱虚，两
            个可以同时用。【东垣】去肤中留垢，心下水痞
            【药征】主治小便不利冒眩也，旁治渴`,
            fangji:`经方时常使用到泽泻，如猪苓汤，可以攻坚，
            排肾结石;①疏凿饮（泽泻商陆赤小豆羌活大腹皮椒目木通秦艽茯苓槟榔
            生姜）治水气通身浮肿，烦燥喘渴，小便不利。②泽泻汤（泽泻五两白术二两）治心下有支饮其人苦冒眩者
            ③五苓散（茯苓猪苓白术泽泻肉桂）治水分有热，小便不利，烦渴或水饮内
停，脐下悸者
④《黄帝内经》的方子，泽泻半夏，这两个药，一个能够止呕，一个能够去
水。半夏是很竣的药，咳嗽、水肿我们会用到`,
            changyong:1
          },
          {
            ming:'远志',
            xingweiguijing:'味甘苦性温无毒',
            gongneng:`远志为强心益智要药，功能治神虚怔忡，痰涎咳逆`,
            tedian:`苦温，主咳逆伤中补不足，除邪气，利九窍，益智慧，耳目聪
            明不忘，强志倍力，久服轻身不老`,
            jinji:`凡心经有实火为心家实热应用黄连生地者，禁与参术等助阳气药物
            同用，畏珍珠藜芦得茯苓良`,
            paozhi:``,
            yongliang:'普通八分至二三钱。',
            qita:`【容川】其性与桂枝同，但桂枝四达，远志则系根体细瘦，故主入心经，以
            散心中之滞血。味苦亦入心，兼有辛温之性，故能补心火。【之才】杀天雄附子乌头毒，煎汁饮之【别录】利丈夫，定心气，止惊悸益精，去心下隔气，皮肤中热，面目黄。`,
            fangji:``,
            changyong:1
          },
          {
            ming:'龙胆',
            xingweiguijing:'味甘涩，性大寒，无毒。',
            gongneng:`龙胆草为涤邪火除湿热要药，功能健胃清热，治痢杀虫，主治肝火
            胆火胃火，下焦湿热`,
            tedian:`味苦涩，主骨间寒热，惊痫邪气，续绝伤，定五脏，杀蛊毒，
            久服益智不忘，轻身耐老。`,
            jinji:`胃虚血少，脾胃两虚作泻，病虚有热均忌。`,
            paozhi:``,
            yongliang:`一般剂量都是三钱，如果病人吃了，至少要多一次大便，比如病人原来一天
            一次，吃了以后，可能变一天两次、三次，原来便秘，吃了以后，一天一次大便，
            说明剂量就刚刚好。`,
            qita:`【倪注】去中焦肝胆脾胃之湿热`,
            fangji:`龙胆草大苦大寒，所治多湿热之病，洁古曰下行之功与防己同，酒浸则能上
            行外行（龙胆草放酒里泡两个小时拿出来），柴胡为主龙胆为使，治目疾必用之
            药（眼睛炽热、红血丝）。因性大寒故不可久服，恐伤胃气`,
            changyong:1
          },
          {
            ming:'细辛',
            xingweiguijing:'味辛性温无毒',
            gongneng:`细辛为风痛要药（辛主发散、横行），功能深入散风祛寒，主治咳
            逆上气，风湿，痹痛，头痛，齿痛，泄热破痰，开窍行水。`,
            tedian:`味辛温（发散），主咳逆头痛，脑动（脑部有痛且振动），百节
            拘挛，风湿痹痛，死肌，久服明目利九窍，轻身长年。岐伯曰无毒。色白者善`,
            jinji:`升燥发散性烈，凡内热及火升炎上，上盛下虚，气虚有汗，血虚头
            痛，阴虚咳嗽，均忌`,
            paozhi:``,
            yongliang:'普通三分至一钱。临床加到两钱三钱四钱五钱都没有关系',
            qita:`经方家认为少阴证的头痛一定要用细辛来治疗【容川】细辛形细色黑，故入少阴经，味大辛，能温散少阴之风寒，而少阴
            为寒水之脏，寒则水气上泛，细辛散少阴之寒，能达水中之阳，故能逐水饮`,
            fangji:``,
            changyong:1
          },
          {
            ming:'石斛',
            xingweiguijing:'味甘（有滋补功能）性平无毒',
            gongneng:`为除热益阴要药，主养脾胃，益心肾，补虚劳，退虚热，治自汗盗汗，小便余沥，脚痛痹弱。`,
            tedian:`味甘平主伤中除痹下气，补五脏虚劳羸瘦，强阴，久服厚肠胃
            轻身延年。`,
            jinji:`多服能寒胃，至大便溏薄，入姜一二片为辅，则无此弊，清肺补脾
            也，恶凝水石巴旦，畏雷丸僵蚕。`,
            paozhi:``,
            yongliang:'普通一钱至三钱',
            qita:`【附录】鲜石斛——石斛茎之鲜者，以铁皮鲜石斛为最良，治胃中大热，津
            液干竭，凉肺生精，胜于石斛。钗石斛——石斛之状似金钗者，较之寻常石斛凉性多而黏性少，滋阴降火，
            于小儿胃热尤宜。川石斛——石斛之产于四川者，其茎紧小，清热之功较着`,
            fangji:``,
            changyong:1
          },
          {
            ming:'巴戟天',
            xingweiguijing:'味辛甘，性微温，无毒。',
            gongneng:`巴戟天为补气益精要药，功能法风除湿，强筋骨，壮元阳，治遗精。
            颜色是黑的，入骨入肾，所以巴戟天是补气益精的要药；遗精：精虚吃巴戟天精会增，可还是会再遗，因为没有使用锁阳、固阳的药。`,
            tedian:`味辛微温主大风邪气，阴痿不起，强筋骨安五脏，补中增智益
            气`,
            jinji:`凡相火炽，思欲不得，便赤口苦，目昏目痛．烦燥口渴，大便燥结
            者均忌，恶雷丸丹参，得覆盆子良。此药治肾亏最佳，故遗精滑精者宜，阳痰者
            良，有虚火者禁忌`,
            paozhi:``,
            yongliang:'普通一钱至三钱。（可以大剂量吃，如一两。）',
            qita:`泡酒：是很好的药酒的材料，泡到白酒里面会变成血红色，颜色又好看，好喝；
            【容川】色紫而根实，能温肝，足厥阴主风，属阴中之阳，药气温者即阴中之阳，故入肝。`,
            fangji:`巴戟天是补肾固精的药，可以去肝风，对肝脏很好。不管肝炎肝硬化肝癌，
            肝病危症时去救逆，让水都排掉，病情稳定后要一直补肾，水能够生木。保护肝
            脏的方法，第一个就是强水固肾，加一些舒肝木的药让肝木不郁，肝脏功能就会
            非常好，如柴胡、郁金。`,
            changyong:1
          },
          {
            ming:'白英',
            xingweiguijing:'根苗叶味甘，性寒。',
            gongneng:`白英为解热药，治风疹，丹毒，黄疸及热疟。有补益之效。`,
            tedian:`味甘寒，主寒热八疽消渴补中益气，久服轻身延年。
            白英是全草，根苗叶全草都可以用，味甘性寒。用的不多`,
            jinji:``,
            paozhi:``,
            yongliang:'',
            qita:`【弘景】叶做羹饮，可疗劳．`,
            fangji:``,
            changyong:2
          },
          {
            ming:'白篙',
            xingweiguijing:'味甘平',
            gongneng:`治病的时候很少用，滋补的药，平常健康的时候可以多吃一些滋补的药。`,
            tedian:`主五脏邪气风寒湿痹，补中益气，长毛发令黑，疗心
            悬少食常饥，久服轻身耳目聪明不老。`,
            jinji:``,
            paozhi:``,
            yongliang:'',
            qita:``,
            fangji:``,
            changyong:2
          },
          {
            ming:'赤箭（天麻）',
            xingweiguijing:'味辛性平无毒',
            gongneng:`天麻为祛风镇痉要药，功能治诸风头痛头眩，风湿痹，小儿精痫拘
            挛。抽筋：可能表面上的病是癫痫、脑瘤、意外撞伤后发痉，都可以用天麻。藏
            羚羊的角是很好的治抽痉的药，治疗脑瘤常用到。藏羚羊的角最好，还有川羚羊。`,
            tedian:`味辛温，主杀鬼精物蛊毒恶气，久服益气力长阴肥健轻身增年。
            今之天麻；天麻是袪风的药，杀鬼物精物，能够解毒（沼气）。味辛能润。`,
            jinji:`风药多燥，风能胜湿故也。凡病人觉津液少，口干舌燥，咽干痛，
            大便涩，及火炎头晕，血虚头痛，似中风症皆忌。`,
            paozhi:``,
            yongliang:'',
            qita:`【东垣】肝虚不足者，天麻川芎以补之。
            【罗天益】眼黑头眩，风虚内作，非天麻不能治，因此天麻有养血之功。
            【汪昂】风药中必兼养血药，以制其燥，养血药须兼收风药，宣其滞也。`,
            fangji:``,
            changyong:1
          },
          {
            ming:'奄闾子',
            xingweiguijing:'味辛性平无毒',
            gongneng:`奄闾主五脏瘀血，风寒湿痹，身体诸痛，明目益气消食`,
            tedian:`味苦微寒，主五脏瘀血，腹中水气，胪张留热，风寒湿痹，身
            体诸痛，久服轻身延年不老。
            奄闾子是伤科的药，主活血化瘀（味苦入心），内脏的五脏出血撞伤打伤，
            所有的痛都可以使用。用的时候内服和外服都可以，泡在药酒里涂也可以。`,
            jinji:`用之治扑打损伤效，罕有用于调理者`,
            paozhi:``,
            yongliang:'',
            qita:`【辨证】内有瘀血：舌头上面有黑痣，小腿胫骨从地机三阴交这一段肌肤甲
            错，胸口里面痛，就是腹部里面有瘀血。`,
            fangji:``,
            changyong:2
          },
          {
            ming:'析蓂子',
            xingweiguijing:'味辛微温',
            gongneng:`主明目目痛泪出，除痹痛，补五脏益精光，久服轻
            身不老`,
            tedian:``,
            jinji:``,
            paozhi:``,
            yongliang:'',
            qita:``,
            fangji:``,
            changyong:2
          },
          {
            ming:'蓍实',
            xingweiguijing:'味苦平',
            gongneng:`味苦平主益气充肌，明目聪慧先知，久服不饥不老轻身`,
            tedian:`蓍草成长的过程很慢，有时候三百年草都不会死。所以看过很多历史发生的
            事情，所以过去是利用它来卜筮，因为它最清楚。蓍草的茎用来卜筮，蓍草的果
            实就是蓍实。它排到 49，是因为爻课签筒里面有五十根的蓍茎，掉一根出来，
            四十九，那第一根出来是天（天人地），里面四十九，是希望跟易经扯上点关系。
            蓍草的果实可以让人聪明、有智慧、有先知，对身体很好。如果觉得小孩子
            比较笨，就找蓍实吃，是滋补的药`,
            jinji:``,
            paozhi:``,
            yongliang:'',
            qita:`【灵胎】此因其物之所能，以益人之能也，昔圣人幽赞于神明而生耆，此草
            中之神物也，服之则补人之心神，自能聪慧前知，食肉者鄙，不益信夫。能益智
            通灵。`,
            fangji:``,
            changyong:2
          },
          {
            ming:'赤芝黑芝青芝白芝黄芝紫芝（灵芝）',
            xingweiguijing:'赤芝——味苦平;黑芝——味咸平;青芝——味酸平;白芝——味辛平黄芝——味甘平;紫芝——味甘温',
            gongneng:`灵芝有青赤黄白黑紫色的，一共是六种。芝类的也是滋补的东西，能
            够益气补肝心脾肺肾。青芝补肝，红芝补心，白芝补肺，黄芝补脾，黑芝补个，
            紫芝坚筋骨，好颜色。都是无毒性的，都可以吃。`,
            tedian:`芝类的东西药性都是很平和的，治疗癌症很难，没有办法把阴实打开来的，
            但是能够袪命延年，就是预防生病，能够让五脏六腑功能变得很强`,
            jinji:``,
            paozhi:``,
            yongliang:'',
            qita:`【灵胎】此因其物之所能，以益人之能也，昔圣人幽赞于神明而生耆，此草
            中之神物也，服之则补人之心神，自能聪慧前知，食肉者鄙，不益信夫。能益智
            通灵。`,
            fangji:``,
            changyong:2
          },
          {
            ming:'卷柏',
            xingweiguijing:'味辛性平无毒',
            gongneng:`卷柏生用平，主破血通经，炙用性温，治肠风脱肛;
            `,
            tedian:`味辛温，主五脏邪气，女子阴中寒热，痛，症瘕（子宫瘤卵巢
            瘤等），血闭，绝子，久服轻身和颜色。一名万岁。卷柏最多是用在妇科，男人也可以用;
            味辛温，发散的力量很强，性温能够活血化瘀，可以治疗不孕不育，女人如
果子宫寒就不会怀孕，让子宫热起来就会怀孕，可以灸关元，吃卷柏`,
            jinji:`多用于止血药中，其他方剂罕用。`,
            paozhi:``,
            yongliang:'',
            qita:`【大明】镇心，除面皯，头风，暖水脏，生用破血，炙用止血。`,
            fangji:``,
            changyong:2
          },
          {
            ming:'蓝实（青黛）',
            xingweiguijing:'味咸性寒无毒',
            gongneng:`蓝实（青黛）为解散热毒要药，主散五脏郁火，治时疾热狂与大青
            同功，并敷热疮虫咬，头生黄水疮，治小儿丹毒。（外用）
            `,
            tedian:`味苦寒，主解毒，杀蛊蚑，注鬼，螫毒，久服头不白轻身。又
            今俗名青黛;青黛用途很多，可以生药带在身边，可以解毒，如旅行时到深山区域里面瘟
            疫瘴疫很多，毒蛇、蝎子、毒箭;【备要】外敷治痈疽蛇犬毒`,
            jinji:`凡血证非血分实热，而由阴虚内热，阳无所附，火气因空上炎，发
            为唾咯吐血诸证，切不可用青黛等，盖血得寒则凝，则寒热交作，胸隔或痛，愈
            增其病（血凝固住以后，造成血液循环不好，痛会更强）。必须要实证才会用到青黛。`,
            paozhi:``,
            yongliang:`普通三分至钱半。质地非常轻。三分、五分就一小包。生用，内服外敷。汤药煮完以后，把青黛放到嘴巴里面，用药冲下
            去，不要把青黛粉煮，直接生用，解毒的力量更强`,
            qita:`青黛与远志：两者都可以解乌头的毒，远志是喝乌头伤到心脏才吃，外面的
            伤口要用青黛;【时珍】主解斑蝥（甲虫类），芫青，朱砂，橒鸡，砒石毒`,
            fangji:`带状疱疹：先隔姜灸两边，三五壮；然后用凡士林黏住薄棉花烧过；最后撒
            上青黛粉。南派会开龙胆泻肝汤，也可以，配合的话效果很快，五到七就好了`,
            changyong:2
          },
          {
            ming:'芎穷（川穹/川芎）',
            xingweiguijing:'味辛性温无毒',
            gongneng:`川芎为顺气行血要药，功能行气开郁（辛散横行），入肝理血，上
            行头目，下行血海（子宫卵巢），主治头痛及妇女一切气郁血郁，心腹痛，腰脚
            软，破宿血，养新血，补肝散风
            `,
            tedian:`味辛温，主中风入脑，头痛寒痹，筋挛缓急，金疮，妇人血闭
            无子。一名川芎。肝病，头痛，妇科，寒性中风，都用川芎；活血化瘀：所有身体里面活血化瘀，不管在肌肉上、在内脏、在骨头、头痛，
            身上有疮，都可以用川芎`,
            jinji:`其性疏散，不宜久服，反能损肝，畏黄连，伏雌黄`,
            paozhi:``,
            yongliang:'普通三分至钱半。（大剂量没关系，三到五钱）',
            qita:`【容川】川芎之味更辛苦于当归，得木火之性尤烈，苦而兼辛，有生血之功，
            质不柔润，性专走窜，故专主行心肝之血。苦者火之味也，苦而兼辛，则性温而
            有生血之功，苦而不辛，则性凉而专主泻血，温者阴中之阳，是风木本气，故入
            肝经，根又主上升故能至于巅顶，以散风寒，气滞血瘀，寒热身疼，女子经闭不
            通（子宫胞户也有肝经），当行血中之气。`,
            fangji:`【引申】骨头外突：任何的骨头突出了，如大拇趾突出来，脚掌骨头突出来，
            脚后跟突出来，用单味川芎粉，放在棉布包里面，喷点米酒上去（温中），晚上
            睡觉时贴贴到骨头肿起来的地方，早上拿掉，每天晚上贴，。一包用一钱粉，用
            到两三四天后，味道没了代表药力过了，再拿一包贴。用针灸的报刺法也可以，
            刺完以后再贴川芎效果很好。；脂肪瘤：蓖麻籽磨过以后变成黑黑粘粘的膏状，涂在脂肪瘤上面，然后用纱
            布盖住，每天晚上贴，白天取下，一段时间就消掉。
            `,
            changyong:1
          },
        ]
      },
      {
        title: '木头类',
      },
      {
        title: '人体类',
      },
      {
        title: '走兽类',
      },
      {
        title: '家禽类',
      },
      {
        title: '鱼虫类',
      },
      {
        title: '果实类',
      },
      {
        title: '米谷类',
      },
      {
        title: '菜类',
      },
    ]
  },
  {
    title: '中经',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '下经',
    submenu: [{
      title: ''
    }]
  },
  {
    title: '增补',
    submenu: [{
      title: ''
    }]
  },
]
const zongyi = {
  wuxing: [{
    weiyi: '酸属木入肝',
    seyi: '青属木入肝',
    weiyong: '能涩能收',
    rujing: '气燥，足厥阴肝经，足少阳胆经',
    wuzangbuxie: '肝苦急，急食甘而缓之；肝欲散，急食辛以散之，以辛补之，以酸泻之',
    xiangsheng: '',
    xiangke: '',
    bingjin: '',
    suoshang: '',
    yinyang: '',
    xiangcong: '',
    liuyin: '',
  },
 ]
}

export {
  menuList,
  zongyi
}